[
    {
        "uid": 1791,
        "question": [
            "http://dbpedia.org/resource/2658_gingerich",
            "http://dbpedia.org/resource/harvard_college",
            "[sep]",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2658_Gingerich",
            "http://dbpedia.org/resource/Harvard_College"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/discoverer"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <predpos@@1> }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> } <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 540,
        "question": [
            "http://dbpedia.org/resource/gareth_southgate",
            "http://dbpedia.org/resource/middlesbrough_f.c.",
            "[sep]",
            "http://dbpedia.org/property/managerclubs"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gareth_Southgate",
            "http://dbpedia.org/resource/Middlesbrough_F.C."
        ],
        "goldrels": [
            "http://dbpedia.org/property/managerclubs"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "answer_3": "ask where { [UNK] [UNK] [UNK] <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 1113,
        "question": [
            "http://dbpedia.org/resource/johnny_cash",
            "[sep]",
            "http://dbpedia.org/property/associatedacts"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Johnny_Cash"
        ],
        "goldrels": [
            "http://dbpedia.org/property/associatedActs"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 3215,
        "question": [
            "http://dbpedia.org/resource/nice_&_smooth",
            "http://dbpedia.org/resource/same_song_(digital_underground_song)",
            "[sep]",
            "http://dbpedia.org/ontology/associatedband",
            "http://dbpedia.org/ontology/writer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Nice_&_Smooth",
            "http://dbpedia.org/resource/Same_Song_(Digital_Underground_song)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedBand",
            "http://dbpedia.org/ontology/writer"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] ( ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1279,
        "question": [
            "http://dbpedia.org/resource/glendale,_california",
            "[sep]",
            "http://dbpedia.org/ontology/restingplace",
            "http://dbpedia.org/ontology/award"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Glendale,_California"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/restingPlace",
            "http://dbpedia.org/ontology/award"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 840,
        "question": [
            "http://dbpedia.org/resource/fc_barcelona",
            "[sep]",
            "http://dbpedia.org/property/youthclubs"
        ],
        "goldents": [
            "http://dbpedia.org/resource/FC_Barcelona"
        ],
        "goldrels": [
            "http://dbpedia.org/property/youthclubs"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> (",
        "exact_match": "no match"
    },
    {
        "uid": 2194,
        "question": [
            "http://dbpedia.org/resource/robot_wars:_metal_mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/product",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/product",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1997,
        "question": [
            "http://dbpedia.org/resource/guitar",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/notableinstruments",
            "http://dbpedia.org/ontology/associatedmusicalartist",
            "http://dbpedia.org/ontology/artist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Guitar",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/notableInstruments",
            "http://dbpedia.org/ontology/associatedMusicalArtist",
            "http://dbpedia.org/ontology/Artist"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 881,
        "question": [
            "http://dbpedia.org/resource/thomas_egerton_(publisher)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/book"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thomas_Egerton_(publisher)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/Book"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 677,
        "question": [
            "http://dbpedia.org/resource/male",
            "[sep]",
            "http://dbpedia.org/ontology/gender"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Male"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/gender"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] (",
        "exact_match": "match"
    },
    {
        "uid": 598,
        "question": [
            "http://dbpedia.org/resource/indiana",
            "http://dbpedia.org/resource/iowa",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indiana",
            "http://dbpedia.org/resource/Iowa",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . <entpos@@3> <entpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . <entpos@@3> <entpos@@3> <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 2976,
        "question": [
            "http://dbpedia.org/resource/ford_motor_credit_company",
            "http://dbpedia.org/resource/ford_sho_v8_engine",
            "[sep]",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/manufacturer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ford_Motor_Credit_Company",
            "http://dbpedia.org/resource/Ford_SHO_V8_engine"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/manufacturer"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 591,
        "question": [
            "http://dbpedia.org/resource/screenwriting",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Screenwriting",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1001,
        "question": [
            "http://dbpedia.org/resource/united_states",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/placeofbirth",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/location"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/placeOfBirth",
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/Location"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 1472,
        "question": [
            "http://dbpedia.org/resource/gymnastics_at_the_2008_summer_olympics_\u2013_women's_artistic_individual_all-around",
            "[sep]",
            "http://dbpedia.org/ontology/silvermedalist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gymnastics_at_the_2008_Summer_Olympics_\u2013_Women's_artistic_individual_all-around"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/silverMedalist"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "answer_3": "select distinct { where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 273,
        "question": [
            "http://dbpedia.org/resource/joel_schumacher",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Joel_Schumacher",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 ?vr0 <predpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2136,
        "question": [
            "http://dbpedia.org/resource/judaism",
            "http://dbpedia.org/resource/islam",
            "[sep]",
            "http://dbpedia.org/ontology/veneratedin",
            "http://dbpedia.org/ontology/veneratedin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Judaism",
            "http://dbpedia.org/resource/Islam"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/veneratedIn",
            "http://dbpedia.org/ontology/veneratedIn"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 3045,
        "question": [
            "http://dbpedia.org/resource/warren_magnuson",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/senator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Warren_Magnuson",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/Senator"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] [UNK] ?vr1 <predpos@@2> ?vr1 ?vr0 <entpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2183,
        "question": [
            "http://dbpedia.org/resource/san_francisco_49ers",
            "[sep]",
            "http://dbpedia.org/ontology/debutteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/San_Francisco_49ers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/debutTeam"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 3232,
        "question": [
            "http://dbpedia.org/resource/maharashtra",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/purpose",
            "http://dbpedia.org/ontology/organisation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Maharashtra",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/purpose",
            "http://dbpedia.org/ontology/Organisation"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 61,
        "question": [
            "http://dbpedia.org/resource/front-engine,_four-wheel-drive_layout",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/layout",
            "http://dbpedia.org/ontology/layout",
            "http://dbpedia.org/ontology/automobile"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/layout",
            "http://dbpedia.org/ontology/layout",
            "http://dbpedia.org/ontology/Automobile"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 308,
        "question": [
            "http://dbpedia.org/resource/john_mcewen",
            "http://dbpedia.org/resource/ph\u1ea1m_v\u0103n_\u0111\u1ed3ng",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/militaryconflict"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_McEwen",
            "http://dbpedia.org/resource/Ph\u1ea1m_V\u0103n_\u0110\u1ed3ng",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/MilitaryConflict"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <predpos@@2> . ?vr0 <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1160,
        "question": [
            "http://dbpedia.org/resource/julian_leow_beng_kim",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/almamater",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Julian_Leow_Beng_Kim",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/almaMater",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { { <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 3119,
        "question": [
            "http://dbpedia.org/resource/at&t_park",
            "[sep]",
            "http://dbpedia.org/ontology/operator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/AT&T_Park"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/operator"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct { where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2270,
        "question": [
            "http://dbpedia.org/resource/australia_at_the_2008_summer_olympics",
            "http://dbpedia.org/resource/stephanie_rice",
            "[sep]",
            "http://dbpedia.org/property/flagbearer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Australia_at_the_2008_Summer_Olympics",
            "http://dbpedia.org/resource/Stephanie_Rice"
        ],
        "goldrels": [
            "http://dbpedia.org/property/flagbearer"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] (",
        "answer_3": "ask where { [UNK] [UNK] ( <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2596,
        "question": [
            "http://dbpedia.org/resource/king's_quest_vi",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/computingplatform",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/software"
        ],
        "goldents": [
            "http://dbpedia.org/resource/King's_Quest_VI",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/computingPlatform",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/Software"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] <predpos@@2> ?vr0 . ?vr1 ?vr1 <predpos@@3> }",
        "exact_match": "match"
    }
]