[
    {
        "uid": 1769,
        "question": [
            "http://dbpedia.org/resource/harry_and_the_potters_(album)",
            "[sep]",
            "http://dbpedia.org/ontology/genre",
            "http://dbpedia.org/ontology/stylisticorigin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Harry_and_the_Potters_(album)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/genre",
            "http://dbpedia.org/ontology/stylisticOrigin"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . <predpos@@2>",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "exact_match": "no match"
    },
    {
        "uid": 1094,
        "question": [
            "http://dbpedia.org/resource/2014\u201315_la_liga",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/season",
            "http://dbpedia.org/property/youthclubs",
            "http://dbpedia.org/ontology/athlete"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2014\u201315_La_Liga",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/season",
            "http://dbpedia.org/property/youthclubs",
            "http://dbpedia.org/ontology/Athlete"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 820,
        "question": [
            "http://dbpedia.org/resource/carolina_panthers",
            "http://dbpedia.org/resource/indianapolis_colts",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Carolina_Panthers",
            "http://dbpedia.org/resource/Indianapolis_Colts"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> <predpos@@2>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . .",
        "exact_match": "match"
    },
    {
        "uid": 2486,
        "question": [
            "http://dbpedia.org/resource/occupation_of_japan",
            "[sep]",
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/knownfor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Occupation_of_Japan"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/knownFor"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr1 . }",
        "exact_match": "no match"
    },
    {
        "uid": 556,
        "question": [
            "http://dbpedia.org/resource/te_deum_(charpentier)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/openingtheme",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Te_Deum_(Charpentier)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/openingTheme",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 75,
        "question": [
            "http://dbpedia.org/resource/ikaros_smederna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/league",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/speedwayleague"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ikaros_Smederna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/league",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/SpeedwayLeague"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr1 . <entpos@@2> <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2703,
        "question": [
            "http://dbpedia.org/resource/saleen_s5s_raptor",
            "[sep]",
            "http://dbpedia.org/ontology/designer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Saleen_S5S_Raptor"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/designer"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 136,
        "question": [
            "http://dbpedia.org/resource/ford_model_c",
            "http://dbpedia.org/resource/henry_ford",
            "[sep]",
            "http://dbpedia.org/ontology/designcompany"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ford_Model_C",
            "http://dbpedia.org/resource/Henry_Ford"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/designCompany"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( ( <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { [UNK] ( [UNK] <entpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 421,
        "question": [
            "http://dbpedia.org/resource/software_as_a_service",
            "[sep]",
            "http://dbpedia.org/ontology/license"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Software_as_a_service"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/license"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where ?vr0 ?vr0 <predpos@@1> <entpos@@1> . }",
        "exact_match": "no match"
    },
    {
        "uid": 1326,
        "question": [
            "http://dbpedia.org/resource/ionian_sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/outflow",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/sea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ionian_Sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/outflow",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/Sea"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1194,
        "question": [
            "http://dbpedia.org/resource/texas",
            "http://dbpedia.org/resource/dallas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/foundationplace",
            "http://dbpedia.org/ontology/foundationplace",
            "http://dbpedia.org/ontology/organisation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Texas",
            "http://dbpedia.org/resource/Dallas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/foundationPlace",
            "http://dbpedia.org/ontology/foundationPlace",
            "http://dbpedia.org/ontology/Organisation"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3016,
        "question": [
            "http://dbpedia.org/resource/mateusz_morawiecki",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/property/state",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mateusz_Morawiecki",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/property/state",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 ?vr1 <entpos@@2> <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 1688,
        "question": [
            "http://dbpedia.org/resource/sierra_nevada_(u.s.)",
            "[sep]",
            "http://dbpedia.org/ontology/mountainrange"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sierra_Nevada_(U.S.)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mountainRange"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 36,
        "question": [
            "http://dbpedia.org/resource/freedom_of_the_city",
            "http://dbpedia.org/resource/trinity_house",
            "[sep]",
            "http://dbpedia.org/ontology/board",
            "http://dbpedia.org/ontology/board"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Freedom_of_the_City",
            "http://dbpedia.org/resource/Trinity_House"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/board",
            "http://dbpedia.org/ontology/board"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 1416,
        "question": [
            "http://dbpedia.org/resource/jon_speelman",
            "http://dbpedia.org/resource/polytechnic_university_of_the_philippines_taguig",
            "[sep]",
            "http://dbpedia.org/ontology/field",
            "http://dbpedia.org/ontology/sport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jon_Speelman",
            "http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/field",
            "http://dbpedia.org/ontology/sport"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where <entpos@@1> <entpos@@1> <predpos@@1> ?vr0 . [UNK] } [UNK]",
        "exact_match": "match"
    },
    {
        "uid": 1560,
        "question": [
            "http://dbpedia.org/resource/pope_benedict_xvi",
            "[sep]",
            "http://dbpedia.org/property/canonizedby"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Pope_Benedict_XVI"
        ],
        "goldrels": [
            "http://dbpedia.org/property/canonizedBy"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_3": "select distinct count ( ?vr0 ) where { { <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 116,
        "question": [
            "http://dbpedia.org/resource/lucy_sullivan_is_getting_married",
            "[sep]",
            "http://dbpedia.org/property/starring"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married"
        ],
        "goldrels": [
            "http://dbpedia.org/property/starring"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . } ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> [UNK] <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 720,
        "question": [
            "http://dbpedia.org/resource/pcl_construction",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/builder",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/PCL_Construction",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/builder",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] <predpos@@1> <predpos@@2> <predpos@@2> ?vr0 . <predpos@@2> <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2142,
        "question": [
            "http://dbpedia.org/resource/firmicutes",
            "http://dbpedia.org/resource/bacteria",
            "[sep]",
            "http://dbpedia.org/ontology/division",
            "http://dbpedia.org/property/domain"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Firmicutes",
            "http://dbpedia.org/resource/Bacteria"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/division",
            "http://dbpedia.org/property/domain"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 852,
        "question": [
            "http://dbpedia.org/resource/christina_crawford_(wrestler)",
            "http://dbpedia.org/resource/trish_stratus",
            "[sep]",
            "http://dbpedia.org/property/trainer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Christina_Crawford_(wrestler)",
            "http://dbpedia.org/resource/Trish_Stratus"
        ],
        "goldrels": [
            "http://dbpedia.org/property/trainer"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> .",
        "answer_3": "ask where { [UNK] [UNK] [UNK] <predpos@@1> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 2404,
        "question": [
            "http://dbpedia.org/resource/toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/building"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/Building"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 ?vr0 <predpos@@2> <predpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { { <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1620,
        "question": [
            "http://dbpedia.org/resource/united_states_navy",
            "http://dbpedia.org/resource/united_states_department_of_defense",
            "[sep]",
            "http://dbpedia.org/property/commandstructure"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States_Navy",
            "http://dbpedia.org/resource/United_States_Department_of_Defense"
        ],
        "goldrels": [
            "http://dbpedia.org/property/commandStructure"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_3": "ask where ?vr0 <entpos@@1> <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 755,
        "question": [
            "http://dbpedia.org/resource/grand_forks_air_force_base",
            "[sep]",
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/region"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Grand_Forks_Air_Force_Base"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/region"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 1264,
        "question": [
            "http://dbpedia.org/resource/the_spirit_of_christmas_(short_film)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/previouswork",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Spirit_of_Christmas_(short_film)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/previousWork",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> . } ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 92,
        "question": [
            "http://dbpedia.org/resource/1st_free_french_division",
            "[sep]",
            "http://dbpedia.org/property/notablecommanders",
            "http://dbpedia.org/property/battles"
        ],
        "goldents": [
            "http://dbpedia.org/resource/1st_Free_French_Division"
        ],
        "goldrels": [
            "http://dbpedia.org/property/notableCommanders",
            "http://dbpedia.org/property/battles"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 974,
        "question": [
            "http://dbpedia.org/resource/ph\u1ea1m_v\u0103n_\u0111\u1ed3ng",
            "http://dbpedia.org/resource/john_mcewen",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/militaryconflict"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ph\u1ea1m_V\u0103n_\u0110\u1ed3ng",
            "http://dbpedia.org/resource/John_McEwen",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/MilitaryConflict"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <predpos@@2> . <entpos@@3> <entpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 429,
        "question": [
            "http://dbpedia.org/resource/walt_disney_studios_(division)",
            "http://dbpedia.org/resource/pixar",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Walt_Disney_Studios_(division)",
            "http://dbpedia.org/resource/Pixar"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] (",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] ( <entpos@@2>",
        "exact_match": "no match"
    }
]