[
    {
        "uid": 3056,
        "question": [
            "http://dbpedia.org/resource/maharashtra",
            "[sep]",
            "http://dbpedia.org/ontology/state",
            "http://dbpedia.org/ontology/sport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Maharashtra"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/state",
            "http://dbpedia.org/ontology/sport"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 3046,
        "question": [
            "http://dbpedia.org/resource/blytheville_high_school",
            "[sep]",
            "http://dbpedia.org/ontology/mascot"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Blytheville_High_School"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mascot"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> [UNK] (",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> [UNK] ( <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> ( (",
        "exact_match": "match"
    },
    {
        "uid": 2289,
        "question": [
            "http://dbpedia.org/resource/fox_broadcasting_company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/channel",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fox_Broadcasting_Company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/channel",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 3085,
        "question": [
            "http://dbpedia.org/resource/heroman",
            "http://dbpedia.org/resource/karakuri_d\u00f4ji_ultimo",
            "[sep]",
            "http://dbpedia.org/ontology/author",
            "http://dbpedia.org/ontology/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Heroman",
            "http://dbpedia.org/resource/Karakuri_D\u00f4ji_Ultimo"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/author",
            "http://dbpedia.org/ontology/author"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0",
        "exact_match": "no match"
    },
    {
        "uid": 366,
        "question": [
            "http://dbpedia.org/resource/german-occupied_europe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/jurisdiction",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/governmentagency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/German-occupied_Europe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/jurisdiction",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/GovernmentAgency"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 3171,
        "question": [
            "http://dbpedia.org/resource/de_la_rose",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/breeder",
            "http://dbpedia.org/ontology/birthplace",
            "http://dbpedia.org/ontology/jockey"
        ],
        "goldents": [
            "http://dbpedia.org/resource/De_La_Rose",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/breeder",
            "http://dbpedia.org/ontology/birthPlace",
            "http://dbpedia.org/ontology/Jockey"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <predpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1282,
        "question": [
            "http://dbpedia.org/resource/argentine_primera_divisi\u00f3n",
            "[sep]",
            "http://dbpedia.org/property/league",
            "http://dbpedia.org/property/youthclubs"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Argentine_Primera_Divisi\u00f3n"
        ],
        "goldrels": [
            "http://dbpedia.org/property/league",
            "http://dbpedia.org/property/youthclubs"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . <predpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2378,
        "question": [
            "http://dbpedia.org/resource/charles_phelps_taft_ii",
            "http://dbpedia.org/resource/robert_a._taft",
            "[sep]",
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/child"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Charles_Phelps_Taft_II",
            "http://dbpedia.org/resource/Robert_A._Taft"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/child"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . <entpos@@2> <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 1738,
        "question": [
            "http://dbpedia.org/resource/karu_jayasuriya",
            "http://dbpedia.org/resource/ranil_wickremesinghe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Karu_Jayasuriya",
            "http://dbpedia.org/resource/Ranil_Wickremesinghe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/Country"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1553,
        "question": [
            "http://dbpedia.org/resource/metaphysics",
            "[sep]",
            "http://dbpedia.org/property/maininterests",
            "http://dbpedia.org/property/maininterests"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Metaphysics"
        ],
        "goldrels": [
            "http://dbpedia.org/property/mainInterests",
            "http://dbpedia.org/property/mainInterests"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 857,
        "question": [
            "http://dbpedia.org/resource/2002_players_championship",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/champion",
            "http://dbpedia.org/ontology/nationality",
            "http://dbpedia.org/ontology/golfplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2002_Players_Championship",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/champion",
            "http://dbpedia.org/ontology/nationality",
            "http://dbpedia.org/ontology/GolfPlayer"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] ?vr1 ?vr0 ?vr1 <entpos@@2> ?vr1 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] ?vr1 ?vr0 ?vr1 <entpos@@2> ?vr1 } <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 786,
        "question": [
            "http://dbpedia.org/resource/pixar_image_computer",
            "[sep]",
            "http://dbpedia.org/ontology/product"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Pixar_Image_Computer"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/product"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 550,
        "question": [
            "http://dbpedia.org/resource/chordate",
            "http://dbpedia.org/resource/diprotodontia",
            "[sep]",
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/order"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Chordate",
            "http://dbpedia.org/resource/Diprotodontia"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/order"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1406,
        "question": [
            "http://dbpedia.org/resource/krzysztof_wielicki",
            "[sep]",
            "http://dbpedia.org/ontology/firstascentperson"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Krzysztof_Wielicki"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/firstAscentPerson"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] [UNK] <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 1192,
        "question": [
            "http://dbpedia.org/resource/mississippi",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/wineregion",
            "http://dbpedia.org/ontology/wineregion",
            "http://dbpedia.org/ontology/grape"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mississippi",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/wineRegion",
            "http://dbpedia.org/ontology/wineRegion",
            "http://dbpedia.org/ontology/Grape"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 99,
        "question": [
            "http://dbpedia.org/resource/cowombat_flat",
            "http://dbpedia.org/resource/murray_mouth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/source",
            "http://dbpedia.org/ontology/rivermouth",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Cowombat_Flat",
            "http://dbpedia.org/resource/Murray_Mouth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/source",
            "http://dbpedia.org/ontology/riverMouth",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <predpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1996,
        "question": [
            "http://dbpedia.org/resource/switzerland_at_the_2004_summer_olympics",
            "http://dbpedia.org/resource/roger_federer",
            "[sep]",
            "http://dbpedia.org/property/flagbearer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Switzerland_at_the_2004_Summer_Olympics",
            "http://dbpedia.org/resource/Roger_Federer"
        ],
        "goldrels": [
            "http://dbpedia.org/property/flagbearer"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_3": "ask where { [UNK] [UNK] [UNK] <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1855,
        "question": [
            "http://dbpedia.org/resource/microsoft_windows",
            "http://dbpedia.org/resource/mac_os",
            "[sep]",
            "http://dbpedia.org/ontology/operatingsystem",
            "http://dbpedia.org/ontology/operatingsystem"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Microsoft_Windows",
            "http://dbpedia.org/resource/Mac_OS"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/operatingSystem",
            "http://dbpedia.org/ontology/operatingSystem"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1977,
        "question": [
            "http://dbpedia.org/resource/skull_gang",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/bandmember",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Skull_Gang",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/bandMember",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1464,
        "question": [
            "http://dbpedia.org/resource/zachary_taylor",
            "http://dbpedia.org/resource/major_general_(united_states)",
            "[sep]",
            "http://dbpedia.org/property/rank"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Zachary_Taylor",
            "http://dbpedia.org/resource/Major_general_(United_States)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/rank"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_3": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 68,
        "question": [
            "http://dbpedia.org/resource/shallot",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/ingredient",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Shallot",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/ingredient",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/Country"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 361,
        "question": [
            "http://dbpedia.org/resource/australia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/regionserved",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Australia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/regionServed",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 ?vr0 <predpos@@2> <predpos@@2>",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct count ( ?vr0 . where { ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 379,
        "question": [
            "http://dbpedia.org/resource/winston_bryant",
            "http://dbpedia.org/resource/joe_purcell",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/president"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Winston_Bryant",
            "http://dbpedia.org/resource/Joe_Purcell",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/President"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . <entpos@@3> <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1074,
        "question": [
            "http://dbpedia.org/resource/north_sea",
            "[sep]",
            "http://dbpedia.org/property/inflow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/North_Sea"
        ],
        "goldrels": [
            "http://dbpedia.org/property/inflow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 961,
        "question": [
            "http://dbpedia.org/resource/islam",
            "http://dbpedia.org/resource/judaism",
            "[sep]",
            "http://dbpedia.org/ontology/veneratedin",
            "http://dbpedia.org/ontology/veneratedin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Islam",
            "http://dbpedia.org/resource/Judaism"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/veneratedIn",
            "http://dbpedia.org/ontology/veneratedIn"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 636,
        "question": [
            "http://dbpedia.org/resource/ike_clanton",
            "http://dbpedia.org/resource/billy_clanton",
            "[sep]",
            "http://dbpedia.org/ontology/opponent",
            "http://dbpedia.org/ontology/opponent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ike_Clanton",
            "http://dbpedia.org/resource/Billy_Clanton"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/opponent",
            "http://dbpedia.org/ontology/opponent"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] }",
        "exact_match": "match"
    }
]