[
    {
        "uid": 1085,
        "question": [
            "http://dbpedia.org/resource/sony_corporation_shareholders_and_subsidiaries",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/ontology/manufacturer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sony_Corporation_shareholders_and_subsidiaries"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/ontology/manufacturer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . <predpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 28,
        "question": [
            "http://dbpedia.org/resource/he's_a_liar",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/previouswork",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/song"
        ],
        "goldents": [
            "http://dbpedia.org/resource/He's_a_Liar",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/previousWork",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/Song"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] <predpos@@2> ?vr0 . ?vr1 ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 328,
        "question": [
            "http://dbpedia.org/resource/royal_thai_army",
            "[sep]",
            "http://dbpedia.org/ontology/militarybranch",
            "http://dbpedia.org/ontology/religion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Royal_Thai_Army"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryBranch",
            "http://dbpedia.org/ontology/religion"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 3011,
        "question": [
            "http://dbpedia.org/resource/mickey's_mellerdrammer",
            "[sep]",
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/award"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mickey's_Mellerdrammer"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/award"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . .",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 .",
        "answer_3": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 47,
        "question": [
            "http://dbpedia.org/resource/fran\u00e7ois-marie_le_marchand_de_lignery",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/property/combatant",
            "http://dbpedia.org/ontology/militaryconflict"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fran\u00e7ois-Marie_Le_Marchand_de_Lignery",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/property/combatant",
            "http://dbpedia.org/ontology/MilitaryConflict"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3107,
        "question": [
            "http://dbpedia.org/resource/the_pentagon",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/garrison",
            "http://dbpedia.org/ontology/militaryunit"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Pentagon",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/garrison",
            "http://dbpedia.org/ontology/MilitaryUnit"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 526,
        "question": [
            "http://dbpedia.org/resource/suburb",
            "[sep]",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/property/education"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Suburb"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/property/education"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 2873,
        "question": [
            "http://dbpedia.org/resource/jean-claude_latombe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/doctoraladvisor",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jean-Claude_Latombe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralAdvisor",
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 606,
        "question": [
            "http://dbpedia.org/resource/guatemala",
            "http://dbpedia.org/resource/unitary_state",
            "[sep]",
            "http://dbpedia.org/ontology/governmenttype"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Guatemala",
            "http://dbpedia.org/resource/Unitary_state"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/governmentType"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "answer_3": "ask where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 1387,
        "question": [
            "http://dbpedia.org/resource/one_day_at_a_time_(em's_version)",
            "[sep]",
            "http://dbpedia.org/ontology/subsequentwork",
            "http://dbpedia.org/ontology/writer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/One_Day_at_a_Time_(Em's_Version)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsequentWork",
            "http://dbpedia.org/ontology/writer"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . .",
        "exact_match": "match"
    },
    {
        "uid": 2293,
        "question": [
            "http://dbpedia.org/resource/diprotodontia",
            "http://dbpedia.org/resource/chordate",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/mammal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Diprotodontia",
            "http://dbpedia.org/resource/Chordate",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/Mammal"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 567,
        "question": [
            "http://dbpedia.org/resource/alexander_magleby",
            "http://dbpedia.org/resource/dartmouth_college",
            "[sep]",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Alexander_Magleby",
            "http://dbpedia.org/resource/Dartmouth_College"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/university"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> } <predpos@@1>",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> (",
        "exact_match": "match"
    },
    {
        "uid": 107,
        "question": [
            "http://dbpedia.org/resource/blayse",
            "http://dbpedia.org/resource/teddy_riley",
            "[sep]",
            "http://dbpedia.org/ontology/associatedband",
            "http://dbpedia.org/ontology/associatedband"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Blayse",
            "http://dbpedia.org/resource/Teddy_Riley"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedBand",
            "http://dbpedia.org/ontology/associatedBand"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 1071,
        "question": [
            "http://dbpedia.org/resource/mount_everest",
            "http://dbpedia.org/resource/tenzing_norgay",
            "[sep]",
            "http://dbpedia.org/ontology/firstascentperson"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mount_Everest",
            "http://dbpedia.org/resource/Tenzing_Norgay"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/firstAscentPerson"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_3": "ask where { [UNK] <predpos@@1> [UNK] <predpos@@1> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 740,
        "question": [
            "http://dbpedia.org/resource/microsoft_office_picture_manager",
            "http://dbpedia.org/resource/google_cloud_connect",
            "[sep]",
            "http://dbpedia.org/ontology/license",
            "http://dbpedia.org/ontology/computingplatform"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Microsoft_Office_Picture_Manager",
            "http://dbpedia.org/resource/Google_Cloud_Connect"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/license",
            "http://dbpedia.org/ontology/computingPlatform"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] ( [UNK] . <entpos@@2> [UNK] [UNK] <entpos@@2> . ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1745,
        "question": [
            "http://dbpedia.org/resource/uncle_henry_(oz)",
            "http://dbpedia.org/resource/human",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/species",
            "http://dbpedia.org/ontology/fictionalcharacter"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Uncle_Henry_(Oz)",
            "http://dbpedia.org/resource/Human",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/species",
            "http://dbpedia.org/ontology/FictionalCharacter"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . <entpos@@2> <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1993,
        "question": [
            "http://dbpedia.org/resource/elizabeth_alexander_(press_secretary)",
            "[sep]",
            "http://dbpedia.org/ontology/vicepresident"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Elizabeth_Alexander_(press_secretary)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/vicePresident"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 23,
        "question": [
            "http://dbpedia.org/resource/21vianet",
            "[sep]",
            "http://dbpedia.org/property/services"
        ],
        "goldents": [
            "http://dbpedia.org/resource/21Vianet"
        ],
        "goldrels": [
            "http://dbpedia.org/property/services"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 2642,
        "question": [
            "http://dbpedia.org/resource/downriver",
            "http://dbpedia.org/resource/cyrus_mann",
            "[sep]",
            "http://dbpedia.org/ontology/state",
            "http://dbpedia.org/ontology/birthplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Downriver",
            "http://dbpedia.org/resource/Cyrus_Mann"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/state",
            "http://dbpedia.org/ontology/birthPlace"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 867,
        "question": [
            "http://dbpedia.org/resource/georgetown_university",
            "http://dbpedia.org/resource/william_doyle_(businessman)",
            "[sep]",
            "http://dbpedia.org/property/chairman"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Georgetown_University",
            "http://dbpedia.org/resource/William_Doyle_(businessman)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/chairman"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] (",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 915,
        "question": [
            "http://dbpedia.org/resource/the_price_of_beauty",
            "[sep]",
            "http://dbpedia.org/ontology/narrator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Price_of_Beauty"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/narrator"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] [UNK] [UNK] [UNK] .",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 (",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] [UNK] ( .",
        "exact_match": "match"
    },
    {
        "uid": 2079,
        "question": [
            "http://dbpedia.org/resource/colonial_troops",
            "[sep]",
            "http://dbpedia.org/ontology/militarybranch"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Colonial_troops"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryBranch"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] (",
        "exact_match": "no match"
    },
    {
        "uid": 1618,
        "question": [
            "http://dbpedia.org/resource/french_people",
            "[sep]",
            "http://dbpedia.org/ontology/stateoforigin",
            "http://dbpedia.org/property/awards"
        ],
        "goldents": [
            "http://dbpedia.org/resource/French_people"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/stateOfOrigin",
            "http://dbpedia.org/property/awards"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1990,
        "question": [
            "http://dbpedia.org/resource/motown",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/recordlabel",
            "http://dbpedia.org/property/associatedacts",
            "http://dbpedia.org/ontology/band"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Motown",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/recordLabel",
            "http://dbpedia.org/property/associatedActs",
            "http://dbpedia.org/ontology/Band"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1770,
        "question": [
            "http://dbpedia.org/resource/indianapolis_colts",
            "http://dbpedia.org/resource/carolina_panthers",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indianapolis_Colts",
            "http://dbpedia.org/resource/Carolina_Panthers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1084,
        "question": [
            "http://dbpedia.org/resource/a_goon's_deed_in_a_weary_world",
            "http://dbpedia.org/resource/cbs",
            "[sep]",
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/occupation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World",
            "http://dbpedia.org/resource/CBS"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/occupation"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 1884,
        "question": [
            "http://dbpedia.org/resource/evergreen_high_school_(king_county,_washington)",
            "[sep]",
            "http://dbpedia.org/ontology/county",
            "http://dbpedia.org/ontology/countyseat"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Evergreen_High_School_(King_County,_Washington)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/county",
            "http://dbpedia.org/ontology/countySeat"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1seat> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 ?vr1 ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 [UNK] ?vr0 . }",
        "exact_match": "no match"
    }
]