[
    {
        "uid": 1603,
        "question": [
            "http://dbpedia.org/resource/joe_shuster",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/creators",
            "http://dbpedia.org/ontology/comicscharacter"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Joe_Shuster",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/creators",
            "http://dbpedia.org/ontology/ComicsCharacter"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 <predpos@@2> <predpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 316,
        "question": [
            "http://dbpedia.org/resource/english_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/officiallanguage",
            "http://dbpedia.org/ontology/sourcecountry",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/English_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/officialLanguage",
            "http://dbpedia.org/ontology/sourceCountry",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1526,
        "question": [
            "http://dbpedia.org/resource/novair_international_airways",
            "http://dbpedia.org/resource/spaghetti_squash",
            "[sep]",
            "http://dbpedia.org/ontology/destination",
            "http://dbpedia.org/ontology/origin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Novair_International_Airways",
            "http://dbpedia.org/resource/Spaghetti_squash"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/destination",
            "http://dbpedia.org/ontology/origin"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 2052,
        "question": [
            "http://dbpedia.org/resource/double_diamond_(album)",
            "[sep]",
            "http://dbpedia.org/ontology/recordlabel"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Double_Diamond_(album)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/recordLabel"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 1964,
        "question": [
            "http://dbpedia.org/resource/xynisteri",
            "[sep]",
            "http://dbpedia.org/ontology/origin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Xynisteri"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/origin"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1759,
        "question": [
            "http://dbpedia.org/resource/hard_candy_fitness",
            "http://dbpedia.org/resource/moscow",
            "[sep]",
            "http://dbpedia.org/property/divisions"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Hard_Candy_Fitness",
            "http://dbpedia.org/resource/Moscow"
        ],
        "goldrels": [
            "http://dbpedia.org/property/divisions"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "where where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "answer_3": "ask where { [UNK] ( ( <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 3235,
        "question": [
            "http://dbpedia.org/resource/nasa",
            "http://dbpedia.org/resource/gemini_8",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/ontology/mission",
            "http://dbpedia.org/ontology/astronaut"
        ],
        "goldents": [
            "http://dbpedia.org/resource/NASA",
            "http://dbpedia.org/resource/Gemini_8",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/ontology/mission",
            "http://dbpedia.org/ontology/Astronaut"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1190,
        "question": [
            "http://dbpedia.org/resource/canc\u00fan",
            "[sep]",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Canc\u00fan"
        ],
        "goldrels": [
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/country"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 1935,
        "question": [
            "http://dbpedia.org/resource/tandem_computers",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Tandem_Computers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 3177,
        "question": [
            "http://dbpedia.org/resource/deborah_crombie",
            "[sep]",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/mascot"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Deborah_Crombie"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/mascot"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 ?vr1 ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 [UNK] ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 1552,
        "question": [
            "http://dbpedia.org/resource/uncle_henry_(oz)",
            "http://dbpedia.org/resource/aunt_em",
            "[sep]",
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/relative"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Uncle_Henry_(Oz)",
            "http://dbpedia.org/resource/Aunt_Em"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/relative"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 2824,
        "question": [
            "http://dbpedia.org/resource/stewart_copeland",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/composer",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Stewart_Copeland",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/composer",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1984,
        "question": [
            "http://dbpedia.org/resource/rca_records",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/recordlabel",
            "http://dbpedia.org/ontology/musiccomposer",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/RCA_Records",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/recordLabel",
            "http://dbpedia.org/ontology/musicComposer",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 2544,
        "question": [
            "http://dbpedia.org/resource/daniel_gibson",
            "[sep]",
            "http://dbpedia.org/ontology/spouse"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Daniel_Gibson"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 871,
        "question": [
            "http://dbpedia.org/resource/ford_kansas_city_assembly_plant",
            "http://dbpedia.org/resource/ford_motor_company",
            "[sep]",
            "http://dbpedia.org/ontology/owningorganisation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ford_Kansas_City_Assembly_Plant",
            "http://dbpedia.org/resource/Ford_Motor_Company"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owningOrganisation"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_2": "ask where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "answer_3": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 2798,
        "question": [
            "http://dbpedia.org/resource/aeroklub_wroc\u0142aw",
            "[sep]",
            "http://dbpedia.org/ontology/institution",
            "http://dbpedia.org/ontology/nationality"
        ],
        "goldents": [
            "http://dbpedia.org/resource/AeroKlub_Wroc\u0142aw"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/institution",
            "http://dbpedia.org/ontology/nationality"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 408,
        "question": [
            "http://dbpedia.org/resource/kirk_hammett",
            "http://dbpedia.org/resource/gibson_flying_v",
            "[sep]",
            "http://dbpedia.org/ontology/instrument"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Kirk_Hammett",
            "http://dbpedia.org/resource/Gibson_Flying_V"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/instrument"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_3": "ask where { [UNK] ( ( <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1341,
        "question": [
            "http://dbpedia.org/resource/winchester_cathedral",
            "[sep]",
            "http://dbpedia.org/ontology/restingplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Winchester_Cathedral"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/restingPlace"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_3": "select distinct ?vr0 ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 492,
        "question": [
            "http://dbpedia.org/resource/johnny_cash",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/associatedacts",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Johnny_Cash",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/associatedActs",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1701,
        "question": [
            "http://dbpedia.org/resource/neuroimaging",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/academicdiscipline",
            "http://dbpedia.org/ontology/academicdiscipline",
            "http://dbpedia.org/ontology/academicjournal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Neuroimaging",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/academicDiscipline",
            "http://dbpedia.org/ontology/academicDiscipline",
            "http://dbpedia.org/ontology/AcademicJournal"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1027,
        "question": [
            "http://dbpedia.org/resource/easy_street_(film)",
            "[sep]",
            "http://dbpedia.org/ontology/editing"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Easy_Street_(film)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/editing"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK]",
        "exact_match": "match"
    },
    {
        "uid": 3,
        "question": [
            "http://dbpedia.org/resource/roberto_clemente_bridge",
            "[sep]",
            "http://dbpedia.org/ontology/municipality"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Roberto_Clemente_Bridge"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/municipality"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] [UNK] <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2655,
        "question": [
            "http://dbpedia.org/resource/sentinel_high_school",
            "[sep]",
            "http://dbpedia.org/ontology/teamname"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sentinel_High_School"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/teamName"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2266,
        "question": [
            "http://dbpedia.org/resource/diprotodontia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/mammal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Diprotodontia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/Mammal"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 2144,
        "question": [
            "http://dbpedia.org/resource/neil_cross",
            "http://dbpedia.org/resource/russell_t_davies",
            "[sep]",
            "http://dbpedia.org/ontology/notablework",
            "http://dbpedia.org/ontology/notablework"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Neil_Cross",
            "http://dbpedia.org/resource/Russell_T_Davies"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/notableWork",
            "http://dbpedia.org/ontology/notableWork"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 } <predpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1572,
        "question": [
            "http://dbpedia.org/resource/2015_alabama_crimson_tide_football_team",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/champion",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/champion",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1927,
        "question": [
            "http://dbpedia.org/resource/battle_of_the_thames",
            "http://dbpedia.org/resource/war_of_1812",
            "[sep]",
            "http://dbpedia.org/ontology/knownfor",
            "http://dbpedia.org/ontology/knownfor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Battle_of_the_Thames",
            "http://dbpedia.org/resource/War_of_1812"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/knownFor",
            "http://dbpedia.org/ontology/knownFor"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "exact_match": "no match"
    },
    {
        "uid": 2688,
        "question": [
            "http://dbpedia.org/resource/stony_brook_university_hospital",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/education",
            "http://dbpedia.org/ontology/fashiondesigner"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Stony_Brook_University_Hospital",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/education",
            "http://dbpedia.org/ontology/FashionDesigner"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    }
]