[
    {
        "uid": 551,
        "question": [
            "http://dbpedia.org/resource/letitia_mactavish_hargrave",
            "http://dbpedia.org/resource/martino_martini",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathcause",
            "http://dbpedia.org/ontology/deathcause",
            "http://dbpedia.org/ontology/disease"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Letitia_MacTavish_Hargrave",
            "http://dbpedia.org/resource/Martino_Martini",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathCause",
            "http://dbpedia.org/ontology/deathCause",
            "http://dbpedia.org/ontology/Disease"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . <entpos@@3> <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <predpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1045,
        "question": [
            "http://dbpedia.org/resource/peanuts_motion_comics",
            "http://dbpedia.org/resource/the_peanuts_movie",
            "[sep]",
            "http://dbpedia.org/ontology/voice",
            "http://dbpedia.org/ontology/voice"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Peanuts_Motion_Comics",
            "http://dbpedia.org/resource/The_Peanuts_Movie"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/voice",
            "http://dbpedia.org/ontology/voice"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( ?vr0 . [UNK] <predpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2053,
        "question": [
            "http://dbpedia.org/resource/american_mediterranean_sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/city"
        ],
        "goldents": [
            "http://dbpedia.org/resource/American_Mediterranean_Sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/City"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> } }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> } }",
        "exact_match": "no match"
    },
    {
        "uid": 2055,
        "question": [
            "http://dbpedia.org/resource/bellator_mma:_season_eleven",
            "[sep]",
            "http://dbpedia.org/property/city"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bellator_MMA:_Season_Eleven"
        ],
        "goldrels": [
            "http://dbpedia.org/property/city"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> [UNK] <predpos@@1> [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 1009,
        "question": [
            "http://dbpedia.org/resource/teddy_riley",
            "http://dbpedia.org/resource/take_me_there_(blackstreet_&_m\u00fda_song)",
            "[sep]",
            "http://dbpedia.org/ontology/associatedband",
            "http://dbpedia.org/ontology/musicalband"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Teddy_Riley",
            "http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedBand",
            "http://dbpedia.org/ontology/musicalBand"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] . ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 173,
        "question": [
            "http://dbpedia.org/resource/reading,_berkshire",
            "http://dbpedia.org/resource/gloucestershire",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/sourceplace",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Reading,_Berkshire",
            "http://dbpedia.org/resource/Gloucestershire",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/sourcePlace",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2502,
        "question": [
            "http://dbpedia.org/resource/camp_nou",
            "[sep]",
            "http://dbpedia.org/ontology/ground",
            "http://dbpedia.org/property/youthclubs"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Camp_Nou"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/ground",
            "http://dbpedia.org/property/youthclubs"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 776,
        "question": [
            "http://dbpedia.org/resource/yes_(band)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/associatedmusicalartist",
            "http://dbpedia.org/ontology/musiccomposer",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Yes_(band)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedMusicalArtist",
            "http://dbpedia.org/ontology/musicComposer",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 21,
        "question": [
            "http://dbpedia.org/resource/niederkirchnerstra\u00dfe",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Niederkirchnerstra\u00dfe"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 997,
        "question": [
            "http://dbpedia.org/resource/the_skeleton_dance",
            "http://dbpedia.org/resource/the_haunted_house_(1929_film)",
            "[sep]",
            "http://dbpedia.org/ontology/animator",
            "http://dbpedia.org/ontology/director"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Skeleton_Dance",
            "http://dbpedia.org/resource/The_Haunted_House_(1929_film)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/animator",
            "http://dbpedia.org/ontology/director"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] . ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 1671,
        "question": [
            "http://dbpedia.org/resource/playtone",
            "http://dbpedia.org/resource/dreamworks_television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Playtone",
            "http://dbpedia.org/resource/DreamWorks_Television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 189,
        "question": [
            "http://dbpedia.org/resource/arizona_state_sun_devils",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/college",
            "http://dbpedia.org/ontology/golfplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Arizona_State_Sun_Devils",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/college",
            "http://dbpedia.org/ontology/GolfPlayer"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 694,
        "question": [
            "http://dbpedia.org/resource/let_me_be_your_star",
            "[sep]",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/property/guests"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Let_Me_Be_Your_Star"
        ],
        "goldrels": [
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/property/guests"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . . <predpos@@2> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 1681,
        "question": [
            "http://dbpedia.org/resource/buccinoidea",
            "http://dbpedia.org/resource/buccinidae",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Buccinoidea",
            "http://dbpedia.org/resource/Buccinidae"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <entpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 1487,
        "question": [
            "http://dbpedia.org/resource/paramount_television",
            "http://dbpedia.org/resource/nbc",
            "[sep]",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/network"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Paramount_Television",
            "http://dbpedia.org/resource/NBC"
        ],
        "goldrels": [
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/network"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> .",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1119,
        "question": [
            "http://dbpedia.org/resource/connecticut_river",
            "http://dbpedia.org/resource/white_river_(vermont)",
            "[sep]",
            "http://dbpedia.org/ontology/righttributary"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Connecticut_River",
            "http://dbpedia.org/resource/White_River_(Vermont)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/rightTributary"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] } [UNK] }",
        "answer_3": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1713,
        "question": [
            "http://dbpedia.org/resource/warner_bros.",
            "[sep]",
            "http://dbpedia.org/property/distributor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Warner_Bros."
        ],
        "goldrels": [
            "http://dbpedia.org/property/distributor"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 998,
        "question": [
            "http://dbpedia.org/resource/gold_medal_of_the_royal_astronomical_society",
            "[sep]",
            "http://dbpedia.org/property/prizes"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gold_Medal_of_the_Royal_Astronomical_Society"
        ],
        "goldrels": [
            "http://dbpedia.org/property/prizes"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2125,
        "question": [
            "http://dbpedia.org/resource/robert_nederlander",
            "http://dbpedia.org/resource/gary_s\u00e1nchez",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/knownfor",
            "http://dbpedia.org/ontology/debutteam",
            "http://dbpedia.org/ontology/sportsteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Robert_Nederlander",
            "http://dbpedia.org/resource/Gary_S\u00e1nchez",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/knownFor",
            "http://dbpedia.org/ontology/debutTeam",
            "http://dbpedia.org/ontology/SportsTeam"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <predpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 962,
        "question": [
            "http://dbpedia.org/resource/samuel_hayes_(settler)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/restingplace",
            "http://dbpedia.org/ontology/politician"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Samuel_Hayes_(settler)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/restingPlace",
            "http://dbpedia.org/ontology/Politician"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2095,
        "question": [
            "http://dbpedia.org/resource/filipinos",
            "[sep]",
            "http://dbpedia.org/ontology/stateoforigin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Filipinos"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/stateOfOrigin"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 2704,
        "question": [
            "http://dbpedia.org/resource/mark_latham",
            "http://dbpedia.org/resource/tim_mathieson",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/partner",
            "http://dbpedia.org/ontology/officeholder"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mark_Latham",
            "http://dbpedia.org/resource/Tim_Mathieson",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/partner",
            "http://dbpedia.org/ontology/OfficeHolder"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2105,
        "question": [
            "http://dbpedia.org/resource/louisiana",
            "[sep]",
            "http://dbpedia.org/property/placeofbirth",
            "http://dbpedia.org/property/knownfor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Louisiana"
        ],
        "goldrels": [
            "http://dbpedia.org/property/placeOfBirth",
            "http://dbpedia.org/property/knownFor"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 250,
        "question": [
            "http://dbpedia.org/resource/george_beauchamp",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/keypeople",
            "http://dbpedia.org/ontology/instrument",
            "http://dbpedia.org/ontology/musicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/George_Beauchamp",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/keyPeople",
            "http://dbpedia.org/ontology/instrument",
            "http://dbpedia.org/ontology/MusicalArtist"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 935,
        "question": [
            "http://dbpedia.org/resource/ernest_rutherford",
            "[sep]",
            "http://dbpedia.org/ontology/doctoraladvisor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ernest_Rutherford"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralAdvisor"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] [UNK] [UNK] . }",
        "exact_match": "match"
    }
]