[
    {
        "uid": 1008,
        "question": [
            "http://dbpedia.org/resource/quartermaster_corps_(united_states_army)",
            "[sep]",
            "http://dbpedia.org/ontology/militaryunit",
            "http://dbpedia.org/ontology/almamater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Quartermaster_Corps_(United_States_Army)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryUnit",
            "http://dbpedia.org/ontology/almaMater"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 2610,
        "question": [
            "http://dbpedia.org/resource/lawrence_realization_stakes",
            "[sep]",
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/honours"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Lawrence_Realization_Stakes"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/honours"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( ?vr1 . ?vr1 <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 839,
        "question": [
            "http://dbpedia.org/resource/the_times_they_are_a-changin'_(musical)",
            "http://dbpedia.org/resource/moondog_matinee",
            "[sep]",
            "http://dbpedia.org/ontology/musicby",
            "http://dbpedia.org/ontology/subsequentwork"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)",
            "http://dbpedia.org/resource/Moondog_Matinee"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/musicBy",
            "http://dbpedia.org/ontology/subsequentWork"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] . ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 319,
        "question": [
            "http://dbpedia.org/resource/wcw_mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/WCW_Mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 2549,
        "question": [
            "http://dbpedia.org/resource/jacques_van't_hart",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/breeder",
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/horse"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jacques_Van't_Hart",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/breeder",
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/Horse"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 1794,
        "question": [
            "http://dbpedia.org/resource/robert_morris_colonials_football",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/school",
            "http://dbpedia.org/property/highschool",
            "http://dbpedia.org/ontology/americanfootballplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Robert_Morris_Colonials_football",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/school",
            "http://dbpedia.org/property/highschool",
            "http://dbpedia.org/ontology/AmericanFootballPlayer"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2721,
        "question": [
            "http://dbpedia.org/resource/mauritius_broadcasting_corporation",
            "[sep]",
            "http://dbpedia.org/ontology/broadcastarea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mauritius_Broadcasting_Corporation"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/broadcastArea"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2292,
        "question": [
            "http://dbpedia.org/resource/henry_howard,_1st_earl_of_northampton",
            "[sep]",
            "http://dbpedia.org/ontology/employer",
            "http://dbpedia.org/ontology/opponent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Henry_Howard,_1st_Earl_of_Northampton"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/employer",
            "http://dbpedia.org/ontology/opponent"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( ?vr1 . ?vr1 <predpos@@2> ?vr0 ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 2768,
        "question": [
            "http://dbpedia.org/resource/galatasaray_handball_team",
            "[sep]",
            "http://dbpedia.org/ontology/mascot"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Galatasaray_Handball_Team"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mascot"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK]",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 (",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] [UNK] <predpos@@1> [UNK]",
        "exact_match": "match"
    },
    {
        "uid": 1514,
        "question": [
            "http://dbpedia.org/resource/anne_hidalgo",
            "[sep]",
            "http://dbpedia.org/ontology/mayor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Anne_Hidalgo"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mayor"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where ?vr0 ?vr0 <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 2462,
        "question": [
            "http://dbpedia.org/resource/herzogenaurach",
            "[sep]",
            "http://dbpedia.org/ontology/location"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Herzogenaurach"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/location"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 1233,
        "question": [
            "http://dbpedia.org/resource/german-occupied_europe",
            "[sep]",
            "http://dbpedia.org/property/jurisdiction",
            "http://dbpedia.org/ontology/leader"
        ],
        "goldents": [
            "http://dbpedia.org/resource/German-occupied_Europe"
        ],
        "goldrels": [
            "http://dbpedia.org/property/jurisdiction",
            "http://dbpedia.org/ontology/leader"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 2527,
        "question": [
            "http://dbpedia.org/resource/waxiang_people",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/ethnicgroup"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Waxiang_people",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/EthnicGroup"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . [UNK] <predpos@@2> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1370,
        "question": [
            "http://dbpedia.org/resource/uncle_henry_(oz)",
            "[sep]",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/relative"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Uncle_Henry_(Oz)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/relative"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( ?vr1 . ?vr1 <predpos@@2> ?vr0 ?vr1",
        "exact_match": "no match"
    },
    {
        "uid": 442,
        "question": [
            "http://dbpedia.org/resource/craig_robinson_(actor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/series",
            "http://dbpedia.org/ontology/fictionalcharacter"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Craig_Robinson_(actor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/series",
            "http://dbpedia.org/ontology/FictionalCharacter"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1167,
        "question": [
            "http://dbpedia.org/resource/thomas_pfyl",
            "[sep]",
            "http://dbpedia.org/ontology/stateoforigin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thomas_Pfyl"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/stateOfOrigin"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 (",
        "answer_2": "select distinct ?vr0 where { [UNK] [UNK] [UNK] ( .",
        "answer_3": "select distinct ?vr0 where { [UNK] [UNK] [UNK] [UNK] .",
        "exact_match": "match"
    },
    {
        "uid": 2819,
        "question": [
            "http://dbpedia.org/resource/massachusetts_department_of_transportation",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/operator",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/roadtunnel"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Massachusetts_Department_of_Transportation",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/operator",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/RoadTunnel"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( ?vr1 . ?vr1 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3179,
        "question": [
            "http://dbpedia.org/resource/cobham_training_centre",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/soccerclub"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Cobham_Training_Centre",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/SoccerClub"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr1 . <entpos@@2> <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 2771,
        "question": [
            "http://dbpedia.org/resource/good_hair",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/influencedby",
            "http://dbpedia.org/ontology/comedian"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Good_Hair",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/influencedBy",
            "http://dbpedia.org/ontology/Comedian"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( <entpos@@1> ( ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2096,
        "question": [
            "http://dbpedia.org/resource/cirque_du_soleil_discography",
            "[sep]",
            "http://dbpedia.org/property/artist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Cirque_du_Soleil_discography"
        ],
        "goldrels": [
            "http://dbpedia.org/property/artist"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2605,
        "question": [
            "http://dbpedia.org/resource/jamiatu_muslim_mindanao",
            "[sep]",
            "http://dbpedia.org/ontology/athletics"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/athletics"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 1732,
        "question": [
            "http://dbpedia.org/resource/american_indian_wars",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/usedinwar",
            "http://dbpedia.org/property/origin",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/American_Indian_Wars",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/usedInWar",
            "http://dbpedia.org/property/origin",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 762,
        "question": [
            "http://dbpedia.org/resource/willem-alexander_of_the_netherlands",
            "http://dbpedia.org/resource/fredis_refunjol",
            "[sep]",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands",
            "http://dbpedia.org/resource/Fredis_Refunjol"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> <entpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 1200,
        "question": [
            "http://dbpedia.org/resource/foxy_brown_(rapper)",
            "[sep]",
            "http://dbpedia.org/ontology/associatedband"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Foxy_Brown_(rapper)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedBand"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 2935,
        "question": [
            "http://dbpedia.org/resource/gerard_piqu\u00e9",
            "[sep]",
            "http://dbpedia.org/ontology/partner"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gerard_Piqu\u00e9"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/partner"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> <entpos@@1> }",
        "exact_match": "no match"
    },
    {
        "uid": 1930,
        "question": [
            "http://dbpedia.org/resource/bjelimi\u0107ka_rijeka",
            "[sep]",
            "http://dbpedia.org/ontology/righttributary",
            "http://dbpedia.org/ontology/mouthcountry"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/rightTributary",
            "http://dbpedia.org/ontology/mouthCountry"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 453,
        "question": [
            "http://dbpedia.org/resource/birmingham_airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/targetairport",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/airline"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Birmingham_Airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/targetAirport",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/Airline"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    }
]