[
    {
        "uid": 3197,
        "question": [
            "http://dbpedia.org/resource/katharevousa",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/movement",
            "http://dbpedia.org/ontology/award",
            "http://dbpedia.org/ontology/writer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Katharevousa",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/movement",
            "http://dbpedia.org/ontology/award",
            "http://dbpedia.org/ontology/Writer"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 1998,
        "question": [
            "http://dbpedia.org/resource/cfrx",
            "[sep]",
            "http://dbpedia.org/ontology/broadcastarea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/CFRX"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/broadcastArea"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK]",
        "exact_match": "match"
    },
    {
        "uid": 130,
        "question": [
            "http://dbpedia.org/resource/asiana_airlines",
            "http://dbpedia.org/resource/jeju_international_airport",
            "[sep]",
            "http://dbpedia.org/ontology/targetairport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Asiana_Airlines",
            "http://dbpedia.org/resource/Jeju_International_Airport"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/targetAirport"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1>",
        "answer_3": "ask where { where <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 313,
        "question": [
            "http://dbpedia.org/resource/early_in_the_morning_and_late_at_night",
            "http://dbpedia.org/resource/hank_williams_jr.",
            "[sep]",
            "http://dbpedia.org/ontology/musicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Early_in_the_Morning_and_Late_at_Night",
            "http://dbpedia.org/resource/Hank_Williams_Jr."
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/musicalArtist"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] } [UNK] }",
        "answer_3": "ask where { [UNK] [UNK] ( <entpos@@2> [UNK]",
        "exact_match": "match"
    },
    {
        "uid": 3212,
        "question": [
            "http://dbpedia.org/resource/michael_deeley",
            "http://dbpedia.org/resource/ridley_scott",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Michael_Deeley",
            "http://dbpedia.org/resource/Ridley_Scott",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 529,
        "question": [
            "http://dbpedia.org/resource/qf_6-pounder_hotchkiss",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/usedinwar",
            "http://dbpedia.org/ontology/territory",
            "http://dbpedia.org/ontology/militaryconflict"
        ],
        "goldents": [
            "http://dbpedia.org/resource/QF_6-pounder_Hotchkiss",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/usedInWar",
            "http://dbpedia.org/ontology/territory",
            "http://dbpedia.org/ontology/MilitaryConflict"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1938,
        "question": [
            "http://dbpedia.org/resource/vp-8",
            "http://dbpedia.org/resource/vp-10",
            "[sep]",
            "http://dbpedia.org/ontology/commandstructure",
            "http://dbpedia.org/ontology/commandstructure"
        ],
        "goldents": [
            "http://dbpedia.org/resource/VP-8",
            "http://dbpedia.org/resource/VP-10"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/commandStructure",
            "http://dbpedia.org/ontology/commandStructure"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 } <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 3067,
        "question": [
            "http://dbpedia.org/resource/playstation_2",
            "http://dbpedia.org/resource/asus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/manufacturer",
            "http://dbpedia.org/ontology/informationappliance"
        ],
        "goldents": [
            "http://dbpedia.org/resource/PlayStation_2",
            "http://dbpedia.org/resource/Asus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/manufacturer",
            "http://dbpedia.org/ontology/InformationAppliance"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2983,
        "question": [
            "http://dbpedia.org/resource/fox_broadcasting_company",
            "http://dbpedia.org/resource/brian_dunkleman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/channel",
            "http://dbpedia.org/ontology/presenter",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fox_Broadcasting_Company",
            "http://dbpedia.org/resource/Brian_Dunkleman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/channel",
            "http://dbpedia.org/ontology/presenter",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1774,
        "question": [
            "http://dbpedia.org/resource/nicomedia",
            "http://dbpedia.org/resource/aureus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/capital",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Nicomedia",
            "http://dbpedia.org/resource/Aureus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/capital",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/Country"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1963,
        "question": [
            "http://dbpedia.org/resource/green_river_(duwamish_river)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/source",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Green_River_(Duwamish_River)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/source",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2778,
        "question": [
            "http://dbpedia.org/resource/ernest_rutherford",
            "http://dbpedia.org/resource/manhattan_project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/doctoraladvisor",
            "http://dbpedia.org/ontology/knownfor",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ernest_Rutherford",
            "http://dbpedia.org/resource/Manhattan_Project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralAdvisor",
            "http://dbpedia.org/ontology/knownFor",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1491,
        "question": [
            "http://dbpedia.org/resource/brynn_carman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/figureskater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Brynn_Carman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/FigureSkater"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 162,
        "question": [
            "http://dbpedia.org/resource/ralph_j._gleason",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/magazine"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ralph_J._Gleason",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/Magazine"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> [UNK] }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2792,
        "question": [
            "http://dbpedia.org/resource/reading,_berkshire",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/school"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Reading,_Berkshire",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/School"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> } }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2442,
        "question": [
            "http://dbpedia.org/resource/the_mating_habits_of_the_earthbound_human",
            "http://dbpedia.org/resource/mams_taylor",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/associatedmusicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Mating_Habits_of_the_Earthbound_Human",
            "http://dbpedia.org/resource/Mams_Taylor"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/associatedMusicalArtist"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2713,
        "question": [
            "http://dbpedia.org/resource/brian_deegan_(rider)",
            "http://dbpedia.org/resource/harold_lloyd",
            "[sep]",
            "http://dbpedia.org/ontology/birthplace",
            "http://dbpedia.org/ontology/birthplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Brian_Deegan_(rider)",
            "http://dbpedia.org/resource/Harold_Lloyd"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/birthPlace",
            "http://dbpedia.org/ontology/birthPlace"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 1966,
        "question": [
            "http://dbpedia.org/resource/john_spencer_(scottish_footballer)",
            "[sep]",
            "http://dbpedia.org/property/manager",
            "http://dbpedia.org/ontology/homestadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/manager",
            "http://dbpedia.org/ontology/homeStadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 1210,
        "question": [
            "http://dbpedia.org/resource/field_marshal",
            "[sep]",
            "http://dbpedia.org/ontology/militaryrank",
            "http://dbpedia.org/ontology/religion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Field_marshal"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryRank",
            "http://dbpedia.org/ontology/religion"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <predpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 2760,
        "question": [
            "http://dbpedia.org/resource/wwe",
            "[sep]",
            "http://dbpedia.org/ontology/presenter",
            "http://dbpedia.org/ontology/spouse"
        ],
        "goldents": [
            "http://dbpedia.org/resource/WWE"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/presenter",
            "http://dbpedia.org/ontology/spouse"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 1483,
        "question": [
            "http://dbpedia.org/resource/andrea_poapst",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/figureskater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Andrea_Poapst",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/FigureSkater"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3092,
        "question": [
            "http://dbpedia.org/resource/java_gold",
            "[sep]",
            "http://dbpedia.org/ontology/trainer",
            "http://dbpedia.org/ontology/birthplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Java_Gold"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/trainer",
            "http://dbpedia.org/ontology/birthPlace"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 .",
        "exact_match": "match"
    },
    {
        "uid": 2875,
        "question": [
            "http://dbpedia.org/resource/atlanta",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Atlanta",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 227,
        "question": [
            "http://dbpedia.org/resource/gatwick_airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gatwick_Airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    }
]