[
    {
        "uid": 588,
        "question": [
            "http://dbpedia.org/resource/george_washington",
            "http://dbpedia.org/resource/general_(united_states)",
            "[sep]",
            "http://dbpedia.org/ontology/militaryrank"
        ],
        "goldents": [
            "http://dbpedia.org/resource/George_Washington",
            "http://dbpedia.org/resource/General_(United_States)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryRank"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] } [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 2408,
        "question": [
            "http://dbpedia.org/resource/ape",
            "http://dbpedia.org/resource/primate",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/order"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ape",
            "http://dbpedia.org/resource/Primate"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/order"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> .",
        "exact_match": "match"
    },
    {
        "uid": 2641,
        "question": [
            "http://dbpedia.org/resource/michigan_renaissance_festival",
            "http://dbpedia.org/resource/comcast_sportsnet_chicago",
            "[sep]",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/broadcastarea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Michigan_Renaissance_Festival",
            "http://dbpedia.org/resource/Comcast_SportsNet_Chicago"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/broadcastArea"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 419,
        "question": [
            "http://dbpedia.org/resource/writings_and_drawings",
            "http://dbpedia.org/resource/bob_dylan",
            "[sep]",
            "http://dbpedia.org/property/illustrator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Writings_and_Drawings",
            "http://dbpedia.org/resource/Bob_Dylan"
        ],
        "goldrels": [
            "http://dbpedia.org/property/illustrator"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1780,
        "question": [
            "http://dbpedia.org/resource/uss_marmora_(ix-189)",
            "http://dbpedia.org/resource/seattle",
            "[sep]",
            "http://dbpedia.org/property/shipbuilder"
        ],
        "goldents": [
            "http://dbpedia.org/resource/USS_Marmora_(IX-189)",
            "http://dbpedia.org/resource/Seattle"
        ],
        "goldrels": [
            "http://dbpedia.org/property/shipBuilder"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] (",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 1787,
        "question": [
            "http://dbpedia.org/resource/eddie_anderson_(safety)",
            "http://dbpedia.org/resource/joe_porter_(american_football)",
            "[sep]",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Eddie_Anderson_(safety)",
            "http://dbpedia.org/resource/Joe_Porter_(American_football)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2041,
        "question": [
            "http://dbpedia.org/resource/non-governmental_organization",
            "[sep]",
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/property/purpose"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Non-governmental_organization"
        ],
        "goldrels": [
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/property/purpose"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 481,
        "question": [
            "http://dbpedia.org/resource/thesaban",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/settlementtype",
            "http://dbpedia.org/ontology/town"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thesaban",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/settlementType",
            "http://dbpedia.org/ontology/Town"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <entpos@@2> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2750,
        "question": [
            "http://dbpedia.org/resource/swedish_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/language",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Swedish_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/language",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 3037,
        "question": [
            "http://dbpedia.org/resource/crystal_harris",
            "[sep]",
            "http://dbpedia.org/ontology/spouse"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Crystal_Harris"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . .",
        "exact_match": "match"
    },
    {
        "uid": 2947,
        "question": [
            "http://dbpedia.org/resource/ptolemy_xii_auletes",
            "http://dbpedia.org/resource/ptolemy_xiii_theos_philopator",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/parent",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/royalty"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ptolemy_XII_Auletes",
            "http://dbpedia.org/resource/Ptolemy_XIII_Theos_Philopator",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/parent",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/Royalty"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2188,
        "question": [
            "http://dbpedia.org/resource/john_mcewen",
            "http://dbpedia.org/resource/park_chung-hee",
            "[sep]",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_McEwen",
            "http://dbpedia.org/resource/Park_Chung-hee"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/commander"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 2758,
        "question": [
            "http://dbpedia.org/resource/isaac_hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/film",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Isaac_Hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Film",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <entpos@@2> . ?vr0 <entpos@@3>",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@3>",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> . ?vr0 <entpos@@3>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 1525,
        "question": [
            "http://dbpedia.org/resource/ronaldo",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/chairman",
            "http://dbpedia.org/ontology/ground",
            "http://dbpedia.org/ontology/soccerclubseason"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ronaldo",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/chairman",
            "http://dbpedia.org/ontology/ground",
            "http://dbpedia.org/ontology/SoccerClubSeason"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1970,
        "question": [
            "http://dbpedia.org/resource/6th_infantry_regiment_(united_states)",
            "http://dbpedia.org/resource/zachary_taylor",
            "[sep]",
            "http://dbpedia.org/ontology/notablecommander"
        ],
        "goldents": [
            "http://dbpedia.org/resource/6th_Infantry_Regiment_(United_States)",
            "http://dbpedia.org/resource/Zachary_Taylor"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/notableCommander"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] } [UNK] }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "exact_match": "no match"
    },
    {
        "uid": 153,
        "question": [
            "http://dbpedia.org/resource/lake_victoria",
            "[sep]",
            "http://dbpedia.org/ontology/nearestcity"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Lake_Victoria"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nearestCity"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( <entpos@@1> <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 889,
        "question": [
            "http://dbpedia.org/resource/siberia",
            "[sep]",
            "http://dbpedia.org/ontology/border"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Siberia"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/border"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 249,
        "question": [
            "http://dbpedia.org/resource/raptors_905",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/arena",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Raptors_905",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/arena",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1364,
        "question": [
            "http://dbpedia.org/resource/the_band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/artist",
            "http://dbpedia.org/ontology/subsequentwork",
            "http://dbpedia.org/ontology/album"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/artist",
            "http://dbpedia.org/ontology/subsequentWork",
            "http://dbpedia.org/ontology/Album"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2358,
        "question": [
            "http://dbpedia.org/resource/middlesbrough_f.c.",
            "[sep]",
            "http://dbpedia.org/ontology/managerclub"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Middlesbrough_F.C."
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/managerClub"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1> <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2628,
        "question": [
            "http://dbpedia.org/resource/geneva",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Geneva"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/company"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 619,
        "question": [
            "http://dbpedia.org/resource/honeybuns",
            "http://dbpedia.org/resource/wahoo!",
            "[sep]",
            "http://dbpedia.org/ontology/previouswork"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Honeybuns",
            "http://dbpedia.org/resource/Wahoo!"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/previousWork"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( ( <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { [UNK] ( ( <entpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 864,
        "question": [
            "http://dbpedia.org/resource/hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/currentmembers",
            "http://dbpedia.org/ontology/bandmember",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/currentMembers",
            "http://dbpedia.org/ontology/bandMember",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0",
        "exact_match": "no match"
    },
    {
        "uid": 395,
        "question": [
            "http://dbpedia.org/resource/manhattan_project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/knownfor",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Manhattan_Project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/knownFor",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1016,
        "question": [
            "http://dbpedia.org/resource/kingdom_of_naples",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Kingdom_of_Naples",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/occupation",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1054,
        "question": [
            "http://dbpedia.org/resource/firmicutes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/division",
            "http://dbpedia.org/ontology/bacteria"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Firmicutes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/division",
            "http://dbpedia.org/ontology/Bacteria"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 ?vr0 <predpos@@2> <predpos@@2>",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "exact_match": "match"
    },
    {
        "uid": 1706,
        "question": [
            "http://dbpedia.org/resource/birmingham",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/origin",
            "http://dbpedia.org/ontology/band"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Birmingham",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/origin",
            "http://dbpedia.org/ontology/Band"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { { <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 <entpos@@2> <predpos@@2> <predpos@@2>",
        "exact_match": "match"
    }
]