[
    {
        "uid": 2204,
        "question": [
            "http://dbpedia.org/resource/2015_fort_lauderdale_strikers_season",
            "http://dbpedia.org/resource/fort_lauderdale_strikers",
            "[sep]",
            "http://dbpedia.org/ontology/chairman",
            "http://dbpedia.org/ontology/chairman"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season",
            "http://dbpedia.org/resource/Fort_Lauderdale_Strikers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/chairman",
            "http://dbpedia.org/ontology/chairman"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . <predpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2177,
        "question": [
            "http://dbpedia.org/resource/mastercard_centre",
            "[sep]",
            "http://dbpedia.org/property/tenants"
        ],
        "goldents": [
            "http://dbpedia.org/resource/MasterCard_Centre"
        ],
        "goldrels": [
            "http://dbpedia.org/property/tenants"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct ?vr0 where ?vr0 ?vr0 <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 1065,
        "question": [
            "http://dbpedia.org/resource/racism",
            "[sep]",
            "http://dbpedia.org/ontology/nonfictionsubject",
            "http://dbpedia.org/ontology/nonfictionsubject"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Racism"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nonFictionSubject",
            "http://dbpedia.org/ontology/nonFictionSubject"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 2288,
        "question": [
            "http://dbpedia.org/resource/mid_wales",
            "[sep]",
            "http://dbpedia.org/ontology/regionserved",
            "http://dbpedia.org/ontology/foundedby"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mid_Wales"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/regionServed",
            "http://dbpedia.org/ontology/foundedBy"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "no match"
    },
    {
        "uid": 135,
        "question": [
            "http://dbpedia.org/resource/simon_fuller",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/creator",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Simon_Fuller",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/creator",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . ?vr0 ?vr0 <predpos@@2> <predpos@@2>",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_3": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1734,
        "question": [
            "http://dbpedia.org/resource/jenny_macklin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/deputy",
            "http://dbpedia.org/property/predecessor",
            "http://dbpedia.org/ontology/officeholder"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jenny_Macklin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/deputy",
            "http://dbpedia.org/property/predecessor",
            "http://dbpedia.org/ontology/OfficeHolder"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1452,
        "question": [
            "http://dbpedia.org/resource/new_york",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/property/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/New_York",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/property/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1453,
        "question": [
            "http://dbpedia.org/resource/europe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/sea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Europe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/Sea"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count where ?vr0 ) where { <entpos@@1> <entpos@@1> ?vr0 . <predpos@@2>",
        "answer_2": "select distinct count where ?vr0 ) where { <entpos@@1> <entpos@@1> ?vr0 . <predpos@@2> <entpos@@2>",
        "answer_3": "select distinct count where ?vr0 ) where { <entpos@@1> <entpos@@1> ?vr0 . <predpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2154,
        "question": [
            "http://dbpedia.org/resource/c++",
            "http://dbpedia.org/resource/microsoft_windows",
            "[sep]",
            "http://dbpedia.org/ontology/programminglanguage",
            "http://dbpedia.org/ontology/operatingsystem"
        ],
        "goldents": [
            "http://dbpedia.org/resource/C++",
            "http://dbpedia.org/resource/Microsoft_Windows"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/programmingLanguage",
            "http://dbpedia.org/ontology/operatingSystem"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> <predpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1676,
        "question": [
            "http://dbpedia.org/resource/gangan_comics",
            "[sep]",
            "http://dbpedia.org/property/magazine",
            "http://dbpedia.org/property/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gangan_Comics"
        ],
        "goldrels": [
            "http://dbpedia.org/property/magazine",
            "http://dbpedia.org/property/author"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <predpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . <predpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 .",
        "exact_match": "match"
    },
    {
        "uid": 1610,
        "question": [
            "http://dbpedia.org/resource/drum_kit",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/instruments",
            "http://dbpedia.org/ontology/stylisticorigin",
            "http://dbpedia.org/ontology/musicgenre"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Drum_kit",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/instruments",
            "http://dbpedia.org/ontology/stylisticOrigin",
            "http://dbpedia.org/ontology/MusicGenre"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 125,
        "question": [
            "http://dbpedia.org/resource/pixar_image_computer",
            "http://dbpedia.org/resource/edwin_catmull",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/product",
            "http://dbpedia.org/ontology/keyperson",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Pixar_Image_Computer",
            "http://dbpedia.org/resource/Edwin_Catmull",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/product",
            "http://dbpedia.org/ontology/keyPerson",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 545,
        "question": [
            "http://dbpedia.org/resource/alberta_highway_42",
            "http://dbpedia.org/resource/lousana",
            "[sep]",
            "http://dbpedia.org/ontology/routeend"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Alberta_Highway_42",
            "http://dbpedia.org/resource/Lousana"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/routeEnd"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  .  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> } <predpos@@1>",
        "answer_3": "ask where { where <predpos@@1> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 174,
        "question": [
            "http://dbpedia.org/resource/fort_barrancas",
            "http://dbpedia.org/resource/fort_gadsden",
            "[sep]",
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/battle"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fort_Barrancas",
            "http://dbpedia.org/resource/Fort_Gadsden"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/battle"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] <predpos@@1> [UNK] . [UNK] <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 168,
        "question": [
            "http://dbpedia.org/resource/joe_purcell",
            "http://dbpedia.org/resource/winston_bryant",
            "[sep]",
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Joe_Purcell",
            "http://dbpedia.org/resource/Winston_Bryant"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> .",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2677,
        "question": [
            "http://dbpedia.org/resource/feminism_in_canada",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/maininterest",
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/philosopher"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Feminism_in_Canada",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mainInterest",
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/Philosopher"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 2537,
        "question": [
            "http://dbpedia.org/resource/broadcast_syndication",
            "http://dbpedia.org/resource/comedy_central",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Broadcast_syndication",
            "http://dbpedia.org/resource/Comedy_Central",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2082,
        "question": [
            "http://dbpedia.org/resource/waylon_jennings",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/associatedmusicalartist",
            "http://dbpedia.org/ontology/musicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Waylon_Jennings",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedMusicalArtist",
            "http://dbpedia.org/ontology/MusicalArtist"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2046,
        "question": [
            "http://dbpedia.org/resource/ricky_gervais",
            "[sep]",
            "http://dbpedia.org/ontology/executiveproducer",
            "http://dbpedia.org/ontology/series"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ricky_Gervais"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/executiveProducer",
            "http://dbpedia.org/ontology/series"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . }",
        "exact_match": "no match"
    },
    {
        "uid": 288,
        "question": [
            "http://dbpedia.org/resource/queer_as_folk_(uk_tv_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/property/notableworks",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Queer_as_Folk_(UK_TV_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/property/notableworks",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <predpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } } }",
        "exact_match": "no match"
    },
    {
        "uid": 65,
        "question": [
            "http://dbpedia.org/resource/aureus",
            "http://dbpedia.org/resource/solidus_(coin)",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Aureus",
            "http://dbpedia.org/resource/Solidus_(coin)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 2189,
        "question": [
            "http://dbpedia.org/resource/troodos_mountains",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/wineregion",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/grape"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Troodos_Mountains",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/wineRegion",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/Grape"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { { <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2248,
        "question": [
            "http://dbpedia.org/resource/garry_unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/sportsteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Garry_Unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/SportsTeam"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1202,
        "question": [
            "http://dbpedia.org/resource/thud!",
            "[sep]",
            "http://dbpedia.org/ontology/nonfictionsubject"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thud!"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nonFictionSubject"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . .",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 1021,
        "question": [
            "http://dbpedia.org/resource/fox_broadcasting_company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/channel",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fox_Broadcasting_Company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/channel",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 where <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    }
]