 
"
@@ent@@
@@pred@@
(
rdfs:label
by
ask
>
select
que
?sbj_label
limit
jai
mai
?sbj
)
lang
year
}
?value
peint
?value2
desc
where
ce
distinct
filter
lcase
order
la
<
asc
en
?ans_1
contains
as
,
?x
strstarts
?answer
?value1
{
'
?sub
j
?obj
?ent
count
=
?s
?ans_2
.
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
wdt:p7111
wdt:p6632
wdt:p8992
wdt:p5716
wdt:p6953
wdt:p7397
wdt:p3314
wdt:p4896
wdt:p2796
wdt:p8243
wdt:p7890
wdt:p3605
wdt:p7453
wdt:p5464
wdt:p9046
wdt:p8828
wdt:p8867
wdt:p8868
wdt:p8869
wdt:p7456
wdt:p8783
wdt:p8784
wdt:p6850
wdt:p4526
wdt:p7093
wdt:p5756
wdt:p1251
wdt:p1806
wdt:p6635
wdt:p6297
wdt:p3525
wdt:p4894
wdt:p8692
wdt:p7505
wdt:p2179
wdt:p864
wdt:p3332
wdt:p3333
wdt:p7983
wdt:p7979
wdt:p7716
wdt:p2472
wdt:p7003
wdt:p6981
wdt:p8201
wdt:p3901
wdt:p4114
wdt:p7404
wdt:p819
wdt:p4024
wdt:p5463
wdt:p3436
wdt:p6038
wdt:p7089
wdt:p3593
wdt:p4885
wdt:p3547
wdt:p4888
wdt:p8277
wdt:p2345
wdt:p2342
wdt:p2344
wdt:p8061
wdt:p8491
wdt:p7049
wdt:p6513
wdt:p4897
wdt:p4957
wdt:p4929
wdt:p6392
wdt:p8809
wdt:p4432
wdt:p8991
wdt:p6158
wdt:p3126
wdt:p3953
wdt:p7118
wdt:p7119
wdt:p6151
wdt:p7019
wdt:p5635
wdt:p8458
wdt:p8490
wdt:p8457
wdt:p5922
wdt:p8529
wdt:p6137
wdt:p4325
wdt:p6269
wdt:p5984
wdt:p6235
wdt:p3642
wdt:p6067
wdt:p999
wdt:p8054
wdt:p2833
wdt:p2980
wdt:p4549
wdt:p6226
wdt:p5329
wdt:p5090
wdt:p3653
wdt:p6295
wdt:p4610
wdt:p6294
wdt:p5242
wdt:p3427
wdt:p5198
wdt:p8488
wdt:p5904
wdt:p8456
wdt:p2792
wdt:p4842
wdt:p1371
wdt:p5362
wdt:p8219
wdt:p267
wdt:p1668
wdt:p536
wdt:p3456
wdt:p6880
wdt:p6904
wdt:p1115
wdt:p4162
wdt:p4618
wdt:p2759
wdt:p1252
wdt:p9020
wdt:p9032
wdt:p8718
wdt:p6637
wdt:p8721
wdt:p3531
wdt:p7194
wdt:p7533
wdt:p2540
wdt:p4962
wdt:p8260
wdt:p7694
wdt:p7580
wdt:p8279
wdt:p8844
wdt:p5527
wdt:p4052
wdt:p5715
wdt:p7896
wdt:p5801
wdt:p2080
wdt:p2381
wdt:p6145
wdt:p6150
wdt:p6171
wdt:p5839
wdt:p5661
wdt:p5662
wdt:p6575
wdt:p5663
wdt:p4716
wdt:p5363
wdt:p5374
wdt:p5645
wdt:p4717
wdt:p4585
wdt:p8153
wdt:p7230
wdt:p7143
wdt:p7109
wdt:p7138
wdt:p7166
wdt:p3273
wdt:p5859
wdt:p7931
wdt:p3562
wdt:p7777
wdt:p3351
wdt:p5083
wdt:p7005
wdt:p7940
wdt:p8012
wdt:p6183
wdt:p2036
wdt:p4513
wdt:p4514
wdt:p6093
wdt:p1744
wdt:p6334
wdt:p6008
wdt:p7559
wdt:p6561
wdt:p799
wdt:p5378
wdt:p5293
wdt:p7301
wdt:p4362
wdt:p4522
wdt:p759
wdt:p4396
wdt:p7067
wdt:p7050
wdt:p1661
wdt:p6683
wdt:p5350
wdt:p6432
wdt:p7513
wdt:p1348
wdt:p5121
wdt:p3645
wdt:p8895
wdt:p3765
wdt:p4252
wdt:p2019
wdt:p1562
wdt:p1729
wdt:p1728
wdt:p1994
wdt:p6306
wdt:p6110
wdt:p1730
wdt:p6097
wdt:p7127
wdt:p3167
wdt:p2465
wdt:p7214
wdt:p4191
wdt:p4910
wdt:p1265
wdt:p1266
wdt:p1267
wdt:p8414
wdt:p9045
wdt:p5807
wdt:p5809
wdt:p5808
wdt:p5530
wdt:p6276
wdt:p8055
wdt:p5749
wdt:p4862
wdt:p6878
wdt:p3502
wdt:p8062
wdt:p4172
wdt:p4170
wdt:p4692
wdt:p8624
wdt:p8623
wdt:p5340
wdt:p8540
wdt:p8723
wdt:p3651
wdt:p4823
wdt:p5633
wdt:p5036
wdt:p5354
wdt:p5003
wdt:p8922
wdt:p6434
wdt:p4803
wdt:p8199
wdt:p8586
wdt:p7869
wdt:p7870
wdt:p9000
wdt:p7413
wdt:p7977
wdt:p3276
wdt:p5731
wdt:p5646
wdt:p5648
wdt:p8888
wdt:p5649
wdt:p8785
wdt:p8729
wdt:p8731
wdt:p7905
wdt:p5031
wdt:p1934
wdt:p5770
wdt:p7017
wdt:p7013
wdt:p1985
wdt:p1983
wdt:p1984
wdt:p1982
wdt:p5845
wdt:p5847
wdt:p5860
wdt:p5849
wdt:p5846
wdt:p5848
wdt:p3790
wdt:p5952
wdt:p4911
wdt:p5299
wdt:p6812
wdt:p6484
wdt:p4393
wdt:p8435
wdt:p5614
wdt:p7311
wdt:p7312
wdt:p8057
wdt:p3861
wdt:p8940
wdt:p5260
wdt:p6395
wdt:p7799
wdt:p2281
wdt:p5842
wdt:p6771
wdt:p6787
wdt:p7020
wdt:p7021
wdt:p3594
wdt:p3426
wdt:p3454
wdt:p6734
wdt:p8218
wdt:p7945
wdt:p3058
wdt:p3059
wdt:p8091
wdt:p8419
wdt:p8496
wdt:p7128
wdt:p7764
wdt:p8902
wdt:p6371
wdt:p8732
wdt:p8290
wdt:p9033
wdt:p7323
wdt:p4454
wdt:p4065
wdt:p4453
wdt:p5225
wdt:p4693
wdt:p6120
wdt:p4587
wdt:p5821
wdt:p8232
wdt:p8899
wdt:p5887
wdt:p5888
wdt:p8213
wdt:p5218
wdt:p5212
wdt:p5213
wdt:p7841
wdt:p5776
wdt:p7292
wdt:p7656
wdt:p4694
wdt:p1014
wdt:p8564
wdt:p6576
wdt:p6804
wdt:p6805
wdt:p4563
wdt:p4564
wdt:p3791
wdt:p1367
wdt:p1679
wdt:p1751
wdt:p1602
wdt:p6903
wdt:p6629
wdt:p5597
wdt:p8943
wdt:p8705
wdt:p5239
wdt:p3782
wdt:p8434
wdt:p7627
wdt:p2042
wdt:p2411
wdt:p6610
wdt:p1291
wdt:p8880
wdt:p1564
wdt:p4858
wdt:p4857
wdt:p4859
wdt:p4144
wdt:p4146
wdt:p4145
wdt:p5078
wdt:p1212
wdt:p7772
wdt:p6159
wdt:p4102
wdt:p7051
wdt:p7004
wdt:p4590
wdt:p3372
wdt:p8907
wdt:p7298
wdt:p8233
wdt:p8291
wdt:p8292
wdt:p8293
wdt:p8294
wdt:p5799
wdt:p8295
wdt:p2809
wdt:p3626
wdt:p3915
wdt:p4476
wdt:p3548
wdt:p3156
wdt:p8326
wdt:p3549
wdt:p1907
wdt:p7033
wdt:p6039
wdt:p6982
wdt:p2742
wdt:p3534
wdt:p3008
wdt:p7090
wdt:p7768
wdt:p7769
wdt:p2457
wdt:p3682
wdt:p5465
wdt:p2516
wdt:p3550
wdt:p3551
wdt:p3552
wdt:p4094
wdt:p4014
wdt:p4093
wdt:p2367
wdt:p7022
wdt:p6713
wdt:p8469
wdt:p2584
wdt:p4186
wdt:p6820
wdt:p4766
wdt:p3546
wdt:p6194
wdt:p7491
wdt:p2280
wdt:p3991
wdt:p964
wdt:p5538
wdt:p7834
wdt:p5039
wdt:p5517
wdt:p3218
wdt:p1760
wdt:p1755
wdt:p2026
wdt:p7184
wdt:p6123
wdt:p5208
wdt:p5207
wdt:p981
wdt:p3293
wdt:p1901
wdt:p2689
wdt:p3280
wdt:p1823
wdt:p1573
wdt:p2173
wdt:p6200
wdt:p1617
wdt:p827
wdt:p8883
wdt:p1650
wdt:p2629
wdt:p8794
wdt:p8391
wdt:p2099
wdt:p4392
wdt:p1253
wdt:p5491
wdt:p8619
wdt:p3964
wdt:p6231
wdt:p6188
wdt:p3655
wdt:p7488
wdt:p4956
wdt:p2477
wdt:p8071
wdt:p7225
wdt:p4326
wdt:p4438
wdt:p2703
wdt:p4939
wdt:p8894
wdt:p3990
wdt:p9034
wdt:p5818
wdt:p732
wdt:p6656
wdt:p9037
wdt:p8547
wdt:p8541
wdt:p687
wdt:p4327
wdt:p4081
wdt:p8724
wdt:p6535
wdt:p1015
wdt:p6211
wdt:p7006
wdt:p6490
wdt:p5375
wdt:p2081
wdt:p4860
wdt:p865
wdt:p5219
wdt:p1143
wdt:p5361
wdt:p508
wdt:p5691
wdt:p2768
wdt:p3788
wdt:p7058
wdt:p4256
wdt:p3606
wdt:p4569
wdt:p2590
wdt:p5226
wdt:p5302
wdt:p4650
wdt:p6252
wdt:p8476
wdt:p8477
wdt:p4798
wdt:p4567
wdt:p6907
wdt:p2799
wdt:p4098
wdt:p3976
wdt:p6969
wdt:p4802
wdt:p6492
wdt:p2961
wdt:p2729
wdt:p3620
wdt:p4811
wdt:p6963
wdt:p8272
wdt:p2581
wdt:p3630
wdt:p3631
wdt:p2946
wdt:p6659
wdt:p6197
wdt:p3623
wdt:p6196
wdt:p6367
wdt:p5647
wdt:p3997
wdt:p3996
wdt:p2390
wdt:p6956
wdt:p5725
wdt:p2580
wdt:p3283
wdt:p7195
wdt:p4831
wdt:p3821
wdt:p6895
wdt:p4530
wdt:p4255
wdt:p2100
wdt:p6168
wdt:p4493
wdt:p4494
wdt:p8601
wdt:p4906
wdt:p4709
wdt:p9031
wdt:p4764
wdt:p3960
wdt:p8760
wdt:p5498
wdt:p4409
wdt:p1825
wdt:p1826
wdt:p4210
wdt:p4211
wdt:p3419
wdt:p7447
wdt:p7446
wdt:p7448
wdt:p7445
wdt:p5748
wdt:p3061
wdt:p5724
wdt:p2685
wdt:p4561
wdt:p4744
wdt:p4718
wdt:p4796
wdt:p4720
wdt:p4790
wdt:p4795
wdt:p7832
wdt:p4266
wdt:p4244
wdt:p6230
wdt:p4005
wdt:p5611
wdt:p8200
wdt:p7797
wdt:p7798
wdt:p7796
wdt:p2800
wdt:p7396
wdt:p6253
wdt:p6894
wdt:p7371
wdt:p4178
wdt:p6905
wdt:p4632
wdt:p2904
wdt:p5387
wdt:p5107
wdt:p5384
wdt:p5382
wdt:p5007
wdt:p7318
wdt:p4965
wdt:p2683
wdt:p5528
wdt:p3298
wdt:p7202
wdt:p3421
wdt:p5823
wdt:p7507
wdt:p8448
wdt:p2843
wdt:p4254
wdt:p1948
wdt:p2424
wdt:p6280
wdt:p4580
wdt:p7846
wdt:p9021
wdt:p2188
wdt:p2187
wdt:p2189
wdt:p8238
wdt:p5695
wdt:p8944
wdt:p1966
wdt:p950
wdt:p4440
wdt:p6496
wdt:p7613
wdt:p8160
wdt:p7987
wdt:p7924
wdt:p5613
wdt:p268
wdt:p808
wdt:p4933
wdt:p2092
wdt:p6453
wdt:p6454
wdt:p6455
wdt:p6456
wdt:p4208
wdt:p4352
wdt:p7928
wdt:p838
wdt:p6143
wdt:p3951
wdt:p5315
wdt:p4090
wdt:p7549
wdt:p651
wdt:p7941
wdt:p3595
wdt:p9048
wdt:p8098
wdt:p4991
wdt:p6851
wdt:p2736
wdt:p8686
wdt:p6234
wdt:p6059
wdt:p5450
wdt:p6944
wdt:p8792
wdt:p6040
wdt:p6070
wdt:p5257
wdt:p7536
wdt:p6173
wdt:p6175
wdt:p8354
wdt:p3507
wdt:p3813
wdt:p7023
wdt:p5636
wdt:p6723
wdt:p8772
wdt:p3377
wdt:p3052
wdt:p1162
wdt:p7428
wdt:p3942
wdt:p3814
wdt:p6491
wdt:p2339
wdt:p3505
wdt:p8675
wdt:p6160
wdt:p7766
wdt:p3888
wdt:p5499
wdt:p8674
wdt:p7923
wdt:p3910
wdt:p8632
wdt:p2607
wdt:p8063
wdt:p7823
wdt:p3607
wdt:p8230
wdt:p8211
wdt:p3611
wdt:p1237
wdt:p2530
wdt:p2688
wdt:p2531
wdt:p1967
wdt:p5891
wdt:p1743
wdt:p4395
wdt:p6004
wdt:p5629
wdt:p6555
wdt:p4060
wdt:p7480
wdt:p1585
wdt:p5501
wdt:p6485
wdt:p1380
wdt:p3965
wdt:p6564
wdt:p4470
wdt:p2945
wdt:p2399
wdt:p5364
wdt:p6167
wdt:p3628
wdt:p5199
wdt:p6077
wdt:p8565
wdt:p1711
wdt:p3633
wdt:p3632
wdt:p4490
wdt:p8856
wdt:p8638
wdt:p7576
wdt:p7467
wdt:p5019
wdt:p4899
wdt:p4740
wdt:p4328
wdt:p6772
wdt:p4667
wdt:p2464
wdt:p5144
wdt:p5145
wdt:p4845
wdt:p5388
wdt:p7429
wdt:p7131
wdt:p3796
wdt:p7288
wdt:p6518
wdt:p3060
wdt:p8558
wdt:p3398
wdt:p5333
wdt:p4725
wdt:p2190
wdt:p6035
wdt:p7852
wdt:p7524
wdt:p8072
wdt:p6475
wdt:p5574
wdt:p270
wdt:p7685
wdt:p1273
wdt:p231
wdt:p4838
wdt:p497
wdt:p6452
wdt:p382
wdt:p7568
wdt:p1890
wdt:p6493
wdt:p6852
wdt:p8719
wdt:p8215
wdt:p2072
wdt:p2086
wdt:p6636
wdt:p2474
wdt:p5272
wdt:p7801
wdt:p476
wdt:p6692
wdt:p1871
wdt:p853
wdt:p2340
wdt:p3968
wdt:p3725
wdt:p821
wdt:p7145
wdt:p4711
wdt:p6657
wdt:p5547
wdt:p6910
wdt:p8908
wdt:p8969
wdt:p8886
wdt:p4696
wdt:p8065
wdt:p7565
wdt:p7603
wdt:p2040
wdt:p8977
wdt:p5180
wdt:p3329
wdt:p6769
wdt:p5475
wdt:p1615
wdt:p5948
wdt:p6033
wdt:p1209
wdt:p5403
wdt:p3458
wdt:p2758
wdt:p3402
wdt:p5637
wdt:p1022
wdt:p6204
wdt:p4194
wdt:p5552
wdt:p4550
wdt:p5615
wdt:p6690
wdt:p4488
wdt:p2917
wdt:p4165
wdt:p1159
wdt:p4902
wdt:p5525
wdt:p8161
wdt:p3900
wdt:p8848
wdt:p8849
wdt:p8850
wdt:p1280
wdt:p8851
wdt:p6408
wdt:p3400
wdt:p6409
wdt:p247
wdt:p8113
wdt:p7037
wdt:p8150
wdt:p8124
wdt:p5779
wdt:p4847
wdt:p5780
wdt:p7824
wdt:p2000
wdt:p4660
wdt:p5968
wdt:p880
wdt:p7289
wdt:p8984
wdt:p2709
wdt:p1541
wdt:p2648
wdt:p2649
wdt:p2708
wdt:p8925
wdt:p5565
wdt:p8857
wdt:p2651
wdt:p2287
wdt:p5563
wdt:p6613
wdt:p8112
wdt:p8709
wdt:p1305
wdt:p2762
wdt:p8251
wdt:p2383
wdt:p8553
wdt:p1961
wdt:p7112
wdt:p6929
wdt:p1059
wdt:p7972
wdt:p5747
wdt:p3624
wdt:p1920
wdt:p1908
wdt:p1459
wdt:p3007
wdt:p2939
wdt:p2728
wdt:p3042
wdt:p4369
wdt:p4700
wdt:p6176
wdt:p9038
wdt:p3420
wdt:p6012
wdt:p4507
wdt:p1599
wdt:p7889
wdt:p6908
wdt:p4487
wdt:p6842
wdt:p7909
wdt:p6749
wdt:p8860
wdt:p4555
wdt:p4398
wdt:p7459
wdt:p4462
wdt:p3920
wdt:p5395
wdt:p3412
wdt:p8321
wdt:p4054
wdt:p477
wdt:p4463
wdt:p8631
wdt:p1670
wdt:p8179
wdt:p5631
wdt:p4699
wdt:p5243
wdt:p6017
wdt:p5519
wdt:p718
wdt:p7906
wdt:p7922
wdt:p7907
wdt:p8589
wdt:p2643
wdt:p4104
wdt:p5227
wdt:p5229
wdt:p4686
wdt:p5652
wdt:p5665
wdt:p6090
wdt:p9005
wdt:p2498
wdt:p1586
wdt:p3702
wdt:p3088
wdt:p2016
wdt:p2862
wdt:p2005
wdt:p3409
wdt:p2940
wdt:p3241
wdt:p1866
wdt:p1047
wdt:p3501
wdt:p6725
wdt:p6539
wdt:p3256
wdt:p3880
wdt:p5411
wdt:p2158
wdt:p7963
wdt:p3289
wdt:p3998
wdt:p6003
wdt:p5531
wdt:p6323
wdt:p683
wdt:p592
wdt:p3935
wdt:p8955
wdt:p5863
wdt:p3057
wdt:p4861
wdt:p6909
wdt:p661
wdt:p8508
wdt:p2382
wdt:p5602
wdt:p1666
wdt:p3654
wdt:p1665
wdt:p7958
wdt:p5018
wdt:p7365
wdt:p8609
wdt:p1631
wdt:p442
wdt:p1378
wdt:p8064
wdt:p7237
wdt:p1189
wdt:p4068
wdt:p8970
wdt:p5142
wdt:p7515
wdt:p4531
wdt:p4200
wdt:p3783
wdt:p8559
wdt:p5231
wdt:p4898
wdt:p7621
wdt:p8930
wdt:p8818
wdt:p5294
wdt:p5048
wdt:p779
wdt:p778
wdt:p8449
wdt:p3128
wdt:p3146
wdt:p2409
wdt:p4787
wdt:p271
wdt:p1739
wdt:p8337
wdt:p8639
wdt:p6750
wdt:p4665
wdt:p4666
wdt:p7593
wdt:p7594
wdt:p8296
wdt:p5146
wdt:p4129
wdt:p3445
wdt:p3933
wdt:p7483
wdt:p3851
wdt:p3857
wdt:p3077
wdt:p7586
wdt:p7177
wdt:p7178
wdt:p5791
wdt:p6083
wdt:p6633
wdt:p3203
wdt:p3204
wdt:p8971
wdt:p4276
wdt:p7679
wdt:p3455
wdt:p8441
wdt:p3784
wdt:p5235
wdt:p7893
wdt:p8958
wdt:p8782
wdt:p3216
wdt:p2357
wdt:p5390
wdt:p7908
wdt:p7988
wdt:p7980
wdt:p7133
wdt:p3410
wdt:p1929
wdt:p3098
wdt:p3963
wdt:p8126
wdt:p6024
wdt:p8229
wdt:p7865
wdt:p7647
wdt:p6052
wdt:p6853
wdt:p3119
wdt:p5020
wdt:p6436
wdt:p944
wdt:p4658
wdt:p5777
wdt:p4455
wdt:p8003
wdt:p8066
wdt:p7994
wdt:p8936
wdt:p4539
wdt:p3560
wdt:p3044
wdt:p5546
wdt:p5443
wdt:p3879
wdt:p8248
wdt:p7044
wdt:p7680
wdt:p4642
wdt:p2027
wdt:p2461
wdt:p1735
wdt:p5951
wdt:p5905
wdt:p1392
wdt:p7132
wdt:p4762
wdt:p5417
wdt:p7091
wdt:p3587
wdt:p1472
wdt:p1612
wdt:p373
wdt:p4765
wdt:p935
wdt:p6731
wdt:p4548
wdt:p4804
wdt:p2622
wdt:p5297
wdt:p8014
wdt:p6292
wdt:p7718
wdt:p8688
wdt:p7733
wdt:p5616
wdt:p8896
wdt:p6357
wdt:p5457
wdt:p4698
wdt:p9028
wdt:p3009
wdt:p3390
wdt:p5351
wdt:p6586
wdt:p2011
wdt:p5778
wdt:p5251
wdt:p6053
wdt:p3225
wdt:p6859
wdt:p7935
wdt:p6165
wdt:p3073
wdt:p4821
wdt:p6577
wdt:p5554
wdt:p5551
wdt:p5783
wdt:p4351
wdt:p6521
wdt:p6359
wdt:p2698
wdt:p3586
wdt:p6318
wdt:p8374
wdt:p6325
wdt:p6730
wdt:p3577
wdt:p3657
wdt:p4541
wdt:p3656
wdt:p3153
wdt:p8375
wdt:p2088
wdt:p2087
wdt:p4110
wdt:p3830
wdt:p4924
wdt:p4026
wdt:p8073
wdt:p1949
wdt:p3170
wdt:p3227
wdt:p1669
wdt:p2951
wdt:p3569
wdt:p998
wdt:p3556
wdt:p8085
wdt:p4508
wdt:p1409
wdt:p2330
wdt:p2331
wdt:p1664
wdt:p4226
wdt:p7451
wdt:p5258
wdt:p8932
wdt:p4472
wdt:p4075
wdt:p5263
wdt:p3184
wdt:p4062
wdt:p4156
wdt:p7949
wdt:p7526
wdt:p7577
wdt:p7735
wdt:p762
wdt:p7673
wdt:p7606
wdt:p2788
wdt:p6828
wdt:p7674
wdt:p4533
wdt:p7736
wdt:p5318
wdt:p5319
wdt:p5232
wdt:p7802
wdt:p2771
wdt:p1707
wdt:p4663
wdt:p7732
wdt:p4457
wdt:p6470
wdt:p4384
wdt:p7325
wdt:p7910
wdt:p7969
wdt:p8184
wdt:p8486
wdt:p5757
wdt:p4992
wdt:p3846
wdt:p2456
wdt:p8978
wdt:p8926
wdt:p4007
wdt:p5782
wdt:p7356
wdt:p7951
wdt:p8747
wdt:p6068
wdt:p4948
wdt:p5510
wdt:p7765
wdt:p8162
wdt:p1133
wdt:p1702
wdt:p8916
wdt:p7227
wdt:p8595
wdt:p733
wdt:p6222
wdt:p6414
wdt:p5303
wdt:p2185
wdt:p8122
wdt:p8123
wdt:p8333
wdt:p1292
wdt:p1804
wdt:p5006
wdt:p5062
wdt:p3758
wdt:p6514
wdt:p356
wdt:p8404
wdt:p1662
wdt:p5605
wdt:p4630
wdt:p8186
wdt:p760
wdt:p4272
wdt:p8164
wdt:p8041
wdt:p6849
wdt:p3296
wdt:p2985
wdt:p1822
wdt:p1930
wdt:p663
wdt:p4363
wdt:p8494
wdt:p3117
wdt:p5784
wdt:p7578
wdt:p1788
wdt:p6326
wdt:p4617
wdt:p3658
wdt:p3509
wdt:p4167
wdt:p2942
wdt:p8640
wdt:p6140
wdt:p714
wdt:p1250
wdt:p1240
wdt:p6109
wdt:p4038
wdt:p2626
wdt:p3596
wdt:p8708
wdt:p2783
wdt:p2290
wdt:p2763
wdt:p1894
wdt:p6268
wdt:p8341
wdt:p7939
wdt:p8332
wdt:p6232
wdt:p3786
wdt:p6777
wdt:p5884
wdt:p3621
wdt:p8979
wdt:p1935
wdt:p2666
wdt:p5184
wdt:p4270
wdt:p4277
wdt:p2641
wdt:p6706
wdt:p3442
wdt:p2255
wdt:p7978
wdt:p7803
wdt:p1883
wdt:p8793
wdt:p2723
wdt:p2722
wdt:p5988
wdt:p2724
wdt:p6205
wdt:p8364
wdt:p8949
wdt:p6465
wdt:p6649
wdt:p8328
wdt:p6471
wdt:p8313
wdt:p7900
wdt:p8493
wdt:p4331
wdt:p6581
wdt:p6164
wdt:p6674
wdt:p8481
wdt:p5105
wdt:p8671
wdt:p7902
wdt:p4332
wdt:p4727
wdt:p3844
wdt:p4834
wdt:p2162
wdt:p7737
wdt:p1036
wdt:p8359
wdt:p2253
wdt:p1187
wdt:p1188
wdt:p9042
wdt:p9041
wdt:p1610
wdt:p1607
wdt:p1608
wdt:p1609
wdt:p3923
wdt:p7357
wdt:p7872
wdt:p8749
wdt:p3946
wdt:p5106
wdt:p6763
wdt:p2332
wdt:p2753
wdt:p6829
wdt:p1888
wdt:p2745
wdt:p8679
wdt:p5308
wdt:p7630
wdt:p7430
wdt:p3217
wdt:p5147
wdt:p3794
wdt:p2029
wdt:p1648
wdt:p7614
wdt:p5372
wdt:p6302
wdt:p6728
wdt:p6342
wdt:p4749
wdt:p7962
wdt:p4687
wdt:p1276
wdt:p8163
wdt:p3614
wdt:p1936
wdt:p7572
wdt:p6597
wdt:p6115
wdt:p7302
wdt:p8442
wdt:p6863
wdt:p1032
wdt:p5016
wdt:p5015
wdt:p3932
wdt:p7000
wdt:p723
wdt:p7847
wdt:p8788
wdt:p6179
wdt:p6180
wdt:p6178
wdt:p6854
wdt:p6557
wdt:p6727
wdt:p7342
wdt:p5746
wdt:p6585
wdt:p5763
wdt:p8380
wdt:p8696
wdt:p4840
wdt:p7957
wdt:p5115
wdt:p1953
wdt:p6080
wdt:p1955
wdt:p1954
wdt:p2206
wdt:p6079
wdt:p6229
wdt:p699
wdt:p557
wdt:p6181
wdt:p7595
wdt:p7596
wdt:p3112
wdt:p8509
wdt:p8985
wdt:p7203
wdt:p8950
wdt:p6896
wdt:p6515
wdt:p7944
wdt:p8185
wdt:p5793
wdt:p3292
wdt:p3291
wdt:p8778
wdt:p6350
wdt:p7657
wdt:p7038
wdt:p701
wdt:p4943
wdt:p5265
wdt:p5497
wdt:p8643
wdt:p6447
wdt:p6448
wdt:p6441
wdt:p6442
wdt:p6443
wdt:p4529
wdt:p6444
wdt:p5284
wdt:p6445
wdt:p6446
wdt:p6449
wdt:p6450
wdt:p7120
wdt:p7236
wdt:p8416
wdt:p8378
wdt:p7306
wdt:p3533
wdt:p4589
wdt:p8710
wdt:p8873
wdt:p3684
wdt:p8858
wdt:p6736
wdt:p5309
wdt:p715
wdt:p8376
wdt:p4458
wdt:p6911
wdt:p6582
wdt:p1959
wdt:p4358
wdt:p5906
wdt:p7395
wdt:p1939
wdt:p628
wdt:p1900
wdt:p660
wdt:p591
wdt:p232
wdt:p2915
wdt:p2566
wdt:p6871
wdt:p6030
wdt:p5492
wdt:p5493
wdt:p3125
wdt:p5576
wdt:p3141
wdt:p3142
wdt:p303
wdt:p7738
wdt:p7892
wdt:p7873
wdt:p7891
wdt:p7874
wdt:p8767
wdt:p1309
wdt:p4105
wdt:p5381
wdt:p7996
wdt:p1140
wdt:p8422
wdt:p8528
wdt:p2704
wdt:p2756
wdt:p4627
wdt:p8043
wdt:p6394
wdt:p8901
wdt:p1116
wdt:p4672
wdt:p1802
wdt:p3958
wdt:p5910
wdt:p3666
wdt:p4890
wdt:p3031
wdt:p1338
wdt:p7183
wdt:p1058
wdt:p8539
wdt:p7409
wdt:p3434
wdt:p4042
wdt:p4652
wdt:p4644
wdt:p4126
wdt:p3571
wdt:p3685
wdt:p3686
wdt:p3687
wdt:p7262
wdt:p3681
wdt:p3572
wdt:p2697
wdt:p858
wdt:p2815
wdt:p852
wdt:p8303
wdt:p3939
wdt:p6653
wdt:p4536
wdt:p5785
wdt:p2965
wdt:p2856
wdt:p2657
wdt:p3608
wdt:p5755
wdt:p7854
wdt:p7463
wdt:p7492
wdt:p3726
wdt:p7435
wdt:p8320
wdt:p4800
wdt:p1084
wdt:p6681
wdt:p6177
wdt:p4534
wdt:p4535
wdt:p8089
wdt:p4008
wdt:p6042
wdt:p4753
wdt:p4465
wdt:p7408
wdt:p8369
wdt:p8092
wdt:p6390
wdt:p7466
wdt:p7222
wdt:p7215
wdt:p470
wdt:p6955
wdt:p2897
wdt:p4681
wdt:p4682
wdt:p3429
wdt:p7817
wdt:p8088
wdt:p6838
wdt:p4746
wdt:p6506
wdt:p2481
wdt:p4319
wdt:p7343
wdt:p3812
wdt:p1087
wdt:p2346
wdt:p2387
wdt:p5963
wdt:p5440
wdt:p4127
wdt:p8381
wdt:p8711
wdt:p7154
wdt:p455
wdt:p2270
wdt:p8563
wdt:p1565
wdt:p6488
wdt:p5513
wdt:p1385
wdt:p5864
wdt:p8669
wdt:p5441
wdt:p1989
wdt:p1952
wdt:p8166
wdt:p2721
wdt:p8575
wdt:p8377
wdt:p8373
wdt:p5981
wdt:p6010
wdt:p6013
wdt:p4228
wdt:p8116
wdt:p7901
wdt:p7644
wdt:p830
wdt:p7554
wdt:p4613
wdt:p9013
wdt:p3338
wdt:p2931
wdt:p7686
wdt:p8935
wdt:p8135
wdt:p8015
wdt:p8472
wdt:p1417
wdt:p2450
wdt:p3219
wdt:p5369
wdt:p8016
wdt:p8095
wdt:p8931
wdt:p8645
wdt:p6330
wdt:p6331
wdt:p4920
wdt:p7608
wdt:p7829
wdt:p594
wdt:p705
wdt:p704
wdt:p4706
wdt:p3376
wdt:p5370
wdt:p351
wdt:p6117
wdt:p3859
wdt:p4689
wdt:p3121
wdt:p6278
wdt:p8187
wdt:p6996
wdt:p6912
wdt:p2021
wdt:p1601
wdt:p6043
wdt:p5149
wdt:p3659
wdt:p4639
wdt:p2953
wdt:p7509
wdt:p2948
wdt:p2655
wdt:p3823
wdt:p1627
wdt:p5539
wdt:p6438
wdt:p3459
wdt:p7113
wdt:p5437
wdt:p3527
wdt:p7875
wdt:p5183
wdt:p2601
wdt:p5971
wdt:p3766
wdt:p3570
wdt:p4475
wdt:p8800
wdt:p3573
wdt:p3637
wdt:p3521
wdt:p3832
wdt:p3482
wdt:p7704
wdt:p3736
wdt:p5617
wdt:p6457
wdt:p4551
wdt:p3811
wdt:p5851
wdt:p1551
wdt:p4361
wdt:p1555
wdt:p2010
wdt:p2009
wdt:p5650
wdt:p7981
wdt:p5651
wdt:p7319
wdt:p5653
wdt:p8173
wdt:p3597
wdt:p240
wdt:p3050
wdt:p4556
wdt:p7366
wdt:p3462
wdt:p3182
wdt:p3380
wdt:p2371
wdt:p4597
wdt:p4598
wdt:p2163
wdt:p5750
wdt:p8642
wdt:p1400
wdt:p7264
wdt:p7290
wdt:p4278
wdt:p7057
wdt:p3111
wdt:p6044
wdt:p8266
wdt:p5619
wdt:p5620
wdt:p4886
wdt:p4883
wdt:p4074
wdt:p4880
wdt:p3644
wdt:p6612
wdt:p4261
wdt:p7168
wdt:p8077
wdt:p8078
wdt:p3819
wdt:p3817
wdt:p8712
wdt:p3542
wdt:p3446
wdt:p7364
wdt:p1440
wdt:p3441
wdt:p1469
wdt:p7440
wdt:p2696
wdt:p3742
wdt:p2990
wdt:p8861
wdt:p3408
wdt:p4058
wdt:p8585
wdt:p901
wdt:p5086
wdt:p5087
wdt:p774
wdt:p882
wdt:p2776
wdt:p2772
wdt:p2773
wdt:p2774
wdt:p8845
wdt:p2775
wdt:p2777
wdt:p5103
wdt:p6669
wdt:p8846
wdt:p2801
wdt:p6096
wdt:p2486
wdt:p2412
wdt:p2413
wdt:p2266
wdt:p2485
wdt:p7665
wdt:p7265
wdt:p4310
wdt:p4309
wdt:p4307
wdt:p4304
wdt:p4306
wdt:p4206
wdt:p4305
wdt:p4311
wdt:p4308
wdt:p4437
wdt:p6940
wdt:p4113
wdt:p2150
wdt:p1981
wdt:p6624
wdt:p8680
wdt:p6913
wdt:p2013
wdt:p1997
wdt:p4003
wdt:p1731
wdt:p8168
wdt:p7974
wdt:p2889
wdt:p4193
wdt:p3574
wdt:p5693
wdt:p8125
wdt:p6644
wdt:p7970
wdt:p6262
wdt:p4073
wdt:p7433
wdt:p7437
wdt:p7438
wdt:p7439
wdt:p5408
wdt:p6628
wdt:p6627
wdt:p8608
wdt:p1895
wdt:p4807
wdt:p2642
wdt:p3197
wdt:p1544
wdt:p6618
wdt:p3463
wdt:p2070
wdt:p8877
wdt:p6722
wdt:p9058
wdt:p4232
wdt:p3381
wdt:p5820
wdt:p5941
wdt:p480
wdt:p6762
wdt:p8796
wdt:p3495
wdt:p5255
wdt:p5253
wdt:p5254
wdt:p7975
wdt:p8037
wdt:p2747
wdt:p7519
wdt:p7520
wdt:p5233
wdt:p2639
wdt:p8531
wdt:p8928
wdt:p3995
wdt:p5032
wdt:p5033
wdt:p8382
wdt:p6946
wdt:p2025
wdt:p535
wdt:p6792
wdt:p3152
wdt:p7552
wdt:p3394
wdt:p4143
wdt:p2181
wdt:p2182
wdt:p4177
wdt:p6775
wdt:p4106
wdt:p7615
wdt:p1203
wdt:p5266
wdt:p8579
wdt:p5285
wdt:p938
wdt:p8910
wdt:p3089
wdt:p5164
wdt:p5068
wdt:p5935
wdt:p3820
wdt:p5410
wdt:p7460
wdt:p8259
wdt:p7876
wdt:p4655
wdt:p1764
wdt:p3297
wdt:p7024
wdt:p3267
wdt:p6756
wdt:p3100
wdt:p1747
wdt:p3795
wdt:p1727
wdt:p6227
wdt:p3101
wdt:p5179
wdt:p6094
wdt:p3504
wdt:p1726
wdt:p2242
wdt:p6567
wdt:p4347
wdt:p7546
wdt:p3852
wdt:p5038
wdt:p6525
wdt:p8117
wdt:p4637
wdt:p6767
wdt:p8862
wdt:p3662
wdt:p6697
wdt:p6415
wdt:p5628
wdt:p3537
wdt:p7351
wdt:p3660
wdt:p7358
wdt:p4262
wdt:p3661
wdt:p3046
wdt:p7412
wdt:p8387
wdt:p8118
wdt:p8128
wdt:p4506
wdt:p7530
wdt:p7346
wdt:p7720
wdt:p842
wdt:p3663
wdt:p3269
wdt:p8511
wdt:p1402
wdt:p1968
wdt:p6744
wdt:p4107
wdt:p5301
wdt:p5654
wdt:p8044
wdt:p7696
wdt:p8544
wdt:p2537
wdt:p7427
wdt:p646
wdt:p5466
wdt:p6282
wdt:p3767
wdt:p3396
wdt:p4123
wdt:p3281
wdt:p4050
wdt:p8797
wdt:p2380
wdt:p3386
wdt:p7818
wdt:p2385
wdt:p3016
wdt:p6671
wdt:p5070
wdt:p7848
wdt:p6704
wdt:p7229
wdt:p6892
wdt:p3538
wdt:p7495
wdt:p7399
wdt:p6320
wdt:p3664
wdt:p6469
wdt:p4427
wdt:p8714
wdt:p5371
wdt:p5379
wdt:p4317
wdt:p7915
wdt:p3589
wdt:p7336
wdt:p2971
wdt:p8389
wdt:p8366
wdt:p4010
wdt:p3375
wdt:p3367
wdt:p3366
wdt:p4695
wdt:p7352
wdt:p6419
wdt:p4871
wdt:p4872
wdt:p4870
wdt:p9044
wdt:p5040
wdt:p5041
wdt:p5042
wdt:p1033
wdt:p3066
wdt:p6148
wdt:p6799
wdt:p8273
wdt:p227
wdt:p804
wdt:p590
wdt:p2326
wdt:p6823
wdt:p2725
wdt:p5211
wdt:p5214
wdt:p5215
wdt:p5216
wdt:p2988
wdt:p278
wdt:p2560
wdt:p3720
wdt:p917
wdt:p2427
wdt:p1421
wdt:p8957
wdt:p5420
wdt:p3193
wdt:p3067
wdt:p4723
wdt:p916
wdt:p836
wdt:p6054
wdt:p1741
wdt:p7729
wdt:p1414
wdt:p7175
wdt:p6914
wdt:p8919
wdt:p3307
wdt:p3004
wdt:p4258
wdt:p6915
wdt:p8994
wdt:p8420
wdt:p6182
wdt:p7661
wdt:p6472
wdt:p4769
wdt:p6078
wdt:p8090
wdt:p8028
wdt:p5494
wdt:p7877
wdt:p8087
wdt:p4917
wdt:p7911
wdt:p7912
wdt:p7913
wdt:p7914
wdt:p6623
wdt:p6867
wdt:p7794
wdt:p7881
wdt:p7805
wdt:p7806
wdt:p4806
wdt:p7521
wdt:p1837
wdt:p7739
wdt:p7740
wdt:p3104
wdt:p6266
wdt:p4141
wdt:p6536
wdt:p8501
wdt:p8446
wdt:p6402
wdt:p7114
wdt:p8206
wdt:p7349
wdt:p7350
wdt:p2824
wdt:p4108
wdt:p5908
wdt:p4333
wdt:p692
wdt:p686
wdt:p3382
wdt:p668
wdt:p8094
wdt:p8795
wdt:p6608
wdt:p4960
wdt:p7464
wdt:p2600
wdt:p6217
wdt:p6360
wdt:p2373
wdt:p6351
wdt:p6218
wdt:p6361
wdt:p3499
wdt:p5400
wdt:p1566
wdt:p2452
wdt:p3517
wdt:p1172
wdt:p6202
wdt:p8959
wdt:p4364
wdt:p6420
wdt:p6501
wdt:p4166
wdt:p2126
wdt:p3843
wdt:p4023
wdt:p4053
wdt:p7843
wdt:p2024
wdt:p440
wdt:p439
wdt:p1388
wdt:p2628
wdt:p7652
wdt:p1529
wdt:p8051
wdt:p8074
wdt:p5986
wdt:p1667
wdt:p1183
wdt:p5434
wdt:p5247
wdt:p1125
wdt:p4013
wdt:p2037
wdt:p8827
wdt:p8212
wdt:p8060
wdt:p1842
wdt:p846
wdt:p2467
wdt:p5626
wdt:p7955
wdt:p3564
wdt:p6045
wdt:p6433
wdt:p4089
wdt:p3962
wdt:p1394
wdt:p5467
wdt:p1578
wdt:p7136
wdt:p7502
wdt:p2963
wdt:p6327
wdt:p6947
wdt:p2969
wdt:p8383
wdt:p4701
wdt:p4702
wdt:p675
wdt:p4431
wdt:p2671
wdt:p3749
wdt:p6157
wdt:p5337
wdt:p6562
wdt:p4199
wdt:p4198
wdt:p3418
wdt:p4486
wdt:p8939
wdt:p9003
wdt:p1960
wdt:p8008
wdt:p4028
wdt:p2847
wdt:p2805
wdt:p7068
wdt:p3074
wdt:p2597
wdt:p8020
wdt:p7303
wdt:p8386
wdt:p1296
wdt:p6412
wdt:p7102
wdt:p1832
wdt:p1807
wdt:p7388
wdt:p8741
wdt:p2924
wdt:p7948
wdt:p7210
wdt:p5722
wdt:p7295
wdt:p1577
wdt:p3707
wdt:p2282
wdt:p8417
wdt:p8406
wdt:p8591
wdt:p6691
wdt:p7997
wdt:p3106
wdt:p4710
wdt:p6594
wdt:p7257
wdt:p7268
wdt:p7269
wdt:p7266
wdt:p7270
wdt:p7267
wdt:p6206
wdt:p4907
wdt:p3397
wdt:p4715
wdt:p595
wdt:p5458
wdt:p3914
wdt:p6765
wdt:p4181
wdt:p4180
wdt:p2161
wdt:p4546
wdt:p5843
wdt:p3370
wdt:p7864
wdt:p4450
wdt:p8903
wdt:p6773
wdt:p3226
wdt:p8119
wdt:p4703
wdt:p8298
wdt:p6599
wdt:p7025
wdt:p902
wdt:p354
wdt:p353
wdt:p3331
wdt:p3567
wdt:p5909
wdt:p2883
wdt:p3346
wdt:p8878
wdt:p2476
wdt:p7046
wdt:p5094
wdt:p2062
wdt:p4575
wdt:p502
wdt:p7171
wdt:p4671
wdt:p1869
wdt:p5425
wdt:p5091
wdt:p5108
wdt:p3045
wdt:p5057
wdt:p7002
wdt:p6015
wdt:p1184
wdt:p5537
wdt:p3675
wdt:p2015
wdt:p2170
wdt:p3877
wdt:p7330
wdt:p5471
wdt:p6784
wdt:p6264
wdt:p4754
wdt:p5049
wdt:p1844
wdt:p8526
wdt:p4365
wdt:p7999
wdt:p7410
wdt:p2272
wdt:p2273
wdt:p7667
wdt:p4489
wdt:p8355
wdt:p1255
wdt:p6192
wdt:p8518
wdt:p4334
wdt:p8169
wdt:p6916
wdt:p6751
wdt:p3211
wdt:p3209
wdt:p1632
wdt:p7304
wdt:p7271
wdt:p7272
wdt:p7116
wdt:p8593
wdt:p4868
wdt:p5468
wdt:p5735
wdt:p5734
wdt:p5774
wdt:p8617
wdt:p4697
wdt:p709
wdt:p6917
wdt:p2503
wdt:p3627
wdt:p7883
wdt:p8158
wdt:p3885
wdt:p1614
wdt:p3598
wdt:p2602
wdt:p2866
wdt:p7563
wdt:p8443
wdt:p593
wdt:p6417
wdt:p8874
wdt:p6868
wdt:p6869
wdt:p7651
wdt:p5680
wdt:p1762
wdt:p3165
wdt:p3898
wdt:p8400
wdt:p5451
wdt:p2816
wdt:p7982
wdt:p8576
wdt:p8581
wdt:p8900
wdt:p6466
wdt:p6467
wdt:p1081
wdt:p2057
wdt:p3841
wdt:p8973
wdt:p4477
wdt:p4031
wdt:p4966
wdt:p6989
wdt:p6988
wdt:p6987
wdt:p4066
wdt:p8725
wdt:p2619
wdt:p4993
wdt:p6382
wdt:p2719
wdt:p7605
wdt:p6021
wdt:p6300
wdt:p6429
wdt:p6430
wdt:p6348
wdt:p6431
wdt:p6028
wdt:p8870
wdt:p9036
wdt:p8099
wdt:p7069
wdt:p5250
wdt:p3869
wdt:p5098
wdt:p8815
wdt:p4505
wdt:p5914
wdt:p5814
wdt:p6687
wdt:p8425
wdt:p7581
wdt:p2780
wdt:p2778
wdt:p2779
wdt:p229
wdt:p238
wdt:p4734
wdt:p4735
wdt:p4736
wdt:p4197
wdt:p954
wdt:p7182
wdt:p2991
wdt:p4540
wdt:p2459
wdt:p5128
wdt:p3306
wdt:p230
wdt:p239
wdt:p6287
wdt:p6288
wdt:p6286
wdt:p3316
wdt:p494
wdt:p4229
wdt:p1690
wdt:p7807
wdt:p7329
wdt:p493
wdt:p1692
wdt:p563
wdt:p3689
wdt:p8577
wdt:p667
wdt:p4554
wdt:p5220
wdt:p1076
wdt:p4628
wdt:p4401
wdt:p8270
wdt:p5957
wdt:p4977
wdt:p1043
wdt:p4335
wdt:p7741
wdt:p5553
wdt:p8385
wdt:p7637
wdt:p8129
wdt:p6239
wdt:p3978
wdt:p4168
wdt:p6479
wdt:p6480
wdt:p5638
wdt:p305
wdt:p8855
wdt:p7573
wdt:p8997
wdt:p6965
wdt:p6966
wdt:p6971
wdt:p6341
wdt:p3690
wdt:p5150
wdt:p8018
wdt:p6032
wdt:p4469
wdt:p5932
wdt:p5865
wdt:p5385
wdt:p7345
wdt:p2473
wdt:p2480
wdt:p6356
wdt:p1370
wdt:p6108
wdt:p7646
wdt:p4559
wdt:p5063
wdt:p8717
wdt:p8009
wdt:p484
wdt:p5764
wdt:p579
wdt:p5201
wdt:p345
wdt:p5712
wdt:p6992
wdt:p3191
wdt:p8813
wdt:p8812
wdt:p458
wdt:p839
wdt:p6776
wdt:p6960
wdt:p8776
wdt:p3194
wdt:p3895
wdt:p3428
wdt:p4951
wdt:p4479
wdt:p4481
wdt:p4484
wdt:p4485
wdt:p4480
wdt:p4482
wdt:p4483
wdt:p6324
wdt:p772
wdt:p1976
wdt:p3801
wdt:p6069
wdt:p6095
wdt:p5549
wdt:p4729
wdt:p3423
wdt:p2506
wdt:p3422
wdt:p2586
wdt:p374
wdt:p2585
wdt:p4115
wdt:p2930
wdt:p984
wdt:p3672
wdt:p7315
wdt:p4225
wdt:p3917
wdt:p898
wdt:p4397
wdt:p5500
wdt:p3453
wdt:p1828
wdt:p586
wdt:p961
wdt:p2008
wdt:p6281
wdt:p5429
wdt:p3761
wdt:p3793
wdt:p1613
wdt:p5055
wdt:p1297
wdt:p6468
wdt:p3212
wdt:p3097
wdt:p3035
wdt:p957
wdt:p212
wdt:p5092
wdt:p8283
wdt:p952
wdt:p8987
wdt:p1234
wdt:p1239
wdt:p1235
wdt:p1274
wdt:p791
wdt:p946
wdt:p1208
wdt:p213
wdt:p5825
wdt:p506
wdt:p2620
wdt:p297
wdt:p298
wdt:p299
wdt:p300
wdt:p773
wdt:p5209
wdt:p1160
wdt:p2766
wdt:p498
wdt:p218
wdt:p219
wdt:p6519
wdt:p220
wdt:p1798
wdt:p221
wdt:p2627
wdt:p2183
wdt:p6789
wdt:p503
wdt:p2263
wdt:p4020
wdt:p1243
wdt:p2730
wdt:p236
wdt:p7363
wdt:p635
wdt:p6494
wdt:p2694
wdt:p1827
wdt:p3115
wdt:p3116
wdt:p3110
wdt:p3114
wdt:p599
wdt:p8618
wdt:p6841
wdt:p4299
wdt:p8689
wdt:p815
wdt:p3584
wdt:p8881
wdt:p1364
wdt:p3024
wdt:p3604
wdt:p5686
wdt:p5688
wdt:p3743
wdt:p141
wdt:p814
wdt:p627
wdt:p5320
wdt:p4732
wdt:p8475
wdt:p3667
wdt:p3038
wdt:p4504
wdt:p1256
wdt:p269
wdt:p7251
wdt:p7851
wdt:p3760
wdt:p6827
wdt:p8136
wdt:p5099
wdt:p6487
wdt:p6482
wdt:p7186
wdt:p4761
wdt:p234
wdt:p235
wdt:p863
wdt:p8582
wdt:p1391
wdt:p2794
wdt:p5858
wdt:p5921
wdt:p6626
wdt:p7537
wdt:p4635
wdt:p4433
wdt:p7544
wdt:p5696
wdt:p8180
wdt:p7053
wdt:p6503
wdt:p3213
wdt:p5578
wdt:p6919
wdt:p4557
wdt:p4674
wdt:p5987
wdt:p5989
wdt:p6832
wdt:p6717
wdt:p7953
wdt:p6566
wdt:p4227
wdt:p3034
wdt:p8325
wdt:p8668
wdt:p8175
wdt:p6098
wdt:p3169
wdt:p1736
wdt:p5223
wdt:p7558
wdt:p7224
wdt:p4173
wdt:p2003
wdt:p5561
wdt:p7835
wdt:p1771
wdt:p2926
wdt:p6748
wdt:p5557
wdt:p7156
wdt:p696
wdt:p4474
wdt:p5046
wdt:p2423
wdt:p5819
wdt:p2127
wdt:p4849
wdt:p3171
wdt:p7550
wdt:p1796
wdt:p4280
wdt:p3691
wdt:p4588
wdt:p724
wdt:p3099
wdt:p5365
wdt:p1220
wdt:p1218
wdt:p1219
wdt:p1217
wdt:p7477
wdt:p5088
wdt:p5794
wdt:p9043
wdt:p5796
wdt:p5795
wdt:p4456
wdt:p7398
wdt:p6011
wdt:p1233
wdt:p2829
wdt:p8130
wdt:p6372
wdt:p6873
wdt:p4927
wdt:p6161
wdt:p5698
wdt:p1600
wdt:p3467
wdt:p4814
wdt:p8137
wdt:p5449
wdt:p5599
wdt:p6542
wdt:p4631
wdt:p1010
wdt:p1369
wdt:p3021
wdt:p4091
wdt:p4088
wdt:p4059
wdt:p3848
wdt:p4949
wdt:p4836
wdt:p4950
wdt:p4057
wdt:p8726
wdt:p7934
wdt:p7932
wdt:p3906
wdt:p4491
wdt:p3941
wdt:p3867
wdt:p5151
wdt:p3748
wdt:p7681
wdt:p3466
wdt:p8603
wdt:p3769
wdt:p1341
wdt:p6319
wdt:p4207
wdt:p4069
wdt:p3863
wdt:p5114
wdt:p3954
wdt:p2549
wdt:p7822
wdt:p806
wdt:p4399
wdt:p7294
wdt:p8176
wdt:p7783
wdt:p2432
wdt:p2582
wdt:p4048
wdt:p3565
wdt:p5073
wdt:p8993
wdt:p4852
wdt:p6857
wdt:p6336
wdt:p5900
wdt:p5182
wdt:p5386
wdt:p2400
wdt:p3703
wdt:p3650
wdt:p4853
wdt:p6646
wdt:p7566
wdt:p6413
wdt:p716
wdt:p6640
wdt:p888
wdt:p1230
wdt:p8562
wdt:p3827
wdt:p3399
wdt:p1277
wdt:p6502
wdt:p2513
wdt:p2514
wdt:p7187
wdt:p3535
wdt:p5999
wdt:p5960
wdt:p4937
wdt:p4941
wdt:p4938
wdt:p4940
wdt:p6698
wdt:p3385
wdt:p4562
wdt:p4275
wdt:p1386
wdt:p8473
wdt:p849
wdt:p5426
wdt:p7052
wdt:p7056
wdt:p7055
wdt:p7504
wdt:p4116
wdt:p3710
wdt:p8590
wdt:p1438
wdt:p6214
wdt:p8568
wdt:p3198
wdt:p6489
wdt:p7711
wdt:p7961
wdt:p7960
wdt:p7712
wdt:p7786
wdt:p7884
wdt:p7850
wdt:p7844
wdt:p8192
wdt:p7885
wdt:p347
wdt:p6041
wdt:p2832
wdt:p5352
wdt:p7368
wdt:p8100
wdt:p1714
wdt:p2767
wdt:p4930
wdt:p6920
wdt:p7658
wdt:p7925
wdt:p3566
wdt:p6740
wdt:p3875
wdt:p3874
wdt:p3949
wdt:p3053
wdt:p8223
wdt:p6721
wdt:p3277
wdt:p8980
wdt:p5152
wdt:p4370
wdt:p4371
wdt:p8408
wdt:p1287
wdt:p665
wdt:p3639
wdt:p5744
wdt:p2508
wdt:p3305
wdt:p5176
wdt:p5153
wdt:p5154
wdt:p5556
wdt:p3750
wdt:p3704
wdt:p1649
wdt:p3096
wdt:p3818
wdt:p4905
wdt:p2454
wdt:p2064
wdt:p1077
wdt:p8921
wdt:p939
wdt:p6495
wdt:p3237
wdt:p3887
wdt:p1818
wdt:p4460
wdt:p7985
wdt:p2180
wdt:p8616
wdt:p4366
wdt:p7687
wdt:p2705
wdt:p700
wdt:p7065
wdt:p6837
wdt:p6957
wdt:p8912
wdt:p6615
wdt:p8019
wdt:p2684
wdt:p2858
wdt:p3051
wdt:p7458
wdt:p7484
wdt:p7487
wdt:p7485
wdt:p5311
wdt:p5312
wdt:p4981
wdt:p2603
wdt:p2604
wdt:p2970
wdt:p8847
wdt:p8879
wdt:p6741
wdt:p7161
wdt:p3625
wdt:p7348
wdt:p1021
wdt:p6573
wdt:p3407
wdt:p7390
wdt:p8426
wdt:p8427
wdt:p6760
wdt:p3652
wdt:p8021
wdt:p5533
wdt:p8752
wdt:p1288
wdt:p1289
wdt:p6385
wdt:p1248
wdt:p4582
wdt:p758
wdt:p8960
wdt:p1138
wdt:p2108
wdt:p3220
wdt:p3340
wdt:p3341
wdt:p1854
wdt:p2564
wdt:p6223
wdt:p6620
wdt:p8637
wdt:p3665
wdt:p5532
wdt:p7291
wdt:p4611
wdt:p5639
wdt:p782
wdt:p3866
wdt:p6980
wdt:p2977
wdt:p920
wdt:p4382
wdt:p4289
wdt:p3683
wdt:p8285
wdt:p6780
wdt:p6425
wdt:p5117
wdt:p5119
wdt:p5116
wdt:p5118
wdt:p1182
wdt:p6210
wdt:p8805
wdt:p7211
wdt:p2063
wdt:p4612
wdt:p6743
wdt:p1368
wdt:p4216
wdt:p4192
wdt:p4281
wdt:p5618
wdt:p4338
wdt:p5306
wdt:p2810
wdt:p1991
wdt:p5502
wdt:p8573
wdt:p4760
wdt:p5965
wdt:p4283
wdt:p4282
wdt:p5700
wdt:p4822
wdt:p5550
wdt:p7359
wdt:p7320
wdt:p6349
wdt:p3897
wdt:p5295
wdt:p1145
wdt:p761
wdt:p5866
wdt:p5035
wdt:p8715
wdt:p8644
wdt:p4267
wdt:p5445
wdt:p6058
wdt:p3192
wdt:p3127
wdt:p1007
wdt:p2497
wdt:p6870
wdt:p2593
wdt:p4029
wdt:p4001
wdt:p2494
wdt:p2496
wdt:p8046
wdt:p8053
wdt:p7784
wdt:p7785
wdt:p7809
wdt:p7810
wdt:p3802
wdt:p5356
wdt:p7242
wdt:p3107
wdt:p1988
wdt:p6621
wdt:p5558
wdt:p3612
wdt:p6622
wdt:p6664
wdt:p5834
wdt:p2083
wdt:p7026
wdt:p4259
wdt:p4303
wdt:p5339
wdt:p5424
wdt:p5612
wdt:p5476
wdt:p3023
wdt:p8587
wdt:p8507
wdt:p8367
wdt:p1278
wdt:p6247
wdt:p6248
wdt:p6187
wdt:p2861
wdt:p4816
wdt:p4846
wdt:p7100
wdt:p3413
wdt:p3064
wdt:p5862
wdt:p1977
wdt:p5261
wdt:p5262
wdt:p8662
wdt:p5477
wdt:p4434
wdt:p7331
wdt:p6119
wdt:p6127
wdt:p6410
wdt:p6411
wdt:p886
wdt:p8358
wdt:p8188
wdt:p8999
wdt:p7105
wdt:p7106
wdt:p7107
wdt:p4246
wdt:p1708
wdt:p7208
wdt:p6574
wdt:p409
wdt:p4848
wdt:p8647
wdt:p1149
wdt:p8360
wdt:p1144
wdt:p3234
wdt:p4946
wdt:p3266
wdt:p4953
wdt:p2089
wdt:p8516
wdt:p244
wdt:p5442
wdt:p6616
wdt:p2879
wdt:p7400
wdt:p8513
wdt:p8838
wdt:p1085
wdt:p6666
wdt:p6614
wdt:p1899
wdt:p5587
wdt:p9024
wdt:p8976
wdt:p8234
wdt:p8235
wdt:p8236
wdt:p8237
wdt:p6198
wdt:p6883
wdt:p4748
wdt:p4747
wdt:p1396
wdt:p1232
wdt:p8605
wdt:p4264
wdt:p6634
wdt:p8281
wdt:p6362
wdt:p9001
wdt:p5985
wdt:p5542
wdt:p731
wdt:p7742
wdt:p4061
wdt:p6504
wdt:p6130
wdt:p3393
wdt:p3388
wdt:p7724
wdt:p3258
wdt:p7188
wdt:p7836
wdt:p7830
wdt:p8026
wdt:p4601
wdt:p5543
wdt:p4336
wdt:p8655
wdt:p4801
wdt:p3907
wdt:p8474
wdt:p5097
wdt:p5453
wdt:p6520
wdt:p8271
wdt:p3855
wdt:p8210
wdt:p3503
wdt:p3849
wdt:p3850
wdt:p8676
wdt:p7232
wdt:p8305
wdt:p2798
wdt:p5705
wdt:p1428
wdt:p4349
wdt:p4348
wdt:p4367
wdt:p745
wdt:p8227
wdt:p7296
wdt:p8661
wdt:p6583
wdt:p3506
wdt:p3528
wdt:p6162
wdt:p4759
wdt:p8995
wdt:p7597
wdt:p7616
wdt:p7617
wdt:p7206
wdt:p7212
wdt:p640
wdt:p6709
wdt:p2051
wdt:p2082
wdt:p4776
wdt:p8239
wdt:p6877
wdt:p2451
wdt:p6374
wdt:p5509
wdt:p6667
wdt:p4676
wdt:p4679
wdt:p4678
wdt:p4677
wdt:p1987
wdt:p8249
wdt:p6335
wdt:p7531
wdt:p4157
wdt:p2623
wdt:p6888
wdt:p1186
wdt:p3717
wdt:p5001
wdt:p6091
wdt:p2394
wdt:p5407
wdt:p7534
wdt:p4297
wdt:p3763
wdt:p3541
wdt:p3948
wdt:p2398
wdt:p6240
wdt:p587
wdt:p6355
wdt:p6156
wdt:p5268
wdt:p8336
wdt:p4439
wdt:p6046
wdt:p6283
wdt:p7899
wdt:p7468
wdt:p4758
wdt:p3733
wdt:p1657
wdt:p7027
wdt:p7631
wdt:p7632
wdt:p7633
wdt:p4955
wdt:p2914
wdt:p2511
wdt:p8801
wdt:p8802
wdt:p959
wdt:p6797
wdt:p2492
wdt:p8774
wdt:p1377
wdt:p8889
wdt:p7641
wdt:p7216
wdt:p7217
wdt:p7299
wdt:p7300
wdt:p8101
wdt:p5559
wdt:p7375
wdt:p4779
wdt:p4781
wdt:p4780
wdt:p4785
wdt:p7126
wdt:p1563
wdt:p8067
wdt:p8542
wdt:p7811
wdt:p7812
wdt:p2458
wdt:p7204
wdt:p2277
wdt:p8998
wdt:p7310
wdt:p7697
wdt:p4881
wdt:p4724
wdt:p8510
wdt:p1583
wdt:p6843
wdt:p8773
wdt:p1799
wdt:p6921
wdt:p8663
wdt:p8415
wdt:p8522
wdt:p4413
wdt:p6055
wdt:p6422
wdt:p8975
wdt:p4752
wdt:p6092
wdt:p3806
wdt:p1947
wdt:p4388
wdt:p8988
wdt:p3187
wdt:p3006
wdt:p7322
wdt:p3601
wdt:p1624
wdt:p7845
wdt:p6650
wdt:p7950
wdt:p5621
wdt:p8165
wdt:p1803
wdt:p6689
wdt:p4033
wdt:p2812
wdt:p889
wdt:p5867
wdt:p549
wdt:p3285
wdt:p8918
wdt:p8636
wdt:p1942
wdt:p6694
wdt:p486
wdt:p6680
wdt:p672
wdt:p6478
wdt:p3231
wdt:p7886
wdt:p6368
wdt:p7117
wdt:p6369
wdt:p2377
wdt:p9022
wdt:p6813
wdt:p8244
wdt:p8245
wdt:p3201
wdt:p5376
wdt:p5970
wdt:p3768
wdt:p9015
wdt:p9019
wdt:p9017
wdt:p9018
wdt:p9016
wdt:p3899
wdt:p604
wdt:p8282
wdt:p4356
wdt:p2826
wdt:p4518
wdt:p4473
wdt:p5197
wdt:p2278
wdt:p7571
wdt:p8821
wdt:p4400
wdt:p6673
wdt:p3835
wdt:p7916
wdt:p2784
wdt:p4573
wdt:p1738
wdt:p3378
wdt:p4620
wdt:p8834
wdt:p3890
wdt:p1712
wdt:p824
wdt:p6242
wdt:p6922
wdt:p2624
wdt:p4160
wdt:p4161
wdt:p6103
wdt:p6366
wdt:p5885
wdt:p7743
wdt:p5939
wdt:p7744
wdt:p6265
wdt:p6263
wdt:p8727
wdt:p6705
wdt:p1919
wdt:p8648
wdt:p2878
wdt:p2636
wdt:p4712
wdt:p3603
wdt:p3160
wdt:p5736
wdt:p717
wdt:p4730
wdt:p8716
wdt:p7986
wdt:p7989
wdt:p7990
wdt:p7991
wdt:p3981
wdt:p7688
wdt:p4368
wdt:p4385
wdt:p9025
wdt:p7335
wdt:p8650
wdt:p6060
wdt:p4773
wdt:p3913
wdt:p1933
wdt:p7326
wdt:p5360
wdt:p5868
wdt:p8267
wdt:p6774
wdt:p3379
wdt:p8120
wdt:p8280
wdt:p2782
wdt:p2471
wdt:p5737
wdt:p1088
wdt:p7134
wdt:p2903
wdt:p2867
wdt:p5270
wdt:p8323
wdt:p1360
wdt:p8300
wdt:p8301
wdt:p8302
wdt:p6238
wdt:p8543
wdt:p4360
wdt:p8820
wdt:p7255
wdt:p6923
wdt:p8139
wdt:p5495
wdt:p5469
wdt:p5694
wdt:p7538
wdt:p3928
wdt:p6682
wdt:p4468
wdt:p4592
wdt:p671
wdt:p8033
wdt:p2509
wdt:p7745
wdt:p7653
wdt:p1969
wdt:p1970
wdt:p5786
wdt:p5925
wdt:p4784
wdt:p4783
wdt:p4782
wdt:p5990
wdt:p8920
wdt:p8205
wdt:p6458
wdt:p6464
wdt:p4721
wdt:p5656
wdt:p4525
wdt:p4889
wdt:p6005
wdt:p9035
wdt:p6267
wdt:p2941
wdt:p1286
wdt:p1285
wdt:p1284
wdt:p6924
wdt:p4097
wdt:p8334
wdt:p8653
wdt:p6565
wdt:p8947
wdt:p8945
wdt:p8905
wdt:p5321
wdt:p539
wdt:p5954
wdt:p7946
wdt:p8831
wdt:p6006
wdt:p4625
wdt:p4673
wdt:p2174
wdt:p7778
wdt:p2014
wdt:p7917
wdt:p6101
wdt:p6970
wdt:p982
wdt:p434
wdt:p6423
wdt:p8052
wdt:p1330
wdt:p966
wdt:p1004
wdt:p4404
wdt:p5813
wdt:p436
wdt:p1407
wdt:p435
wdt:p6111
wdt:p6122
wdt:p8853
wdt:p6925
wdt:p6964
wdt:p7672
wdt:p4357
wdt:p6999
wdt:p8312
wdt:p6874
wdt:p6742
wdt:p7070
wdt:p2338
wdt:p6358
wdt:p2268
wdt:p4659
wdt:p7698
wdt:p4739
wdt:p6310
wdt:p3674
wdt:p6578
wdt:p5882
wdt:p4086
wdt:p4085
wdt:p4087
wdt:p4084
wdt:p3862
wdt:p3868
wdt:p5452
wdt:p6716
wdt:p962
wdt:p3265
wdt:p7918
wdt:p5496
wdt:p2071
wdt:p4516
wdt:p8157
wdt:p380
wdt:p5139
wdt:p7140
wdt:p4496
wdt:p7434
wdt:p3224
wdt:p2956
wdt:p2004
wdt:p3055
wdt:p6761
wdt:p6759
wdt:p7449
wdt:p6163
wdt:p5667
wdt:p2030
wdt:p5581
wdt:p1611
wdt:p561
wdt:p2475
wdt:p3647
wdt:p7539
wdt:p8707
wdt:p3240
wdt:p8777
wdt:p8762
wdt:p8817
wdt:p3692
wdt:p2393
wdt:p685
wdt:p2483
wdt:p2484
wdt:p1748
wdt:p1048
wdt:p3718
wdt:p6284
wdt:p5762
wdt:p2115
wdt:p2687
wdt:p1054
wdt:p8635
wdt:p3222
wdt:p7669
wdt:p7747
wdt:p3936
wdt:p3539
wdt:p994
wdt:p993
wdt:p995
wdt:p877
wdt:p3563
wdt:p6693
wdt:p3304
wdt:p3700
wdt:p8580
wdt:p3522
wdt:p7995
wdt:p2065
wdt:p1460
wdt:p4596
wdt:p1931
wdt:p2880
wdt:p7748
wdt:p1567
wdt:p3715
wdt:p1645
wdt:p8156
wdt:p691
wdt:p1315
wdt:p4405
wdt:p1213
wdt:p3955
wdt:p1055
wdt:p1695
wdt:p4119
wdt:p4118
wdt:p6927
wdt:p2363
wdt:p7332
wdt:p8220
wdt:p8221
wdt:p6473
wdt:p7831
wdt:p1263
wdt:p3959
wdt:p6049
wdt:p918
wdt:p464
wdt:p7144
wdt:p4260
wdt:p3515
wdt:p7868
wdt:p5840
wdt:p8561
wdt:p4128
wdt:p649
wdt:p5292
wdt:p2840
wdt:p2298
wdt:p8806
wdt:p1375
wdt:p8913
wdt:p6726
wdt:p3130
wdt:p3449
wdt:p6190
wdt:p8699
wdt:p951
wdt:p3133
wdt:p5953
wdt:p8315
wdt:p7791
wdt:p7353
wdt:p1207
wdt:p605
wdt:p2760
wdt:p4528
wdt:p5079
wdt:p8348
wdt:p7626
wdt:p6814
wdt:p8574
wdt:p6082
wdt:p5419
wdt:p6548
wdt:p6549
wdt:p7496
wdt:p8728
wdt:p3646
wdt:p1870
wdt:p8885
wdt:p6972
wdt:p1847
wdt:p8545
wdt:p3956
wdt:p5380
wdt:p4139
wdt:p7898
wdt:p4164
wdt:p6579
wdt:p6580
wdt:p3676
wdt:p1395
wdt:p5622
wdt:p4560
wdt:p4221
wdt:p349
wdt:p2510
wdt:p4027
wdt:p3640
wdt:p7273
wdt:p6891
wdt:p4606
wdt:p8319
wdt:p4154
wdt:p8946
wdt:p5210
wdt:p2252
wdt:p4683
wdt:p8909
wdt:p5368
wdt:p8906
wdt:p2041
wdt:p4684
wdt:p4997
wdt:p7547
wdt:p1216
wdt:p7942
wdt:p9054
wdt:p4750
wdt:p2526
wdt:p5657
wdt:p3468
wdt:p4591
wdt:p3988
wdt:p8963
wdt:p6906
wdt:p4619
wdt:p7369
wdt:p3348
wdt:p7039
wdt:p949
wdt:p8189
wdt:p5034
wdt:p7699
wdt:p7028
wdt:p7682
wdt:p1003
wdt:p7029
wdt:p2966
wdt:p6786
wdt:p7472
wdt:p5719
wdt:p4509
wdt:p9061
wdt:p4257
wdt:p4182
wdt:p3516
wdt:p8730
wdt:p8649
wdt:p1763
wdt:p7030
wdt:p1816
wdt:p6152
wdt:p4117
wdt:p3353
wdt:p8240
wdt:p8039
wdt:p8479
wdt:p5567
wdt:p7795
wdt:p6733
wdt:p5005
wdt:p3881
wdt:p6995
wdt:p4373
wdt:p5827
wdt:p7308
wdt:p5222
wdt:p6558
wdt:p6688
wdt:p8147
wdt:p2574
wdt:p1006
wdt:p2538
wdt:p2539
wdt:p8660
wdt:p3425
wdt:p8246
wdt:p7746
wdt:p1732
wdt:p3648
wdt:p3613
wdt:p7148
wdt:p7506
wdt:p7275
wdt:p7274
wdt:p8673
wdt:p6890
wdt:p7837
wdt:p3405
wdt:p2863
wdt:p6926
wdt:p7473
wdt:p8599
wdt:p5273
wdt:p6898
wdt:p6047
wdt:p7966
wdt:p1874
wdt:p8652
wdt:p4394
wdt:p4414
wdt:p7276
wdt:p3208
wdt:p4903
wdt:p4374
wdt:p4273
wdt:p6899
wdt:p4430
wdt:p8297
wdt:p3221
wdt:p6048
wdt:p5687
wdt:p5104
wdt:p3728
wdt:p4056
wdt:p2752
wdt:p4418
wdt:p6136
wdt:p7259
wdt:p8304
wdt:p713
wdt:p712
wdt:p6900
wdt:p8242
wdt:p3477
wdt:p2085
wdt:p7585
wdt:p5838
wdt:p4685
wdt:p8024
wdt:p3360
wdt:p3188
wdt:p7749
wdt:p4284
wdt:p4286
wdt:p2950
wdt:p8346
wdt:p7750
wdt:p5570
wdt:p5571
wdt:p6901
wdt:p5792
wdt:p6221
wdt:p8314
wdt:p8722
wdt:p5080
wdt:p5081
wdt:p5165
wdt:p5944
wdt:p4375
wdt:p5870
wdt:p3200
wdt:p1271
wdt:p1272
wdt:p1275
wdt:p4055
wdt:p5580
wdt:p5964
wdt:p5391
wdt:p1270
wdt:p1439
wdt:p5170
wdt:p5169
wdt:p4574
wdt:p2504
wdt:p2333
wdt:p8269
wdt:p5871
wdt:p4972
wdt:p5156
wdt:p7040
wdt:p7060
wdt:p909
wdt:p4406
wdt:p1473
wdt:p1474
wdt:p8734
wdt:p6754
wdt:p6778
wdt:p6201
wdt:p243
wdt:p5331
wdt:p2372
wdt:p8086
wdt:p6289
wdt:p5275
wdt:p829
wdt:p3138
wdt:p7327
wdt:p7570
wdt:p7567
wdt:p7564
wdt:p721
wdt:p3248
wdt:p3245
wdt:p3250
wdt:p2391
wdt:p764
wdt:p3243
wdt:p3246
wdt:p6352
wdt:p2493
wdt:p492
wdt:p7139
wdt:p496
wdt:p613
wdt:p6050
wdt:p6353
wdt:p5805
wdt:p8253
wdt:p3894
wdt:p6796
wdt:p6985
wdt:p8615
wdt:p8418
wdt:p6277
wdt:p6105
wdt:p3371
wdt:p8629
wdt:p8343
wdt:p5163
wdt:p7540
wdt:p6559
wdt:p3568
wdt:p6893
wdt:p8524
wdt:p8480
wdt:p7149
wdt:p4690
wdt:p6025
wdt:p4376
wdt:p3944
wdt:p3940
wdt:p5224
wdt:p8286
wdt:p9055
wdt:p5815
wdt:p1245
wdt:p3479
wdt:p4629
wdt:p5396
wdt:p6373
wdt:p7474
wdt:p3223
wdt:p7689
wdt:p7305
wdt:p2830
wdt:p8604
wdt:p5157
wdt:p5158
wdt:p5162
wdt:p4120
wdt:p3054
wdt:p4412
wdt:p5122
wdt:p8769
wdt:p3638
wdt:p3076
wdt:p7813
wdt:p8651
wdt:p8402
wdt:p5738
wdt:p1820
wdt:p1821
wdt:p5930
wdt:p7927
wdt:p1972
wdt:p648
wdt:p3847
wdt:p3302
wdt:p5534
wdt:p7238
wdt:p7967
wdt:p7814
wdt:p3181
wdt:p1320
wdt:p5256
wdt:p2864
wdt:p8487
wdt:p5332
wdt:p3122
wdt:p3118
wdt:p6677
wdt:p4741
wdt:p6676
wdt:p8424
wdt:p5610
wdt:p1893
wdt:p1430
wdt:p7683
wdt:p8965
wdt:p8964
wdt:p8968
wdt:p4691
wdt:p2686
wdt:p8754
wdt:p402
wdt:p1282
wdt:p6592
wdt:p6220
wdt:p7197
wdt:p1229
wdt:p8551
wdt:p8552
wdt:p8790
wdt:p8549
wdt:p4407
wdt:p4869
wdt:p862
wdt:p5366
wdt:p5359
wdt:p5358
wdt:p8735
wdt:p8736
wdt:p8737
wdt:p5912
wdt:p5336
wdt:p5335
wdt:p8951
wdt:p8177
wdt:p8261
wdt:p6745
wdt:p1550
wdt:p5002
wdt:p7819
wdt:p5768
wdt:p5937
wdt:p8445
wdt:p7638
wdt:p7639
wdt:p7648
wdt:p7503
wdt:p8410
wdt:p1415
wdt:p2814
wdt:p1331
wdt:p4212
wdt:p5718
wdt:p8832
wdt:p8560
wdt:p4813
wdt:p3971
wdt:p3972
wdt:p2625
wdt:p2744
wdt:p8962
wdt:p7048
wdt:p7064
wdt:p5345
wdt:p8254
wdt:p8042
wdt:p6299
wdt:p7871
wdt:p6928
wdt:p7370
wdt:p6337
wdt:p381
wdt:p3636
wdt:p638
wdt:p908
wdt:p763
wdt:p7129
wdt:p2811
wdt:p6941
wdt:p8311
wdt:p8982
wdt:p3973
wdt:p8742
wdt:p8029
wdt:p7181
wdt:p4030
wdt:p7293
wdt:p4293
wdt:p8483
wdt:p8484
wdt:p932
wdt:p8390
wdt:p2918
wdt:p905
wdt:p3268
wdt:p2435
wdt:p9060
wdt:p7659
wdt:p2299
wdt:p6696
wdt:p5641
wdt:p2748
wdt:p2749
wdt:p4355
wdt:p4294
wdt:p4978
wdt:p4926
wdt:p7754
wdt:p3476
wdt:p1051
wdt:p1838
wdt:p2194
wdt:p5758
wdt:p6486
wdt:p6550
wdt:p5745
wdt:p4201
wdt:p6595
wdt:p6785
wdt:p4122
wdt:p481
wdt:p6746
wdt:p2434
wdt:p7277
wdt:p4818
wdt:p7849
wdt:p6332
wdt:p4416
wdt:p8103
wdt:p8104
wdt:p8108
wdt:p5545
wdt:p5544
wdt:p5541
wdt:p7077
wdt:p6246
wdt:p630
wdt:p4083
wdt:p3481
wdt:p3810
wdt:p1749
wdt:p8904
wdt:p2172
wdt:p1236
wdt:p5727
wdt:p5296
wdt:p8109
wdt:p8681
wdt:p5418
wdt:p7333
wdt:p1461
wdt:p4233
wdt:p4236
wdt:p4235
wdt:p4175
wdt:p3318
wdt:p3177
wdt:p4133
wdt:p4891
wdt:p3770
wdt:p3635
wdt:p7278
wdt:p7279
wdt:p3109
wdt:p7031
wdt:p6290
wdt:p8405
wdt:p6654
wdt:p866
wdt:p3347
wdt:p1852
wdt:p7041
wdt:p7771
wdt:p8440
wdt:p6973
wdt:p2460
wdt:p5632
wdt:p8758
wdt:p2732
wdt:p2733
wdt:p5760
wdt:p4301
wdt:p3519
wdt:p3708
wdt:p7001
wdt:p4855
wdt:p3232
wdt:p3236
wdt:p3732
wdt:p3235
wdt:p3233
wdt:p8317
wdt:p4643
wdt:p988
wdt:p2750
wdt:p6551
wdt:p3361
wdt:p3892
wdt:p5726
wdt:p7254
wdt:p6831
wdt:p8096
wdt:p4025
wdt:p8948
wdt:p3836
wdt:p8819
wdt:p4077
wdt:p6672
wdt:p6233
wdt:p5598
wdt:p7180
wdt:p7726
wdt:p6034
wdt:p6605
wdt:p6061
wdt:p1070
wdt:p3102
wdt:p5037
wdt:p7541
wdt:p2944
wdt:p7707
wdt:p2606
wdt:p6132
wdt:p5833
wdt:p6113
wdt:p9010
wdt:p6316
wdt:p7493
wdt:p3047
wdt:p6315
wdt:p7280
wdt:p5346
wdt:p1992
wdt:p1584
wdt:p2938
wdt:p7159
wdt:p4919
wdt:p7551
wdt:p9006
wdt:p9011
wdt:p9007
wdt:p7998
wdt:p9012
wdt:p7992
wdt:p5392
wdt:p5341
wdt:p5506
wdt:p5430
wdt:p5503
wdt:p5394
wdt:p5343
wdt:p7142
wdt:p5593
wdt:p1685
wdt:p1980
wdt:p5075
wdt:p5723
wdt:p7838
wdt:p6071
wdt:p3424
wdt:p3124
wdt:p2267
wdt:p8462
wdt:p6328
wdt:p8759
wdt:p6245
wdt:p5739
wdt:p5246
wdt:p5286
wdt:p6114
wdt:p8611
wdt:p8780
wdt:p1052
wdt:p1005
wdt:p4423
wdt:p1463
wdt:p2090
wdt:p8506
wdt:p3368
wdt:p8197
wdt:p7579
wdt:p7752
wdt:p6811
wdt:p5011
wdt:p5890
wdt:p7059
wdt:p4944
wdt:p861
wdt:p6311
wdt:p7263
wdt:p4095
wdt:p5344
wdt:p8171
wdt:p4515
wdt:p5535
wdt:p6930
wdt:p3581
wdt:p6993
wdt:p6836
wdt:p3561
wdt:p6665
wdt:p4429
wdt:p1663
wdt:p2327
wdt:p2328
wdt:p6572
wdt:p8548
wdt:p7423
wdt:p7670
wdt:p4826
wdt:p1938
wdt:p2034
wdt:p9053
wdt:p7753
wdt:p8349
wdt:p8842
wdt:p6781
wdt:p6037
wdt:p2421
wdt:p5313
wdt:p5310
wdt:p5942
wdt:p8149
wdt:p8523
wdt:p8665
wdt:p8837
wdt:p5085
wdt:p8145
wdt:p6376
wdt:p7792
wdt:p2874
wdt:p662
wdt:p2153
wdt:p653
wdt:p698
wdt:p7381
wdt:p2169
wdt:p3431
wdt:p3829
wdt:p7461
wdt:p7403
wdt:p7411
wdt:p4340
wdt:p6958
wdt:p7820
wdt:p5568
wdt:p7387
wdt:p4344
wdt:p6459
wdt:p5584
wdt:p8393
wdt:p2968
wdt:p7071
wdt:p8863
wdt:p5666
wdt:p5879
wdt:p8690
wdt:p633
wdt:p3856
wdt:p4609
wdt:p8468
wdt:p2967
wdt:p3257
wdt:p3417
wdt:p4411
wdt:p2592
wdt:p4553
wdt:p2845
wdt:p3945
wdt:p2637
wdt:p1262
wdt:p6994
wdt:p5969
wdt:p6975
wdt:p6387
wdt:p6658
wdt:p4645
wdt:p4866
wdt:p6370
wdt:p3065
wdt:p4867
wdt:p6825
wdt:p8022
wdt:p6752
wdt:p5459
wdt:p5462
wdt:p8250
wdt:p6081
wdt:p6882
wdt:p5504
wdt:p1575
wdt:p3706
wdt:p3705
wdt:p4142
wdt:p8519
wdt:p1715
wdt:p650
wdt:p350
wdt:p4989
wdt:p4009
wdt:p7190
wdt:p8697
wdt:p4203
wdt:p867
wdt:p6782
wdt:p7226
wdt:p8040
wdt:p5478
wdt:p8170
wdt:p947
wdt:p5643
wdt:p1973
wdt:p1815
wdt:p3834
wdt:p657
wdt:p2106
wdt:p7281
wdt:p4339
wdt:p4521
wdt:p9023
wdt:p9009
wdt:p2491
wdt:p2478
wdt:p3930
wdt:p2525
wdt:p7164
wdt:p3853
wdt:p5404
wdt:p7313
wdt:p8392
wdt:p2905
wdt:p7602
wdt:p7654
wdt:p7775
wdt:p7198
wdt:p8633
wdt:p2428
wdt:p4096
wdt:p3937
wdt:p5640
wdt:p4916
wdt:p7954
wdt:p3957
wdt:p1579
wdt:p5710
wdt:p6747
wdt:p3609
wdt:p3714
wdt:p3883
wdt:p6056
wdt:p5540
wdt:p3131
wdt:p4265
wdt:p5290
wdt:p656
wdt:p639
wdt:p2249
wdt:p637
wdt:p6701
wdt:p1150
wdt:p8362
wdt:p8613
wdt:p8666
wdt:p6228
wdt:p5836
wdt:p3590
wdt:p5181
wdt:p5264
wdt:p8897
wdt:p5406
wdt:p7032
wdt:p6931
wdt:p6554
wdt:p3908
wdt:p7542
wdt:p8155
wdt:p2761
wdt:p6023
wdt:p2740
wdt:p2038
wdt:p5875
wdt:p1053
wdt:p5029
wdt:p6600
wdt:p6601
wdt:p8841
wdt:p8202
wdt:p8110
wdt:p6976
wdt:p2125
wdt:p2001
wdt:p5711
wdt:p892
wdt:p3523
wdt:p8748
wdt:p6602
wdt:p5413
wdt:p4928
wdt:p1979
wdt:p6426
wdt:p4287
wdt:p359
wdt:p7135
wdt:p7444
wdt:p1214
wdt:p3500
wdt:p7339
wdt:p4190
wdt:p6617
wdt:p3162
wdt:p6461
wdt:p6462
wdt:p6463
wdt:p4041
wdt:p4040
wdt:p5171
wdt:p5173
wdt:p5172
wdt:p5174
wdt:p1185
wdt:p6932
wdt:p7929
wdt:p5240
wdt:p2751
wdt:p7146
wdt:p3017
wdt:p5334
wdt:p2366
wdt:p2365
wdt:p2359
wdt:p2358
wdt:p1770
wdt:p4067
wdt:p6399
wdt:p7645
wdt:p5047
wdt:p1258
wdt:p7425
wdt:p1829
wdt:p4986
wdt:p4808
wdt:p1293
wdt:p2823
wdt:p4302
wdt:p8765
wdt:p3389
wdt:p5566
wdt:p4799
wdt:p4707
wdt:p4923
wdt:p4925
wdt:p4922
wdt:p6881
wdt:p4464
wdt:p3154
wdt:p3155
wdt:p6984
wdt:p6317
wdt:p4471
wdt:p6739
wdt:p5077
wdt:p3622
wdt:p5771
wdt:p7092
wdt:p7780
wdt:p4417
wdt:p6313
wdt:p6312
wdt:p7011
wdt:p2678
wdt:p3345
wdt:p6660
wdt:p6661
wdt:p8677
wdt:p3918
wdt:p3327
wdt:p6858
wdt:p5076
wdt:p3807
wdt:p6933
wdt:p3678
wdt:p2482
wdt:p5761
wdt:p5966
wdt:p8439
wdt:p8463
wdt:p3759
wdt:p4662
wdt:p8105
wdt:p3475
wdt:p8974
wdt:p8143
wdt:p1023
wdt:p1024
wdt:p396
wdt:p5485
wdt:p3230
wdt:p377
wdt:p7241
wdt:p2524
wdt:p6209
wdt:p906
wdt:p7956
wdt:p9026
wdt:p4936
wdt:p5455
wdt:p3987
wdt:p7609
wdt:p3242
wdt:p6556
wdt:p2164
wdt:p2165
wdt:p2166
wdt:p781
wdt:p8209
wdt:p3083
wdt:p4046
wdt:p1700
wdt:p3580
wdt:p1616
wdt:p3215
wdt:p843
wdt:p8342
wdt:p8038
wdt:p8356
wdt:p8357
wdt:p6715
wdt:p5274
wdt:p5876
wdt:p7522
wdt:p7523
wdt:p8917
wdt:p4078
wdt:p6979
wdt:p8533
wdt:p8923
wdt:p7401
wdt:p5585
wdt:p3430
wdt:p2972
wdt:p6937
wdt:p8181
wdt:p4558
wdt:p4568
wdt:p6967
wdt:p8255
wdt:p7708
wdt:p7713
wdt:p7701
wdt:p6630
wdt:p5806
wdt:p2672
wdt:p919
wdt:p8106
wdt:p5305
wdt:p2479
wdt:p7758
wdt:p4964
wdt:p8534
wdt:p8836
wdt:p5877
wdt:p8634
wdt:p5743
wdt:p4572
wdt:p3992
wdt:p7776
wdt:p1849
wdt:p1850
wdt:p893
wdt:p3747
wdt:p8654
wdt:p3911
wdt:p5946
wdt:p1025
wdt:p4520
wdt:p6817
wdt:p1044
wdt:p6189
wdt:p3406
wdt:p3800
wdt:p3799
wdt:p4833
wdt:p5271
wdt:p6007
wdt:p6625
wdt:p8854
wdt:p3668
wdt:p368
wdt:p2536
wdt:p5189
wdt:p626
wdt:p4047
wdt:p369
wdt:p5188
wdt:p2535
wdt:p1450
wdt:p6604
wdt:p2368
wdt:p1106
wdt:p5979
wdt:p370
wdt:p4045
wdt:p578
wdt:p855
wdt:p4380
wdt:p1422
wdt:p1717
wdt:p6126
wdt:p7839
wdt:p3592
wdt:p7821
wdt:p845
wdt:p5690
wdt:p6172
wdt:p5664
wdt:p3411
wdt:p6700
wdt:p6560
wdt:p6516
wdt:p1261
wdt:p6978
wdt:p6950
wdt:p6102
wdt:p3228
wdt:p8743
wdt:p7121
wdt:p8159
wdt:p8504
wdt:p8694
wdt:p4389
wdt:p7709
wdt:p7710
wdt:p7663
wdt:p7662
wdt:p7965
wdt:p2518
wdt:p2519
wdt:p1154
wdt:p1155
wdt:p1153
wdt:p1156
wdt:p6062
wdt:p6063
wdt:p4451
wdt:p6064
wdt:p6065
wdt:p3043
wdt:p6308
wdt:p6066
wdt:p8700
wdt:p4512
wdt:p3163
wdt:p3049
wdt:p5470
wdt:p4974
wdt:p4975
wdt:p4976
wdt:p4987
wdt:p4318
wdt:p2658
wdt:p7755
wdt:p7756
wdt:p8075
wdt:p7757
wdt:p7234
wdt:p7199
wdt:p6584
wdt:p8521
wdt:p7840
wdt:p6051
wdt:p6018
wdt:p8598
wdt:p2909
wdt:p2908
wdt:p7355
wdt:p4230
wdt:p7517
wdt:p4961
wdt:p8172
wdt:p5955
wdt:p4012
wdt:p8299
wdt:p4011
wdt:p6611
wdt:p7671
wdt:p3986
wdt:p3731
wdt:p3727
wdt:p4547
wdt:p7919
wdt:p7179
wdt:p2886
wdt:p6702
wdt:p6703
wdt:p6329
wdt:p5917
wdt:p5915
wdt:p2818
wdt:p4636
wdt:p4449
wdt:p4034
wdt:p4035
wdt:p3751
wdt:p5934
wdt:p6133
wdt:p8151
wdt:p8152
wdt:p4726
wdt:p5338
wdt:p3524
wdt:p3579
wdt:p6959
wdt:p6256
wdt:p6255
wdt:p7553
wdt:p8350
wdt:p4892
wdt:p8893
wdt:p2621
wdt:p2401
wdt:p4670
wdt:p5787
wdt:p3619
wdt:p8146
wdt:p5790
wdt:p6400
wdt:p6389
wdt:p2893
wdt:p1699
wdt:p8614
wdt:p5276
wdt:p4016
wdt:p7700
wdt:p8174
wdt:p1587
wdt:p1254
wdt:p8678
wdt:p8695
wdt:p7282
wdt:p4935
wdt:p8489
wdt:p6405
wdt:p4704
wdt:p1795
wdt:p3518
wdt:p1886
wdt:p2984
wdt:p4538
wdt:p4502
wdt:p4921
wdt:p5740
wdt:p2195
wdt:p2193
wdt:p7465
wdt:p7454
wdt:p8134
wdt:p4381
wdt:p7878
wdt:p7494
wdt:p2369
wdt:p8775
wdt:p6131
wdt:p8002
wdt:p4942
wdt:p6138
wdt:p7516
wdt:p4737
wdt:p7200
wdt:p5287
wdt:p5241
wdt:p3478
wdt:p3977
wdt:p4757
wdt:p8911
wdt:p6155
wdt:p6124
wdt:p3040
wdt:p7201
wdt:p3878
wdt:p3854
wdt:p2209
wdt:p3139
wdt:p3140
wdt:p8495
wdt:p8182
wdt:p911
wdt:p4623
wdt:p4037
wdt:p7690
wdt:p4605
wdt:p3229
wdt:p8871
wdt:p8572
wdt:p4459
wdt:p8082
wdt:p8421
wdt:p4593
wdt:p7703
wdt:p7827
wdt:p2455
wdt:p6019
wdt:p5234
wdt:p5926
wdt:p7283
wdt:p2350
wdt:p3694
wdt:p3695
wdt:p4314
wdt:p7655
wdt:p2973
wdt:p4537
wdt:p5609
wdt:p4415
wdt:p6729
wdt:p6768
wdt:p6808
wdt:p4421
wdt:p3168
wdt:p1447
wdt:p8756
wdt:p4751
wdt:p3696
wdt:p8825
wdt:p3697
wdt:p8761
wdt:p2205
wdt:p1902
wdt:p8704
wdt:p5916
wdt:p8347
wdt:p2207
wdt:p6662
wdt:p5983
wdt:p5918
wdt:p5217
wdt:p3286
wdt:p3145
wdt:p7575
wdt:p6541
wdt:p1482
wdt:p5288
wdt:p8713
wdt:p8606
wdt:p3123
wdt:p3798
wdt:p1397
wdt:p8924
wdt:p7414
wdt:p884
wdt:p7489
wdt:p4812
wdt:p3012
wdt:p1069
wdt:p2589
wdt:p3175
wdt:p5841
wdt:p1733
wdt:p7432
wdt:p6945
wdt:p6645
wdt:p5129
wdt:p3952
wdt:p9004
wdt:p5082
wdt:p4342
wdt:p3072
wdt:p5283
wdt:p6481
wdt:p2418
wdt:p454
wdt:p711
wdt:p8953
wdt:p9039
wdt:p2349
wdt:p4581
wdt:p3309
wdt:p6652
wdt:p3582
wdt:p8256
wdt:p3330
wdt:p7191
wdt:p8407
wdt:p2877
wdt:p3583
wdt:p3392
wdt:p4478
wdt:p4524
wdt:p4532
wdt:p8478
wdt:p4963
wdt:p6983
wdt:p5325
wdt:p6303
wdt:p8409
wdt:p2335
wdt:p2334
wdt:p2337
wdt:p2168
wdt:p2336
wdt:p4830
wdt:p1238
wdt:p8133
wdt:p5259
wdt:p5101
wdt:p5123
wdt:p1316
wdt:p4607
wdt:p5324
wdt:p2323
wdt:p1260
wdt:p6460
wdt:p8388
wdt:p4819
wdt:p8433
wdt:p7574
wdt:p7894
wdt:p5316
wdt:p777
wdt:p507
wdt:p2898
wdt:p1841
wdt:p776
wdt:p525
wdt:p5536
wdt:p775
wdt:p4315
