[
    {
        "uid": 1588,
        "question": [
            "list",
            "the",
            "launch",
            "site",
            "of",
            "the",
            "rockets",
            "whose",
            "one",
            "of",
            "the",
            "launch",
            "site",
            "has",
            "been",
            "cape",
            "canaveral",
            "air",
            "force",
            "station",
            "launch",
            "complex",
            "26",
            "[sep]",
            "http://dbpedia.org/resource/cape_canaveral_air_force_station_launch_complex_26",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/launchsite",
            "http://dbpedia.org/ontology/launchsite",
            "http://dbpedia.org/ontology/rocket"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_26",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/launchSite",
            "http://dbpedia.org/ontology/launchSite",
            "http://dbpedia.org/ontology/Rocket"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 ?vr1 ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 . ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2684,
        "question": [
            "what",
            "is",
            "the",
            "television",
            "show",
            "which",
            "has",
            "cast",
            "member",
            "as",
            "jason",
            "carter",
            "and",
            "network",
            "is",
            "tnt",
            "tv",
            "channel",
            "[sep]",
            "http://dbpedia.org/resource/jason_carter_(actor)",
            "http://dbpedia.org/resource/tnt_(tv_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jason_Carter_(actor)",
            "http://dbpedia.org/resource/TNT_(TV_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> . . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 75,
        "question": [
            "what",
            "is",
            "the",
            "nation",
            "of",
            "the",
            "speedway",
            "league",
            "where",
            "ikaros",
            "smederna",
            "played",
            "[sep]",
            "http://dbpedia.org/resource/ikaros_smederna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/league",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/speedwayleague"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ikaros_Smederna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/league",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/SpeedwayLeague"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2601,
        "question": [
            "who",
            "penned",
            "emma",
            "and",
            "jane",
            "austen",
            "in",
            "manhatten",
            "[sep]",
            "http://dbpedia.org/resource/jane_austen_in_manhattan",
            "http://dbpedia.org/resource/emma_(novel)",
            "[sep]",
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jane_Austen_in_Manhattan",
            "http://dbpedia.org/resource/Emma_(novel)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/author"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@1> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 1816,
        "question": [
            "politicians",
            "born",
            "in",
            "bangalore",
            "are",
            "now",
            "in",
            "which",
            "parties",
            "[sep]",
            "http://dbpedia.org/resource/bangalore",
            "[sep]",
            "http://dbpedia.org/property/hometown",
            "http://dbpedia.org/ontology/party"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bangalore"
        ],
        "goldrels": [
            "http://dbpedia.org/property/homeTown",
            "http://dbpedia.org/ontology/party"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2673,
        "question": [
            "which",
            "university",
            "has",
            "chancellor",
            "as",
            "nicholas",
            "s",
            "zeppos",
            "[sep]",
            "http://dbpedia.org/resource/nicholas_s._zeppos",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/chancellor",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Nicholas_S._Zeppos",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/chancellor",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <predpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] . . <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1259,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "companies",
            "located",
            "in",
            "texas",
            "[sep]",
            "http://dbpedia.org/resource/texas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/locationcity",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Texas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/locationCity",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . .",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 <predpos@@2> .",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0",
        "exact_match": "no match"
    },
    {
        "uid": 2759,
        "question": [
            "name",
            "all",
            "those",
            "buried",
            "in",
            "a",
            "place",
            "governed",
            "by",
            "a",
            "city",
            "council",
            "[sep]",
            "http://dbpedia.org/resource/city_council",
            "[sep]",
            "http://dbpedia.org/ontology/governingbody",
            "http://dbpedia.org/property/restingplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/City_council"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/governingBody",
            "http://dbpedia.org/property/restingPlace"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . } <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 331,
        "question": [
            "how",
            "many",
            "people",
            "are",
            "there",
            "who",
            "have",
            "relationship",
            "with",
            "kennedy",
            "family",
            "[sep]",
            "http://dbpedia.org/resource/kennedy_family",
            "[sep]",
            "http://dbpedia.org/ontology/relation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Kennedy_family"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/relation"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> } }",
        "exact_match": "no match"
    },
    {
        "uid": 1649,
        "question": [
            "what",
            "religions",
            "are",
            "followed",
            "by",
            "economists",
            "[sep]",
            "http://dbpedia.org/resource/economist",
            "[sep]",
            "http://dbpedia.org/ontology/profession",
            "http://dbpedia.org/ontology/religion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Economist"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/profession",
            "http://dbpedia.org/ontology/religion"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ) <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 319,
        "question": [
            "how",
            "many",
            "teams",
            "have",
            "used",
            "the",
            "stadium",
            "which",
            "hosted",
            "the",
            "wcw",
            "mayhem",
            "[sep]",
            "http://dbpedia.org/resource/wcw_mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/WCW_Mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3> <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 602,
        "question": [
            "how",
            "many",
            "sports",
            "are",
            "played",
            "in",
            "maharashtran",
            "schools",
            "[sep]",
            "http://dbpedia.org/resource/maharashtra",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/state",
            "http://dbpedia.org/ontology/sport",
            "http://dbpedia.org/ontology/sport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Maharashtra",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/state",
            "http://dbpedia.org/ontology/sport",
            "http://dbpedia.org/ontology/Sport"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> ?vr1 ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 ?vr1 <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1808,
        "question": [
            "in",
            "how",
            "many",
            "places",
            "has",
            "don",
            "r",
            "berlin",
            "worked",
            "[sep]",
            "http://dbpedia.org/resource/don_r._berlin",
            "[sep]",
            "http://dbpedia.org/ontology/employer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Don_R._Berlin"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/employer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( <entpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 1404,
        "question": [
            "list",
            "the",
            "people",
            "who",
            "were",
            "the",
            "first",
            "one",
            "to",
            "climb",
            "a",
            "mountain",
            "in",
            "california",
            "[sep]",
            "http://dbpedia.org/resource/california",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/locatedinarea",
            "http://dbpedia.org/ontology/firstascentperson",
            "http://dbpedia.org/ontology/mountain"
        ],
        "goldents": [
            "http://dbpedia.org/resource/California",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/locatedInArea",
            "http://dbpedia.org/ontology/firstAscentPerson",
            "http://dbpedia.org/ontology/Mountain"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2107,
        "question": [
            "what",
            "is",
            "the",
            "name",
            "of",
            "the",
            "television",
            "show",
            "whose",
            "developer",
            "is",
            "j",
            "michael",
            "straczynski",
            "and",
            "actor",
            "is",
            "jason",
            "carter",
            "actor",
            "[sep]",
            "http://dbpedia.org/resource/j._michael_straczynski",
            "http://dbpedia.org/resource/jason_carter_(actor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/J._Michael_Straczynski",
            "http://dbpedia.org/resource/Jason_Carter_(actor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] ( ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3235,
        "question": [
            "which",
            "nasa",
            "astronaut",
            "was",
            "on",
            "mission",
            "gemini",
            "8",
            "[sep]",
            "http://dbpedia.org/resource/nasa",
            "http://dbpedia.org/resource/gemini_8",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/ontology/mission",
            "http://dbpedia.org/ontology/astronaut"
        ],
        "goldents": [
            "http://dbpedia.org/resource/NASA",
            "http://dbpedia.org/resource/Gemini_8",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/type",
            "http://dbpedia.org/ontology/mission",
            "http://dbpedia.org/ontology/Astronaut"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] <predpos@@2> <entpos@@2> <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 919,
        "question": [
            "how",
            "many",
            "universities",
            "participate",
            "in",
            "the",
            "ncaa",
            "division",
            "i",
            "football",
            "bowl",
            "subdivision",
            "[sep]",
            "http://dbpedia.org/resource/ncaa_division_i_football_bowl_subdivision",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/NCAA_Division_I_Football_Bowl_Subdivision",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2272,
        "question": [
            "how",
            "many",
            "scientist",
            "have",
            "won",
            "an",
            "award",
            "by",
            "the",
            "society",
            "led",
            "by",
            "venkatraman",
            "ramakrishnan",
            "[sep]",
            "http://dbpedia.org/resource/venkatraman_ramakrishnan",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/leadername",
            "http://dbpedia.org/property/prizes",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Venkatraman_Ramakrishnan",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/leaderName",
            "http://dbpedia.org/property/prizes",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2055,
        "question": [
            "over",
            "how",
            "many",
            "cities",
            "did",
            "the",
            "bellaton",
            "mma",
            "season",
            "11",
            "take",
            "place",
            "[sep]",
            "http://dbpedia.org/resource/bellator_mma:_season_eleven",
            "[sep]",
            "http://dbpedia.org/property/city"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bellator_MMA:_Season_Eleven"
        ],
        "goldrels": [
            "http://dbpedia.org/property/city"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 352,
        "question": [
            "things",
            "going",
            "to",
            "the",
            "mediterranean",
            "sea",
            "also",
            "go",
            "where",
            "[sep]",
            "http://dbpedia.org/resource/mediterranean_sea",
            "[sep]",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/destination"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mediterranean_Sea"
        ],
        "goldrels": [
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/destination"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2720,
        "question": [
            "where",
            "are",
            "renaissance",
            "centers",
            "located",
            "[sep]",
            "http://dbpedia.org/resource/renaissance_center",
            "[sep]",
            "http://dbpedia.org/ontology/address"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Renaissance_Center"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/address"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] ( . }",
        "answer_3": "select distinct ?vr0 ( { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    }
]