[
    {
        "uid": 509,
        "question": [
            "how",
            "many",
            "people",
            "used",
            "to",
            "play",
            "for",
            "toronto",
            "argonauts",
            "[sep]",
            "http://dbpedia.org/resource/toronto_argonauts",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Toronto_Argonauts"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 724,
        "question": [
            "in",
            "how",
            "many",
            "different",
            "places",
            "were",
            "the",
            "people",
            "born",
            "who",
            "are",
            "members",
            "of",
            "national",
            "museum",
            "of",
            "racing",
            "and",
            "hall",
            "of",
            "fame",
            "[sep]",
            "http://dbpedia.org/resource/national_museum_of_racing_and_hall_of_fame",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/honours",
            "http://dbpedia.org/property/birthplace",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/honours",
            "http://dbpedia.org/property/birthPlace",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 ?vr1 ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 ?vr0 ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2397,
        "question": [
            "which",
            "band",
            "had",
            "members",
            "who",
            "are",
            "now",
            "in",
            "the",
            "bleeding",
            "heart",
            "band",
            "[sep]",
            "http://dbpedia.org/resource/the_bleeding_heart_band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/associatedband",
            "http://dbpedia.org/ontology/formerbandmember",
            "http://dbpedia.org/ontology/band"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Bleeding_Heart_Band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedBand",
            "http://dbpedia.org/ontology/formerBandMember",
            "http://dbpedia.org/ontology/Band"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1097,
        "question": [
            "name",
            "the",
            "kingdom",
            "with",
            "currency",
            "solidus",
            "coin",
            "and",
            "administrative",
            "headquarters",
            "in",
            "nicomedia",
            "[sep]",
            "http://dbpedia.org/resource/solidus_(coin)",
            "http://dbpedia.org/resource/nicomedia",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/capital"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Solidus_(coin)",
            "http://dbpedia.org/resource/Nicomedia"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/capital"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1967,
        "question": [
            "how",
            "many",
            "people",
            "have",
            "parterned",
            "with",
            "the",
            "person",
            "choroegraphed",
            "by",
            "catarina",
            "lindgren",
            "in",
            "the",
            "past",
            "[sep]",
            "http://dbpedia.org/resource/catarina_lindgren",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerchoreographer",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Catarina_Lindgren",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerChoreographer",
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1202,
        "question": [
            "how",
            "many",
            "non",
            "fiction",
            "topics",
            "does",
            "thud",
            "deals",
            "with",
            "[sep]",
            "http://dbpedia.org/resource/thud!",
            "[sep]",
            "http://dbpedia.org/ontology/nonfictionsubject"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thud!"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nonFictionSubject"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1> . .",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 705,
        "question": [
            "how",
            "many",
            "companies",
            "were",
            "founded",
            "in",
            "denton",
            "texas",
            "[sep]",
            "http://dbpedia.org/resource/denton_county,_texas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/part",
            "http://dbpedia.org/ontology/foundationplace",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Denton_County,_Texas",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/part",
            "http://dbpedia.org/ontology/foundationPlace",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2296,
        "question": [
            "how",
            "many",
            "awards",
            "have",
            "been",
            "given",
            "to",
            "screenwriters",
            "[sep]",
            "http://dbpedia.org/resource/screenwriter",
            "[sep]",
            "http://dbpedia.org/property/occupation",
            "http://dbpedia.org/property/awards"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Screenwriter"
        ],
        "goldrels": [
            "http://dbpedia.org/property/occupation",
            "http://dbpedia.org/property/awards"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2416,
        "question": [
            "list",
            "all",
            "the",
            "movies",
            "whose",
            "music",
            "has",
            "been",
            "made",
            "up",
            "with",
            "someone",
            "under",
            "rca",
            "records",
            "[sep]",
            "http://dbpedia.org/resource/rca_records",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/recordlabel",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/RCA_Records",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/recordLabel",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 2476,
        "question": [
            "what",
            "is",
            "the",
            "common",
            "race",
            "of",
            "the",
            "martin",
            "molony",
            "and",
            "race",
            "of",
            "the",
            "coneygree",
            "[sep]",
            "http://dbpedia.org/resource/martin_molony",
            "http://dbpedia.org/resource/coneygree",
            "[sep]",
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/race"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Martin_Molony",
            "http://dbpedia.org/resource/Coneygree"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/race",
            "http://dbpedia.org/ontology/race"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> } ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 2694,
        "question": [
            "where",
            "is",
            "the",
            "successor",
            "of",
            "john",
            "waldo",
            "from",
            "[sep]",
            "http://dbpedia.org/resource/john_b._waldo",
            "[sep]",
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/property/state"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_B._Waldo"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/property/state"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 851,
        "question": [
            "give",
            "the",
            "name",
            "of",
            "the",
            "river",
            "with",
            "source",
            "place",
            "as",
            "australian",
            "alps",
            "and",
            "has",
            "mouth",
            "place",
            "as",
            "goolwa",
            "a",
            "place",
            "in",
            "siyuth",
            "australia",
            "[sep]",
            "http://dbpedia.org/resource/australian_alps",
            "http://dbpedia.org/resource/goolwa,_south_australia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/sourceplace",
            "http://dbpedia.org/ontology/mouthplace",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Australian_Alps",
            "http://dbpedia.org/resource/Goolwa,_South_Australia",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/sourcePlace",
            "http://dbpedia.org/ontology/mouthPlace",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <predpos@@3> <predpos@@3>",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <entpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2289,
        "question": [
            "how",
            "many",
            "television",
            "shows",
            "have",
            "fox",
            "broadcasting",
            "company",
            "as",
            "their",
            "channel",
            "[sep]",
            "http://dbpedia.org/resource/fox_broadcasting_company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/channel",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fox_Broadcasting_Company",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/channel",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1825,
        "question": [
            "how",
            "many",
            "shows",
            "are",
            "made",
            "by",
            "playtone",
            "[sep]",
            "http://dbpedia.org/resource/playtone",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Playtone",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . .",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2916,
        "question": [
            "georg",
            "meissner",
            "was",
            "doctoral",
            "supervisor",
            "of",
            "which",
            "scientist",
            "[sep]",
            "http://dbpedia.org/resource/georg_meissner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/doctoraladvisor",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Georg_Meissner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralAdvisor",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <predpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2942,
        "question": [
            "where",
            "was",
            "the",
            "deadbody",
            "discovered",
            "of",
            "one",
            "of",
            "the",
            "alumni",
            "of",
            "general",
            "educational",
            "development",
            "[sep]",
            "http://dbpedia.org/resource/general_educational_development",
            "[sep]",
            "http://dbpedia.org/ontology/education",
            "http://dbpedia.org/ontology/bodydiscovered"
        ],
        "goldents": [
            "http://dbpedia.org/resource/General_Educational_Development"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/education",
            "http://dbpedia.org/ontology/bodyDiscovered"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 ?vr1 }",
        "exact_match": "match"
    },
    {
        "uid": 1065,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "other",
            "nonfiction",
            "subject",
            "of",
            "the",
            "books",
            "whose",
            "one",
            "of",
            "the",
            "subject",
            "is",
            "racism",
            "[sep]",
            "http://dbpedia.org/resource/racism",
            "[sep]",
            "http://dbpedia.org/ontology/nonfictionsubject",
            "http://dbpedia.org/ontology/nonfictionsubject"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Racism"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nonFictionSubject",
            "http://dbpedia.org/ontology/nonFictionSubject"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1795,
        "question": [
            "who",
            "is",
            "associated",
            "with",
            "the",
            "musical",
            "artists",
            "from",
            "africa",
            "70",
            "band",
            "and",
            "tony",
            "allen",
            "[sep]",
            "http://dbpedia.org/resource/africa_'70_(band)",
            "http://dbpedia.org/resource/tony_allen_(musician)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/associatedmusicalartist",
            "http://dbpedia.org/ontology/associatedmusicalartist",
            "http://dbpedia.org/ontology/musicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Africa_'70_(band)",
            "http://dbpedia.org/resource/Tony_Allen_(musician)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/associatedMusicalArtist",
            "http://dbpedia.org/ontology/associatedMusicalArtist",
            "http://dbpedia.org/ontology/MusicalArtist"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] [UNK] ( <predpos@@2> [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] [UNK] ( ( [UNK] . ?vr0 . <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 839,
        "question": [
            "which",
            "composer",
            "subsequent",
            "work",
            "of",
            "moondog",
            "matinee",
            "and",
            "also",
            "composed",
            "the",
            "times",
            "they",
            "are",
            "a",
            "changin",
            "[sep]",
            "http://dbpedia.org/resource/the_times_they_are_a-changin'_(musical)",
            "http://dbpedia.org/resource/moondog_matinee",
            "[sep]",
            "http://dbpedia.org/ontology/musicby",
            "http://dbpedia.org/ontology/subsequentwork"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)",
            "http://dbpedia.org/resource/Moondog_Matinee"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/musicBy",
            "http://dbpedia.org/ontology/subsequentWork"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] [UNK] [UNK] <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2255,
        "question": [
            "give",
            "me",
            "the",
            "total",
            "number",
            "of",
            "television",
            "shows",
            "whose",
            "theme",
            "music",
            "composer",
            "is",
            "julian",
            "gingell",
            "and",
            "created",
            "by",
            "simon",
            "fuller",
            "[sep]",
            "http://dbpedia.org/resource/julian_gingell",
            "http://dbpedia.org/resource/simon_fuller",
            "[sep]",
            "http://dbpedia.org/property/thememusiccomposer",
            "http://dbpedia.org/property/creator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Julian_Gingell",
            "http://dbpedia.org/resource/Simon_Fuller"
        ],
        "goldrels": [
            "http://dbpedia.org/property/themeMusicComposer",
            "http://dbpedia.org/property/creator"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where <entpos@@1> . <predpos@@1> <predpos@@2> ?vr0 . <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { [UNK] ( <predpos@@1> [UNK] ( . ?vr1 ?vr1 <entpos@@2>",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] [UNK] ( [UNK] [UNK] [UNK] ?vr1 ?vr1 ?vr0 <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] [UNK] ( [UNK] [UNK] [UNK] ?vr1 ?vr1 ?vr1 <predpos@@3>",
        "exact_match": "no match"
    }
]