[
    {
        "uid": 1640,
        "question": [
            "give",
            "me",
            "all",
            "tv",
            "shows",
            "which",
            "are",
            "based",
            "in",
            "boston",
            "and",
            "massachusetts",
            "[sep]",
            "http://dbpedia.org/resource/boston",
            "http://dbpedia.org/resource/massachusetts",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Boston",
            "http://dbpedia.org/resource/Massachusetts",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 674,
        "question": [
            "which",
            "planet",
            "was",
            "discovered",
            "by",
            "urbain",
            "le",
            "verrier",
            "[sep]",
            "http://dbpedia.org/resource/urbain_le_verrier",
            "[sep]",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Urbain_Le_Verrier"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/discoverer"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 168,
        "question": [
            "who",
            "had",
            "joe",
            "purcell",
            "and",
            "winston",
            "bryant",
            "as",
            "lieutenants",
            "[sep]",
            "http://dbpedia.org/resource/joe_purcell",
            "http://dbpedia.org/resource/winston_bryant",
            "[sep]",
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Joe_Purcell",
            "http://dbpedia.org/resource/Winston_Bryant"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/lieutenant",
            "http://dbpedia.org/ontology/lieutenant"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 387,
        "question": [
            "how",
            "many",
            "shows",
            "is",
            "russell",
            "davies",
            "known",
            "for",
            "[sep]",
            "http://dbpedia.org/resource/russell_t_davies",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/notableworks",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Russell_T_Davies",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/notableworks",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1081,
        "question": [
            "give",
            "me",
            "the",
            "count",
            "of",
            "newspaper",
            "whose",
            "language",
            "is",
            "sweedish",
            "and",
            "headquartered",
            "at",
            "stockholm",
            "[sep]",
            "http://dbpedia.org/resource/swedish_language",
            "http://dbpedia.org/resource/stockholm",
            "[sep]",
            "http://dbpedia.org/property/language",
            "http://dbpedia.org/property/headquarters"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Swedish_language",
            "http://dbpedia.org/resource/Stockholm"
        ],
        "goldrels": [
            "http://dbpedia.org/property/language",
            "http://dbpedia.org/property/headquarters"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> } }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2408,
        "question": [
            "how",
            "many",
            "have",
            "family",
            "as",
            "ape",
            "and",
            "order",
            "taxonomy",
            "is",
            "primate",
            "[sep]",
            "http://dbpedia.org/resource/ape",
            "http://dbpedia.org/resource/primate",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/order"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ape",
            "http://dbpedia.org/resource/Primate"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/order"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> } }",
        "answer_3": "select distinct where where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1620,
        "question": [
            "does",
            "the",
            "us",
            "navy",
            "have",
            "the",
            "structure",
            "of",
            "command",
            "of",
            "us",
            "department",
            "of",
            "defence",
            "[sep]",
            "http://dbpedia.org/resource/united_states_navy",
            "http://dbpedia.org/resource/united_states_department_of_defense",
            "[sep]",
            "http://dbpedia.org/property/commandstructure"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States_Navy",
            "http://dbpedia.org/resource/United_States_Department_of_Defense"
        ],
        "goldrels": [
            "http://dbpedia.org/property/commandStructure"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "ask where { [UNK] [UNK] [UNK] ( [UNK] <predpos@@1> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 3065,
        "question": [
            "what",
            "are",
            "some",
            "cartoons",
            "distributed",
            "by",
            "a",
            "subsidiary",
            "of",
            "time",
            "warner",
            "[sep]",
            "http://dbpedia.org/resource/time_warner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/parentcompany",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/cartoon"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Time_Warner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/parentCompany",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/Cartoon"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] [UNK] [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . <predpos@@3> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 302,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "shows",
            "whose",
            "creators",
            "are",
            "jerry",
            "seinfeld",
            "and",
            "larry",
            "david",
            "[sep]",
            "http://dbpedia.org/resource/jerry_seinfeld",
            "http://dbpedia.org/resource/larry_david",
            "[sep]",
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/creator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jerry_Seinfeld",
            "http://dbpedia.org/resource/Larry_David"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/creator"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "exact_match": "no match"
    },
    {
        "uid": 1902,
        "question": [
            "which",
            "team",
            "did",
            "michael",
            "and",
            "ryan",
            "powell",
            "play",
            "for",
            "[sep]",
            "http://dbpedia.org/resource/michael_powell_(lacrosse)",
            "http://dbpedia.org/resource/ryan_powell_(lacrosse)",
            "[sep]",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/team"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Michael_Powell_(lacrosse)",
            "http://dbpedia.org/resource/Ryan_Powell_(lacrosse)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/team"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( ( . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 412,
        "question": [
            "which",
            "people",
            "are",
            "known",
            "for",
            "appearing",
            "on",
            "the",
            "television",
            "show",
            "dragons",
            "den",
            "[sep]",
            "http://dbpedia.org/resource/dragons'_den_(uk_tv_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/knownfor",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/knownFor",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 263,
        "question": [
            "count",
            "the",
            "total",
            "number",
            "of",
            "software",
            "whose",
            "programming",
            "language",
            "is",
            "c",
            "and",
            "operating",
            "system",
            "is",
            "microsoft",
            "windows",
            "[sep]",
            "http://dbpedia.org/resource/c++",
            "http://dbpedia.org/resource/microsoft_windows",
            "[sep]",
            "http://dbpedia.org/property/programminglanguage",
            "http://dbpedia.org/ontology/operatingsystem"
        ],
        "goldents": [
            "http://dbpedia.org/resource/C++",
            "http://dbpedia.org/resource/Microsoft_Windows"
        ],
        "goldrels": [
            "http://dbpedia.org/property/programmingLanguage",
            "http://dbpedia.org/ontology/operatingSystem"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> <entpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 556,
        "question": [
            "what",
            "is",
            "the",
            "television",
            "show",
            "whose",
            "opening",
            "theme",
            "is",
            "te",
            "deum",
            "charpentier",
            "[sep]",
            "http://dbpedia.org/resource/te_deum_(charpentier)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/openingtheme",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Te_Deum_(Charpentier)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/openingTheme",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 [UNK] <entpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 676,
        "question": [
            "who",
            "is",
            "the",
            "father",
            "of",
            "barbara",
            "ann",
            "crancer",
            "[sep]",
            "http://dbpedia.org/resource/barbara_ann_crancer",
            "[sep]",
            "http://dbpedia.org/ontology/child"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Barbara_Ann_Crancer"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/child"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . . <predpos@@2> <predpos@@2> . . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . . <predpos@@2> . . . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . . <predpos@@2> <predpos@@2> . }",
        "exact_match": "match"
    },
    {
        "uid": 846,
        "question": [
            "how",
            "many",
            "cities",
            "are",
            "around",
            "the",
            "sea",
            "in",
            "which",
            "the",
            "the",
            "fig",
            "tree",
            "bay",
            "meets",
            "[sep]",
            "http://dbpedia.org/resource/fig_tree_bay",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/inflow",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/sea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fig_Tree_Bay",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/inflow",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/Sea"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr1 . ?vr0 <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1645,
        "question": [
            "what",
            "is",
            "the",
            "official",
            "language",
            "of",
            "ladonia",
            "which",
            "is",
            "the",
            "target",
            "area",
            "of",
            "probus",
            "journal",
            "[sep]",
            "http://dbpedia.org/resource/ladonia_(micronation)",
            "http://dbpedia.org/resource/probus_(journal)",
            "[sep]",
            "http://dbpedia.org/ontology/officiallanguage",
            "http://dbpedia.org/ontology/academicdiscipline"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ladonia_(micronation)",
            "http://dbpedia.org/resource/Probus_(journal)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/officialLanguage",
            "http://dbpedia.org/ontology/academicDiscipline"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1486,
        "question": [
            "how",
            "many",
            "have",
            "order",
            "taxonomy",
            "as",
            "bacillales",
            "and",
            "division",
            "as",
            "firmicutes",
            "are",
            "there",
            "[sep]",
            "http://dbpedia.org/resource/bacillales",
            "http://dbpedia.org/resource/firmicutes",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/division"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacillales",
            "http://dbpedia.org/resource/Firmicutes"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/division"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> } }",
        "exact_match": "match"
    },
    {
        "uid": 2248,
        "question": [
            "how",
            "many",
            "teams",
            "was",
            "garry",
            "unger",
            "in",
            "previously",
            "[sep]",
            "http://dbpedia.org/resource/garry_unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/sportsteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Garry_Unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/SportsTeam"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 6,
        "question": [
            "what",
            "tv",
            "series",
            "can",
            "be",
            "said",
            "to",
            "be",
            "related",
            "to",
            "the",
            "sarah",
            "jane",
            "adventure",
            "and",
            "dr",
            "who",
            "confidential",
            "[sep]",
            "http://dbpedia.org/resource/the_sarah_jane_adventures",
            "http://dbpedia.org/resource/doctor_who_confidential",
            "[sep]",
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/related"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Sarah_Jane_Adventures",
            "http://dbpedia.org/resource/Doctor_Who_Confidential"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/related"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2> <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 305,
        "question": [
            "under",
            "whom",
            "did",
            "charles",
            "drummond",
            "ellis",
            "do",
            "his",
            "phd",
            "[sep]",
            "http://dbpedia.org/resource/charles_drummond_ellis",
            "[sep]",
            "http://dbpedia.org/ontology/doctoralstudent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Charles_Drummond_Ellis"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralStudent"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> ?vr0 [UNK] ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2905,
        "question": [
            "who",
            "is",
            "the",
            "owner",
            "of",
            "the",
            "bank",
            "which",
            "owns",
            "bloomberg",
            "radio",
            "[sep]",
            "http://dbpedia.org/resource/bloomberg_radio",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/bank"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bloomberg_Radio",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/owner",
            "http://dbpedia.org/ontology/Bank"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 . ?vr0 . ?vr1 <entpos@@2>",
        "exact_match": "no match"
    }
]