[
    {
        "uid": 65,
        "question": [
            "where",
            "are",
            "aureus",
            "and",
            "solidus",
            "used",
            "as",
            "currency",
            "[sep]",
            "http://dbpedia.org/resource/aureus",
            "http://dbpedia.org/resource/solidus_(coin)",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Aureus",
            "http://dbpedia.org/resource/Solidus_(coin)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] . ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> [UNK] ( . }",
        "exact_match": "no match"
    },
    {
        "uid": 3046,
        "question": [
            "what",
            "is",
            "the",
            "mascot",
            "of",
            "blytheville",
            "high",
            "school",
            "[sep]",
            "http://dbpedia.org/resource/blytheville_high_school",
            "[sep]",
            "http://dbpedia.org/ontology/mascot"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Blytheville_High_School"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mascot"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select where ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select ask ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2783,
        "question": [
            "what",
            "company",
            "made",
            "the",
            "front",
            "row",
            "and",
            "distributed",
            "big",
            "top",
            "ballet",
            "[sep]",
            "http://dbpedia.org/resource/big_top_ballet",
            "http://dbpedia.org/resource/front_row_(software)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Big_Top_Ballet",
            "http://dbpedia.org/resource/Front_Row_(software)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 3100,
        "question": [
            "who",
            "discovered",
            "europa",
            "and",
            "callisto",
            "[sep]",
            "http://dbpedia.org/resource/europa_(moon)",
            "http://dbpedia.org/resource/callisto_(moon)",
            "[sep]",
            "http://dbpedia.org/ontology/discoverer",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Europa_(moon)",
            "http://dbpedia.org/resource/Callisto_(moon)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/discoverer",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "ask where { <entpos@@1> [UNK] ( <predpos@@1> [UNK] [UNK] ( [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> [UNK] ( <predpos@@1> [UNK] [UNK] ( [UNK] ( . }",
        "answer_2": "ask where { <entpos@@1> [UNK] ( <predpos@@1> ( [UNK] ( . }",
        "answer_3": "ask where { <entpos@@1> [UNK] ( <predpos@@1> ( [UNK] ( [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 249,
        "question": [
            "how",
            "many",
            "more",
            "teams",
            "have",
            "rented",
            "the",
            "stadium",
            "used",
            "by",
            "raptors",
            "905",
            "[sep]",
            "http://dbpedia.org/resource/raptors_905",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/arena",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Raptors_905",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/arena",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 794,
        "question": [
            "what",
            "are",
            "some",
            "party",
            "leaders",
            "of",
            "the",
            "parties",
            "which",
            "have",
            "had",
            "a",
            "seat",
            "in",
            "berlin",
            "[sep]",
            "http://dbpedia.org/resource/berlin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/politicalparty"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Berlin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/PoliticalParty"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 574,
        "question": [
            "how",
            "many",
            "have",
            "former",
            "teams",
            "as",
            "indianapolis",
            "colts",
            "and",
            "carolina",
            "panthers",
            "[sep]",
            "http://dbpedia.org/resource/indianapolis_colts",
            "http://dbpedia.org/resource/carolina_panthers",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indianapolis_Colts",
            "http://dbpedia.org/resource/Carolina_Panthers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct where where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> . }",
        "exact_match": "no match"
    }
]