[
    {
        "uid": 1199,
        "question": [
            "where",
            "are",
            "solidus",
            "and",
            "aureus",
            "used",
            "[sep]",
            "http://dbpedia.org/resource/solidus_(coin)",
            "http://dbpedia.org/resource/aureus",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Solidus_(coin)",
            "http://dbpedia.org/resource/Aureus"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> } }",
        "exact_match": "no match"
    },
    {
        "uid": 1485,
        "question": [
            "how",
            "many",
            "things",
            "are",
            "aired",
            "on",
            "bbc",
            "hd",
            "[sep]",
            "http://dbpedia.org/resource/bbc_hd",
            "[sep]",
            "http://dbpedia.org/ontology/network"
        ],
        "goldents": [
            "http://dbpedia.org/resource/BBC_HD"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/network"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 3182,
        "question": [
            "what",
            "is",
            "the",
            "meaning",
            "of",
            "heydar",
            "[sep]",
            "http://dbpedia.org/resource/heydar",
            "[sep]",
            "http://dbpedia.org/ontology/meaning"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Heydar"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/meaning"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 1301,
        "question": [
            "how",
            "many",
            "games",
            "are",
            "released",
            "for",
            "virtual",
            "consoles",
            "[sep]",
            "http://dbpedia.org/resource/virtual_console",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/computingplatform",
            "http://dbpedia.org/ontology/videogame"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Virtual_Console",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/computingPlatform",
            "http://dbpedia.org/ontology/VideoGame"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 <predpos@@2> ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 614,
        "question": [
            "count",
            "the",
            "affiliations",
            "of",
            "international",
            "union",
            "of",
            "anarchists",
            "[sep]",
            "http://dbpedia.org/resource/international_union_of_anarchists",
            "[sep]",
            "http://dbpedia.org/property/affiliation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/International_Union_of_Anarchists"
        ],
        "goldrels": [
            "http://dbpedia.org/property/affiliation"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 906,
        "question": [
            "who",
            "is",
            "the",
            "fictional",
            "character",
            "who",
            "portrayed",
            "in",
            "terminator",
            "2",
            "judgment",
            "day",
            "[sep]",
            "http://dbpedia.org/resource/terminator_2:_judgment_day",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/portrayer",
            "http://dbpedia.org/ontology/fictionalcharacter"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Terminator_2:_Judgment_Day",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/portrayer",
            "http://dbpedia.org/ontology/FictionalCharacter"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@2> . .",
        "exact_match": "match"
    },
    {
        "uid": 2995,
        "question": [
            "what",
            "are",
            "the",
            "things",
            "whose",
            "director",
            "of",
            "photography",
            "died",
            "in",
            "united",
            "states",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/cinematography"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/cinematography"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 1149,
        "question": [
            "how",
            "many",
            "sports",
            "are",
            "played",
            "at",
            "the",
            "university",
            "whose",
            "president",
            "is",
            "emanuel",
            "de",
            "guzman",
            "[sep]",
            "http://dbpedia.org/resource/emanuel_de_guzman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/president",
            "http://dbpedia.org/ontology/sport",
            "http://dbpedia.org/ontology/sport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Emanuel_de_Guzman",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/president",
            "http://dbpedia.org/ontology/sport",
            "http://dbpedia.org/ontology/Sport"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 1129,
        "question": [
            "is",
            "lieutenant",
            "general",
            "united",
            "states",
            "the",
            "superintendent",
            "of",
            "united",
            "states",
            "air",
            "force",
            "academy",
            "[sep]",
            "http://dbpedia.org/resource/united_states_air_force_academy",
            "http://dbpedia.org/resource/lieutenant_general_(united_states)",
            "[sep]",
            "http://dbpedia.org/property/superintendent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States_Air_Force_Academy",
            "http://dbpedia.org/resource/Lieutenant_general_(United_States)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/superintendent"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@1> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@1> } ?vr0",
        "exact_match": "no match"
    },
    {
        "uid": 2588,
        "question": [
            "list",
            "the",
            "television",
            "shows",
            "whose",
            "distributors",
            "are",
            "located",
            "at",
            "burbank",
            "california",
            "[sep]",
            "http://dbpedia.org/resource/burbank,_california",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/locationcity",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Burbank,_California",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/locationCity",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1067,
        "question": [
            "count",
            "the",
            "drinks",
            "originated",
            "in",
            "england",
            "[sep]",
            "http://dbpedia.org/resource/england",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/beverage"
        ],
        "goldents": [
            "http://dbpedia.org/resource/England",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/Beverage"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . .",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@2> . .",
        "exact_match": "match"
    },
    {
        "uid": 2002,
        "question": [
            "itv",
            "employes",
            "how",
            "many",
            "people",
            "[sep]",
            "http://dbpedia.org/resource/itv_(tv_network)",
            "[sep]",
            "http://dbpedia.org/property/employer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/ITV_(TV_network)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/employer"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] <predpos@@1> } }",
        "exact_match": "match"
    },
    {
        "uid": 862,
        "question": [
            "what",
            "are",
            "all",
            "the",
            "tv",
            "shows",
            "which",
            "are",
            "related",
            "to",
            "the",
            "ones",
            "produced",
            "by",
            "julie",
            "gardner",
            "[sep]",
            "http://dbpedia.org/resource/julie_gardner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/executiveproducer",
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Julie_Gardner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/executiveProducer",
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <entpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] [UNK] ( . [UNK] [UNK] <predpos@@2> . . . <entpos@@2> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 922,
        "question": [
            "how",
            "many",
            "other",
            "wine",
            "region",
            "are",
            "there",
            "of",
            "the",
            "grapes",
            "whose",
            "one",
            "of",
            "the",
            "wine",
            "region",
            "is",
            "michigan",
            "[sep]",
            "http://dbpedia.org/resource/michigan",
            "[sep]",
            "http://dbpedia.org/ontology/wineregion",
            "http://dbpedia.org/ontology/wineregion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Michigan"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/wineRegion",
            "http://dbpedia.org/ontology/wineRegion"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( <predpos@@1> <predpos@@1> ?vr1 }",
        "exact_match": "match"
    },
    {
        "uid": 1113,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "on",
            "associates",
            "of",
            "johnny",
            "cash",
            "[sep]",
            "http://dbpedia.org/resource/johnny_cash",
            "[sep]",
            "http://dbpedia.org/property/associatedacts"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Johnny_Cash"
        ],
        "goldrels": [
            "http://dbpedia.org/property/associatedActs"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( <entpos@@1> <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 596,
        "question": [
            "name",
            "the",
            "common",
            "musical",
            "band",
            "of",
            "take",
            "me",
            "there",
            "and",
            "tonights",
            "the",
            "night",
            "[sep]",
            "http://dbpedia.org/resource/take_me_there_(blackstreet_&_m\u00fda_song)",
            "http://dbpedia.org/resource/tonight's_the_night_(blackstreet_song)",
            "[sep]",
            "http://dbpedia.org/ontology/musicalband",
            "http://dbpedia.org/ontology/musicalband"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)",
            "http://dbpedia.org/resource/Tonight's_the_Night_(Blackstreet_song)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/musicalBand",
            "http://dbpedia.org/ontology/musicalBand"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] [UNK] [UNK] <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] [UNK] [UNK] <predpos@@2> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 999,
        "question": [
            "stockholm",
            "is",
            "the",
            "hq",
            "of",
            "how",
            "many",
            "things",
            "[sep]",
            "http://dbpedia.org/resource/stockholm",
            "[sep]",
            "http://dbpedia.org/property/headquarters"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Stockholm"
        ],
        "goldrels": [
            "http://dbpedia.org/property/headquarters"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 3174,
        "question": [
            "which",
            "movies",
            "did",
            "mark",
            "steven",
            "edit",
            "[sep]",
            "http://dbpedia.org/resource/mark_stevens_(film_editor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/editing",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mark_Stevens_(film_editor)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/editing",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 545,
        "question": [
            "does",
            "lousana",
            "lie",
            "at",
            "the",
            "end",
            "of",
            "alberta",
            "highway",
            "42",
            "[sep]",
            "http://dbpedia.org/resource/alberta_highway_42",
            "http://dbpedia.org/resource/lousana",
            "[sep]",
            "http://dbpedia.org/ontology/routeend"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Alberta_Highway_42",
            "http://dbpedia.org/resource/Lousana"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/routeEnd"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  .  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 1718,
        "question": [
            "which",
            "writer",
            "of",
            "a",
            "literary",
            "nightmare",
            "also",
            "extended",
            "the",
            "work",
            "of",
            "the",
            "apple",
            "tree",
            "[sep]",
            "http://dbpedia.org/resource/the_apple_tree",
            "http://dbpedia.org/resource/a_literary_nightmare",
            "[sep]",
            "http://dbpedia.org/ontology/basedon",
            "http://dbpedia.org/ontology/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Apple_Tree",
            "http://dbpedia.org/resource/A_Literary_Nightmare"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/basedOn",
            "http://dbpedia.org/ontology/author"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] [UNK] [UNK] <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1207,
        "question": [
            "list",
            "the",
            "home",
            "town",
            "of",
            "the",
            "people",
            "who",
            "have",
            "ontario",
            "as",
            "one",
            "of",
            "it",
            "[sep]",
            "http://dbpedia.org/resource/ontario",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/hometown",
            "http://dbpedia.org/property/hometown",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ontario",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/homeTown",
            "http://dbpedia.org/property/homeTown",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 . ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 762,
        "question": [
            "whose",
            "leaders",
            "are",
            "willemalexander",
            "and",
            "fredis",
            "refunjol",
            "[sep]",
            "http://dbpedia.org/resource/willem-alexander_of_the_netherlands",
            "http://dbpedia.org/resource/fredis_refunjol",
            "[sep]",
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands",
            "http://dbpedia.org/resource/Fredis_Refunjol"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/leader",
            "http://dbpedia.org/ontology/leader"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> } }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1092,
        "question": [
            "how",
            "many",
            "venues",
            "are",
            "located",
            "in",
            "the",
            "us",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/address",
            "http://dbpedia.org/ontology/venue"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/address",
            "http://dbpedia.org/ontology/Venue"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "exact_match": "match"
    }
]