[
    {
        "uid": 395,
        "question": [
            "how",
            "many",
            "scientists",
            "are",
            "known",
            "for",
            "the",
            "manhatten",
            "project",
            "[sep]",
            "http://dbpedia.org/resource/manhattan_project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/knownfor",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Manhattan_Project",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/knownFor",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 501,
        "question": [
            "which",
            "wars",
            "were",
            "fought",
            "by",
            "the",
            "commander",
            "whose",
            "deputy",
            "was",
            "robert",
            "t",
            "herres",
            "[sep]",
            "http://dbpedia.org/resource/robert_t._herres",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deputy",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/militaryconflict"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Robert_T._Herres",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deputy",
            "http://dbpedia.org/ontology/commander",
            "http://dbpedia.org/ontology/MilitaryConflict"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1494,
        "question": [
            "what",
            "religion",
            "is",
            "followed",
            "by",
            "the",
            "commander",
            "of",
            "defense",
            "security",
            "command",
            "[sep]",
            "http://dbpedia.org/resource/defense_security_command",
            "[sep]",
            "http://dbpedia.org/ontology/notablecommander",
            "http://dbpedia.org/ontology/religion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Defense_Security_Command"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/notableCommander",
            "http://dbpedia.org/ontology/religion"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2567,
        "question": [
            "what",
            "shows",
            "used",
            "to",
            "air",
            "on",
            "the",
            "channel",
            "which",
            "was",
            "earlier",
            "known",
            "as",
            "the",
            "comedy",
            "central",
            "[sep]",
            "http://dbpedia.org/resource/the_comedy_channel_(united_states)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Comedy_Channel_(United_States)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <entpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <entpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <entpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 1284,
        "question": [
            "did",
            "chris",
            "lebenzon",
            "edit",
            "batman",
            "returns",
            "[sep]",
            "http://dbpedia.org/resource/batman_returns",
            "http://dbpedia.org/resource/chris_lebenzon",
            "[sep]",
            "http://dbpedia.org/property/editing"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Batman_Returns",
            "http://dbpedia.org/resource/Chris_Lebenzon"
        ],
        "goldrels": [
            "http://dbpedia.org/property/editing"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] [UNK] [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 1852,
        "question": [
            "is",
            "the",
            "song",
            "killing",
            "is",
            "out",
            "school",
            "is",
            "in",
            "belong",
            "in",
            "the",
            "the",
            "next",
            "step",
            "[sep]",
            "http://dbpedia.org/resource/killing_is_out,_school_is_in",
            "http://dbpedia.org/resource/the_next_step_(james_brown_album)",
            "[sep]",
            "http://dbpedia.org/property/album"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Killing_Is_Out,_School_Is_In",
            "http://dbpedia.org/resource/The_Next_Step_(James_Brown_album)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/album"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> .",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 998,
        "question": [
            "how",
            "many",
            "people",
            "won",
            "the",
            "gold",
            "medal",
            "of",
            "the",
            "royal",
            "astronomical",
            "society",
            "[sep]",
            "http://dbpedia.org/resource/gold_medal_of_the_royal_astronomical_society",
            "[sep]",
            "http://dbpedia.org/property/prizes"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gold_Medal_of_the_Royal_Astronomical_Society"
        ],
        "goldrels": [
            "http://dbpedia.org/property/prizes"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . .",
        "exact_match": "match"
    },
    {
        "uid": 2141,
        "question": [
            "name",
            "the",
            "tv",
            "series",
            "produced",
            "by",
            "stephen",
            "ambrose",
            "and",
            "erik",
            "bork",
            "[sep]",
            "http://dbpedia.org/resource/stephen_e._ambrose",
            "http://dbpedia.org/resource/erik_bork",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Stephen_E._Ambrose",
            "http://dbpedia.org/resource/Erik_Bork",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 413,
        "question": [
            "how",
            "many",
            "railway",
            "lines",
            "go",
            "through",
            "the",
            "station",
            "maintained",
            "by",
            "public",
            "transport",
            "authority",
            "of",
            "western",
            "australia",
            "[sep]",
            "http://dbpedia.org/resource/public_transport_authority_(western_australia)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/owningorganisation",
            "http://dbpedia.org/ontology/servingrailwayline",
            "http://dbpedia.org/ontology/railwayline"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Public_Transport_Authority_(Western_Australia)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owningOrganisation",
            "http://dbpedia.org/ontology/servingRailwayLine",
            "http://dbpedia.org/ontology/RailwayLine"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3> <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2736,
        "question": [
            "list",
            "the",
            "school",
            "of",
            "bobby",
            "skinstad",
            "[sep]",
            "http://dbpedia.org/resource/bobby_skinstad",
            "[sep]",
            "http://dbpedia.org/ontology/school"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bobby_Skinstad"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/school"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] }",
        "answer_3": "select distinct ?vr0 where { <predpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1032,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "region",
            "of",
            "anfsq7",
            "combat",
            "direction",
            "central",
            "[sep]",
            "http://dbpedia.org/resource/an/fsq-7_combat_direction_central",
            "[sep]",
            "http://dbpedia.org/ontology/region"
        ],
        "goldents": [
            "http://dbpedia.org/resource/AN/FSQ-7_Combat_Direction_Central"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/region"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 745,
        "question": [
            "ernest",
            "rutherford",
            "was",
            "the",
            "advisor",
            "of",
            "how",
            "many",
            "people",
            "[sep]",
            "http://dbpedia.org/resource/ernest_rutherford",
            "[sep]",
            "http://dbpedia.org/property/doctoraladvisor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ernest_Rutherford"
        ],
        "goldrels": [
            "http://dbpedia.org/property/doctoralAdvisor"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] . }",
        "exact_match": "match"
    },
    {
        "uid": 23,
        "question": [
            "how",
            "many",
            "services",
            "does",
            "21vianet",
            "provide",
            "[sep]",
            "http://dbpedia.org/resource/21vianet",
            "[sep]",
            "http://dbpedia.org/property/services"
        ],
        "goldents": [
            "http://dbpedia.org/resource/21Vianet"
        ],
        "goldrels": [
            "http://dbpedia.org/property/services"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ( where ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1671,
        "question": [
            "what",
            "tv",
            "shows",
            "were",
            "born",
            "out",
            "of",
            "a",
            "collaboration",
            "of",
            "playtone",
            "and",
            "dreamworks",
            "[sep]",
            "http://dbpedia.org/resource/playtone",
            "http://dbpedia.org/resource/dreamworks_television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Playtone",
            "http://dbpedia.org/resource/DreamWorks_Television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1930,
        "question": [
            "where",
            "is",
            "the",
            "mouth",
            "of",
            "the",
            "river",
            "whose",
            "tributary",
            "is",
            "bjelimika",
            "rijeka",
            "[sep]",
            "http://dbpedia.org/resource/bjelimi\u0107ka_rijeka",
            "[sep]",
            "http://dbpedia.org/ontology/righttributary",
            "http://dbpedia.org/ontology/mouthcountry"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/rightTributary",
            "http://dbpedia.org/ontology/mouthCountry"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 112,
        "question": [
            "how",
            "many",
            "rivers",
            "are",
            "crossed",
            "by",
            "different",
            "box",
            "girder",
            "bridges",
            "[sep]",
            "http://dbpedia.org/resource/box_girder_bridge",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/design",
            "http://dbpedia.org/property/crosses",
            "http://dbpedia.org/ontology/river"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Box_girder_bridge",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/design",
            "http://dbpedia.org/property/crosses",
            "http://dbpedia.org/ontology/River"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . . <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 618,
        "question": [
            "give",
            "me",
            "some",
            "organizations",
            "working",
            "for",
            "environmentalism",
            "[sep]",
            "http://dbpedia.org/resource/environmentalism",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/purpose",
            "http://dbpedia.org/ontology/organisation"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Environmentalism",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/purpose",
            "http://dbpedia.org/ontology/Organisation"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> } }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 557,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "participant",
            "in",
            "conflict",
            "of",
            "sfor",
            "[sep]",
            "http://dbpedia.org/resource/sfor",
            "[sep]",
            "http://dbpedia.org/property/battles",
            "http://dbpedia.org/ontology/battle"
        ],
        "goldents": [
            "http://dbpedia.org/resource/SFOR"
        ],
        "goldrels": [
            "http://dbpedia.org/property/battles",
            "http://dbpedia.org/ontology/battle"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 1501,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "airlines",
            "whose",
            "hub",
            "airport",
            "is",
            "los",
            "angeles",
            "international",
            "airport",
            "[sep]",
            "http://dbpedia.org/resource/los_angeles_international_airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/hubairport",
            "http://dbpedia.org/ontology/airline"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Los_Angeles_International_Airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/hubAirport",
            "http://dbpedia.org/ontology/Airline"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> ?vr0 <predpos@@1> <entpos@@2> <predpos@@2> .",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@2> . ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 1572,
        "question": [
            "count",
            "all",
            "the",
            "universities",
            "who",
            "participated",
            "in",
            "the",
            "tournament",
            "won",
            "by",
            "alabama",
            "crimson",
            "tides",
            "in",
            "2015",
            "[sep]",
            "http://dbpedia.org/resource/2015_alabama_crimson_tide_football_team",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/champion",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/champion",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1432,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "important",
            "works",
            "done",
            "by",
            "the",
            "writers",
            "of",
            "the",
            "second",
            "coming",
            "[sep]",
            "http://dbpedia.org/resource/the_second_coming_(tv_serial)",
            "[sep]",
            "http://dbpedia.org/ontology/author",
            "http://dbpedia.org/ontology/notablework"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Second_Coming_(TV_serial)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/author",
            "http://dbpedia.org/ontology/notableWork"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 792,
        "question": [
            "name",
            "the",
            "alma",
            "mater",
            "of",
            "ernest",
            "de",
            "saisset",
            "[sep]",
            "http://dbpedia.org/resource/ernest_de_saisset",
            "[sep]",
            "http://dbpedia.org/ontology/almamater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ernest_de_Saisset"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/almaMater"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] ( . }",
        "exact_match": "match"
    }
]