[
    {
        "uid": 273,
        "question": [
            "how",
            "many",
            "movies",
            "did",
            "joel",
            "schumacher",
            "direct",
            "[sep]",
            "http://dbpedia.org/resource/joel_schumacher",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Joel_Schumacher",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/director",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <entpos@@2> . . <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2670,
        "question": [
            "titus",
            "software",
            "publishes",
            "which",
            "genre",
            "of",
            "games",
            "[sep]",
            "http://dbpedia.org/resource/titus_software",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/genre",
            "http://dbpedia.org/ontology/videogame"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Titus_Software",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/publisher",
            "http://dbpedia.org/ontology/genre",
            "http://dbpedia.org/ontology/VideoGame"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <predpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 632,
        "question": [
            "how",
            "many",
            "shows",
            "belong",
            "to",
            "the",
            "networks",
            "one",
            "of",
            "whose",
            "sister",
            "station",
            "is",
            "bbc",
            "news",
            "[sep]",
            "http://dbpedia.org/resource/bbc_news_(tv_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/sisternames",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/BBC_News_(TV_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/sisterNames",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1500,
        "question": [
            "how",
            "many",
            "movies",
            "were",
            "cinematographed",
            "by",
            "jordan",
            "cronenweth",
            "[sep]",
            "http://dbpedia.org/resource/jordan_cronenweth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jordan_Cronenweth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 <predpos@@2> . <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1601,
        "question": [
            "how",
            "many",
            "important",
            "works",
            "have",
            "been",
            "done",
            "by",
            "russel",
            "davies",
            "[sep]",
            "http://dbpedia.org/resource/russell_t_davies",
            "[sep]",
            "http://dbpedia.org/ontology/notablework"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Russell_T_Davies"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/notableWork"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 } }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> } ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 755,
        "question": [
            "list",
            "the",
            "total",
            "number",
            "of",
            "regions",
            "of",
            "the",
            "building",
            "whose",
            "are",
            "located",
            "ingrand",
            "forks",
            "air",
            "force",
            "base",
            "[sep]",
            "http://dbpedia.org/resource/grand_forks_air_force_base",
            "[sep]",
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/region"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Grand_Forks_Air_Force_Base"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/region",
            "http://dbpedia.org/ontology/region"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 650,
        "question": [
            "which",
            "persons",
            "successor",
            "is",
            "samsuiluna",
            "[sep]",
            "http://dbpedia.org/resource/samsu-iluna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Samsu-iluna",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/successor",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1332,
        "question": [
            "which",
            "company",
            "owns",
            "sony",
            "bank",
            "[sep]",
            "http://dbpedia.org/resource/sony_bank",
            "[sep]",
            "http://dbpedia.org/ontology/owningcompany"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sony_Bank"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/owningCompany"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] <predpos@@1> }",
        "answer_3": "select distinct ?vr0 ( { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2776,
        "question": [
            "list",
            "the",
            "things",
            "for",
            "which",
            "the",
            "relatives",
            "of",
            "mrunalini",
            "kunte",
            "are",
            "known",
            "[sep]",
            "http://dbpedia.org/resource/mrunalini_kunte",
            "[sep]",
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/knownfor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mrunalini_Kunte"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/relative",
            "http://dbpedia.org/ontology/knownFor"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 1080,
        "question": [
            "who",
            "is",
            "the",
            "authority",
            "of",
            "maine",
            "school",
            "of",
            "science",
            "and",
            "mathematics",
            "[sep]",
            "http://dbpedia.org/resource/maine_school_of_science_and_mathematics",
            "[sep]",
            "http://dbpedia.org/ontology/authority"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Maine_School_of_Science_and_Mathematics"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/authority"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { [UNK] <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 2873,
        "question": [
            "what",
            "is",
            "the",
            "alma",
            "mater",
            "of",
            "the",
            "scientist",
            "whose",
            "phd",
            "advisor",
            "is",
            "jeanclaude",
            "latombe",
            "[sep]",
            "http://dbpedia.org/resource/jean-claude_latombe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/doctoraladvisor",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jean-Claude_Latombe",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralAdvisor",
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 384,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "mammals",
            "whose",
            "family",
            "is",
            "canidae",
            "[sep]",
            "http://dbpedia.org/resource/canidae",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/mammal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Canidae",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/Mammal"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . .",
        "exact_match": "match"
    },
    {
        "uid": 3213,
        "question": [
            "where",
            "did",
            "the",
            "partner",
            "of",
            "teriitaria",
            "ii",
            "die",
            "[sep]",
            "http://dbpedia.org/resource/teriitaria_ii",
            "[sep]",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/deathplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Teriitaria_II"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/deathPlace"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 1734,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "politicians",
            "whose",
            "predecessors",
            "deputy",
            "is",
            "jenny",
            "macklin",
            "[sep]",
            "http://dbpedia.org/resource/jenny_macklin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/deputy",
            "http://dbpedia.org/property/predecessor",
            "http://dbpedia.org/ontology/officeholder"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jenny_Macklin",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/deputy",
            "http://dbpedia.org/property/predecessor",
            "http://dbpedia.org/ontology/OfficeHolder"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 475,
        "question": [
            "how",
            "many",
            "local",
            "authorities",
            "manage",
            "mixed",
            "gender",
            "schools",
            "[sep]",
            "http://dbpedia.org/resource/mixed-sex_education",
            "[sep]",
            "http://dbpedia.org/ontology/gender",
            "http://dbpedia.org/ontology/localauthority"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mixed-sex_education"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/gender",
            "http://dbpedia.org/ontology/localAuthority"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] ( ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 143,
        "question": [
            "how",
            "many",
            "currencies",
            "are",
            "in",
            "used",
            "in",
            "places",
            "where",
            "people",
            "speak",
            "french",
            "[sep]",
            "http://dbpedia.org/resource/french_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/officiallanguage",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/French_language",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/officialLanguage",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/Currency"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> } }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr1 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 3041,
        "question": [
            "what",
            "is",
            "the",
            "place",
            "where",
            "the",
            "mayors",
            "wife",
            "is",
            "jeanmarc",
            "germain",
            "[sep]",
            "http://dbpedia.org/resource/jean-marc_germain",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/mayor",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jean-Marc_Germain",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/mayor",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2238,
        "question": [
            "how",
            "many",
            "apes",
            "are",
            "there",
            "[sep]",
            "http://dbpedia.org/resource/ape",
            "[sep]",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ape"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 2309,
        "question": [
            "how",
            "many",
            "ingedients",
            "are",
            "required",
            "to",
            "make",
            "the",
            "ragout",
            "fin",
            "[sep]",
            "http://dbpedia.org/resource/ragout_fin",
            "[sep]",
            "http://dbpedia.org/ontology/ingredient"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ragout_fin"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/ingredient"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <predpos@@1> <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2486,
        "question": [
            "name",
            "someone",
            "known",
            "for",
            "a",
            "project",
            "involved",
            "in",
            "the",
            "occupation",
            "of",
            "japan",
            "[sep]",
            "http://dbpedia.org/resource/occupation_of_japan",
            "[sep]",
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/knownfor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Occupation_of_Japan"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/knownFor"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 522,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "bacterias",
            "which",
            "belongs",
            "to",
            "bacilli",
            "class",
            "[sep]",
            "http://dbpedia.org/resource/bacilli",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/class",
            "http://dbpedia.org/ontology/bacteria"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacilli",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/class",
            "http://dbpedia.org/ontology/Bacteria"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2526,
        "question": [
            "list",
            "the",
            "software",
            "using",
            "c",
            "as",
            "programming",
            "language",
            "and",
            "licence",
            "is",
            "software",
            "as",
            "a",
            "service",
            "[sep]",
            "http://dbpedia.org/resource/c++",
            "http://dbpedia.org/resource/software_as_a_service",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/programminglanguage",
            "http://dbpedia.org/ontology/license",
            "http://dbpedia.org/ontology/software"
        ],
        "goldents": [
            "http://dbpedia.org/resource/C++",
            "http://dbpedia.org/resource/Software_as_a_service",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/programmingLanguage",
            "http://dbpedia.org/ontology/license",
            "http://dbpedia.org/ontology/Software"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } }",
        "exact_match": "match"
    }
]