[
    {
        "uid": 2788,
        "question": [
            "who",
            "was",
            "the",
            "animator",
            "of",
            "both",
            "tommy",
            "tuckers",
            "tooth",
            "and",
            "skeleton",
            "dance",
            "[sep]",
            "http://dbpedia.org/resource/tommy_tucker's_tooth",
            "http://dbpedia.org/resource/the_skeleton_dance",
            "[sep]",
            "http://dbpedia.org/ontology/animator",
            "http://dbpedia.org/ontology/animator"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Tommy_Tucker's_Tooth",
            "http://dbpedia.org/resource/The_Skeleton_Dance"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/animator",
            "http://dbpedia.org/ontology/animator"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1504,
        "question": [
            "how",
            "many",
            "members",
            "are",
            "there",
            "in",
            "the",
            "european",
            "go",
            "federation",
            "[sep]",
            "http://dbpedia.org/resource/european_go_federation",
            "[sep]",
            "http://dbpedia.org/property/membership"
        ],
        "goldents": [
            "http://dbpedia.org/resource/European_Go_Federation"
        ],
        "goldrels": [
            "http://dbpedia.org/property/membership"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] where <entpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 1319,
        "question": [
            "which",
            "operator",
            "of",
            "ganz",
            "uv",
            "is",
            "also",
            "the",
            "nationality",
            "of",
            "the",
            "gza",
            "horvth",
            "[sep]",
            "http://dbpedia.org/resource/ganz_uv",
            "http://dbpedia.org/resource/g\u00e9za_horv\u00e1th",
            "[sep]",
            "http://dbpedia.org/ontology/operator",
            "http://dbpedia.org/ontology/nationality"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ganz_UV",
            "http://dbpedia.org/resource/G\u00e9za_Horv\u00e1th"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/operator",
            "http://dbpedia.org/ontology/nationality"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 236,
        "question": [
            "how",
            "many",
            "mammals",
            "are",
            "in",
            "the",
            "chordate",
            "phylum",
            "[sep]",
            "http://dbpedia.org/resource/chordate",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/phylum",
            "http://dbpedia.org/ontology/mammal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Chordate",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/phylum",
            "http://dbpedia.org/ontology/Mammal"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1002,
        "question": [
            "what",
            "is",
            "the",
            "state",
            "of",
            "origin",
            "of",
            "abbas",
            "jafri",
            "[sep]",
            "http://dbpedia.org/resource/abbas_jafri",
            "[sep]",
            "http://dbpedia.org/ontology/stateoforigin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Abbas_Jafri"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/stateOfOrigin"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] <entpos@@1> [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 2428,
        "question": [
            "which",
            "magazines",
            "editor",
            "is",
            "married",
            "to",
            "crystal",
            "harris",
            "[sep]",
            "http://dbpedia.org/resource/crystal_harris",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/editor",
            "http://dbpedia.org/ontology/magazine"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Crystal_Harris",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/spouse",
            "http://dbpedia.org/ontology/editor",
            "http://dbpedia.org/ontology/Magazine"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> } }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 2154,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "software",
            "whose",
            "programming",
            "language",
            "is",
            "c",
            "and",
            "operating",
            "system",
            "is",
            "microsoft",
            "windows",
            "[sep]",
            "http://dbpedia.org/resource/c++",
            "http://dbpedia.org/resource/microsoft_windows",
            "[sep]",
            "http://dbpedia.org/ontology/programminglanguage",
            "http://dbpedia.org/ontology/operatingsystem"
        ],
        "goldents": [
            "http://dbpedia.org/resource/C++",
            "http://dbpedia.org/resource/Microsoft_Windows"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/programmingLanguage",
            "http://dbpedia.org/ontology/operatingSystem"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 589,
        "question": [
            "what",
            "softwares",
            "were",
            "created",
            "by",
            "apple",
            "productivity",
            "experience",
            "group",
            "[sep]",
            "http://dbpedia.org/resource/apple_productivity_experience_group",
            "[sep]",
            "http://dbpedia.org/ontology/product"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Apple_Productivity_Experience_Group"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/product"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { [UNK] where [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 604,
        "question": [
            "list",
            "down",
            "the",
            "commanders",
            "of",
            "battle",
            "of",
            "fort",
            "stephenson",
            "[sep]",
            "http://dbpedia.org/resource/battle_of_fort_stephenson",
            "[sep]",
            "http://dbpedia.org/ontology/commander"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Battle_of_Fort_Stephenson"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/commander"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2717,
        "question": [
            "list",
            "down",
            "the",
            "common",
            "sports",
            "played",
            "by",
            "patts",
            "college",
            "of",
            "aeronautics",
            "and",
            "lytechnic",
            "university",
            "of",
            "the",
            "philippines",
            "taguig",
            "[sep]",
            "http://dbpedia.org/resource/patts_college_of_aeronautics",
            "http://dbpedia.org/resource/polytechnic_university_of_the_philippines_taguig",
            "[sep]",
            "http://dbpedia.org/ontology/athletics",
            "http://dbpedia.org/ontology/sport"
        ],
        "goldents": [
            "http://dbpedia.org/resource/PATTS_College_of_Aeronautics",
            "http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/athletics",
            "http://dbpedia.org/ontology/sport"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1936,
        "question": [
            "which",
            "settelment",
            "area",
            "is",
            "the",
            "home",
            "town",
            "of",
            "the",
            "danny",
            "felice",
            "and",
            "cline",
            "buckens",
            "[sep]",
            "http://dbpedia.org/resource/danny_felice",
            "http://dbpedia.org/resource/c\u00e9line_buckens",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/settlement"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Danny_Felice",
            "http://dbpedia.org/resource/C\u00e9line_Buckens",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/Settlement"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } }",
        "exact_match": "no match"
    },
    {
        "uid": 219,
        "question": [
            "for",
            "how",
            "many",
            "other",
            "teams",
            "have",
            "the",
            "former",
            "players",
            "of",
            "boston",
            "bruins",
            "played",
            "[sep]",
            "http://dbpedia.org/resource/boston_bruins",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/property/playedfor",
            "http://dbpedia.org/ontology/sportsteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Boston_Bruins",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/property/playedFor",
            "http://dbpedia.org/ontology/SportsTeam"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2882,
        "question": [
            "what",
            "is",
            "the",
            "deathplace",
            "of",
            "the",
            "anatoly",
            "kharlampiyev",
            "which",
            "is",
            "also",
            "the",
            "death",
            "place",
            "of",
            "lyudmila",
            "buldakova",
            "[sep]",
            "http://dbpedia.org/resource/anatoly_kharlampiyev",
            "http://dbpedia.org/resource/lyudmila_buldakova",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/deathplace"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Anatoly_Kharlampiyev",
            "http://dbpedia.org/resource/Lyudmila_Buldakova"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/deathPlace"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1230,
        "question": [
            "in",
            "which",
            "mountain",
            "range",
            "does",
            "the",
            "rochers",
            "de",
            "naye",
            "lie",
            "[sep]",
            "http://dbpedia.org/resource/rochers_de_naye",
            "[sep]",
            "http://dbpedia.org/ontology/parentmountainpeak",
            "http://dbpedia.org/ontology/mountainrange"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Rochers_de_Naye"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/parentMountainPeak",
            "http://dbpedia.org/ontology/mountainRange"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 657,
        "question": [
            "what",
            "is",
            "the",
            "local",
            "authority",
            "of",
            "liverpool",
            "institute",
            "high",
            "school",
            "for",
            "boys",
            "[sep]",
            "http://dbpedia.org/resource/liverpool_institute_high_school_for_boys",
            "[sep]",
            "http://dbpedia.org/ontology/localauthority"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Liverpool_Institute_High_School_for_Boys"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/localAuthority"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( } }",
        "exact_match": "match"
    },
    {
        "uid": 2190,
        "question": [
            "who",
            "is",
            "the",
            "appointer",
            "of",
            "charles",
            "goodell",
            "[sep]",
            "http://dbpedia.org/resource/charles_goodell",
            "[sep]",
            "http://dbpedia.org/ontology/appointer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Charles_Goodell"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/appointer"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] <entpos@@1> } }",
        "exact_match": "match"
    },
    {
        "uid": 1544,
        "question": [
            "what",
            "is",
            "the",
            "academic",
            "discipline",
            "of",
            "journal",
            "of",
            "cerebral",
            "blood",
            "flow",
            "metabolism",
            "[sep]",
            "http://dbpedia.org/resource/journal_of_cerebral_blood_flow_&_metabolism",
            "[sep]",
            "http://dbpedia.org/ontology/academicdiscipline"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Journal_of_Cerebral_Blood_Flow_&_Metabolism"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/academicDiscipline"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select select ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 3078,
        "question": [
            "what",
            "is",
            "the",
            "address",
            "of",
            "federal",
            "reserve",
            "bank",
            "building",
            "[sep]",
            "http://dbpedia.org/resource/federal_reserve_bank_building_(seattle)",
            "[sep]",
            "http://dbpedia.org/ontology/address"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Federal_Reserve_Bank_Building_(Seattle)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/address"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "ask distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] } }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 872,
        "question": [
            "was",
            "david",
            "gilmour",
            "a",
            "former",
            "member",
            "of",
            "pink",
            "floyd",
            "[sep]",
            "http://dbpedia.org/resource/pink_floyd",
            "http://dbpedia.org/resource/david_gilmour",
            "[sep]",
            "http://dbpedia.org/ontology/formerbandmember"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Pink_Floyd",
            "http://dbpedia.org/resource/David_Gilmour"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerBandMember"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] ( <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 760,
        "question": [
            "which",
            "is",
            "the",
            "city",
            "closest",
            "to",
            "both",
            "the",
            "lodaiska",
            "site",
            "and",
            "the",
            "home",
            "of",
            "david",
            "w",
            "brown",
            "[sep]",
            "http://dbpedia.org/resource/lodaiska_site",
            "http://dbpedia.org/resource/david_w._brown_house",
            "[sep]",
            "http://dbpedia.org/ontology/nearestcity",
            "http://dbpedia.org/ontology/nearestcity"
        ],
        "goldents": [
            "http://dbpedia.org/resource/LoDaisKa_Site",
            "http://dbpedia.org/resource/David_W._Brown_House"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nearestCity",
            "http://dbpedia.org/ontology/nearestCity"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2019,
        "question": [
            "which",
            "famous",
            "physicist",
            "was",
            "academically",
            "advised",
            "by",
            "benjamin",
            "pulleyn",
            "[sep]",
            "http://dbpedia.org/resource/benjamin_pulleyn",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/academicadvisor",
            "http://dbpedia.org/ontology/scientist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Benjamin_Pulleyn",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/academicAdvisor",
            "http://dbpedia.org/ontology/Scientist"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1008,
        "question": [
            "which",
            "universitys",
            "graduates",
            "have",
            "worked",
            "in",
            "the",
            "quartermaster",
            "corps",
            "[sep]",
            "http://dbpedia.org/resource/quartermaster_corps_(united_states_army)",
            "[sep]",
            "http://dbpedia.org/ontology/militaryunit",
            "http://dbpedia.org/ontology/almamater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Quartermaster_Corps_(United_States_Army)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryUnit",
            "http://dbpedia.org/ontology/almaMater"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "no match"
    },
    {
        "uid": 1737,
        "question": [
            "how",
            "many",
            "bands",
            "have",
            "members",
            "currently",
            "playing",
            "the",
            "fender",
            "stratocaster",
            "[sep]",
            "http://dbpedia.org/resource/fender_stratocaster",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/notableinstruments",
            "http://dbpedia.org/property/currentmembers",
            "http://dbpedia.org/ontology/band"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fender_Stratocaster",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/notableInstruments",
            "http://dbpedia.org/property/currentMembers",
            "http://dbpedia.org/ontology/Band"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> . }",
        "exact_match": "no match"
    }
]