[
    {
        "uid": 1219,
        "question": [
            "who",
            "is",
            "the",
            "person",
            "whose",
            "alma",
            "mater",
            "is",
            "harvardwestlake",
            "school",
            "[sep]",
            "http://dbpedia.org/resource/harvard-westlake_school",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Harvard-Westlake_School",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@1> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] <predpos@@1> ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1686,
        "question": [
            "how",
            "many",
            "movies",
            "are",
            "directed",
            "by",
            "the",
            "spouse",
            "of",
            "dolores",
            "del",
            "ro",
            "[sep]",
            "http://dbpedia.org/resource/dolores_del_r\u00edo",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/partner",
            "http://dbpedia.org/property/director",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Dolores_del_R\u00edo",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/partner",
            "http://dbpedia.org/property/director",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1092,
        "question": [
            "how",
            "many",
            "venues",
            "are",
            "located",
            "in",
            "the",
            "us",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/address",
            "http://dbpedia.org/ontology/venue"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/address",
            "http://dbpedia.org/ontology/Venue"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 2684,
        "question": [
            "what",
            "is",
            "the",
            "television",
            "show",
            "which",
            "has",
            "cast",
            "member",
            "as",
            "jason",
            "carter",
            "and",
            "network",
            "is",
            "tnt",
            "tv",
            "channel",
            "[sep]",
            "http://dbpedia.org/resource/jason_carter_(actor)",
            "http://dbpedia.org/resource/tnt_(tv_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jason_Carter_(actor)",
            "http://dbpedia.org/resource/TNT_(TV_channel)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] ( [UNK] <entpos@@3> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 2601,
        "question": [
            "who",
            "penned",
            "emma",
            "and",
            "jane",
            "austen",
            "in",
            "manhatten",
            "[sep]",
            "http://dbpedia.org/resource/jane_austen_in_manhattan",
            "http://dbpedia.org/resource/emma_(novel)",
            "[sep]",
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jane_Austen_in_Manhattan",
            "http://dbpedia.org/resource/Emma_(novel)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/author"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . [UNK] ( [UNK] <predpos@@2> ?vr0",
        "exact_match": "no match"
    },
    {
        "uid": 2081,
        "question": [
            "give",
            "me",
            "all",
            "magazines",
            "whose",
            "founder",
            "died",
            "in",
            "berkeley",
            "california",
            "[sep]",
            "http://dbpedia.org/resource/berkeley,_california",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/magazine"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Berkeley,_California",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/Magazine"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 220,
        "question": [
            "count",
            "the",
            "different",
            "origins",
            "of",
            "members",
            "of",
            "the",
            "vitis",
            "vinifera",
            "species",
            "[sep]",
            "http://dbpedia.org/resource/vitis_vinifera",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/species",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Vitis_vinifera",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/species",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 . <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 551,
        "question": [
            "what",
            "disease",
            "led",
            "to",
            "the",
            "demise",
            "of",
            "letitia",
            "mactavish",
            "hargrave",
            "and",
            "martino",
            "martini",
            "[sep]",
            "http://dbpedia.org/resource/letitia_mactavish_hargrave",
            "http://dbpedia.org/resource/martino_martini",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathcause",
            "http://dbpedia.org/ontology/deathcause",
            "http://dbpedia.org/ontology/disease"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Letitia_MacTavish_Hargrave",
            "http://dbpedia.org/resource/Martino_Martini",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathCause",
            "http://dbpedia.org/ontology/deathCause",
            "http://dbpedia.org/ontology/Disease"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( ( . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] ( [UNK] <entpos@@3> . <entpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] ( [UNK] . ?vr0 <entpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 976,
        "question": [
            "how",
            "many",
            "players",
            "debuted",
            "their",
            "careers",
            "from",
            "san",
            "francisco",
            "49ers",
            "[sep]",
            "http://dbpedia.org/resource/san_francisco_49ers",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/debutteam",
            "http://dbpedia.org/ontology/athlete"
        ],
        "goldents": [
            "http://dbpedia.org/resource/San_Francisco_49ers",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/debutTeam",
            "http://dbpedia.org/ontology/Athlete"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 319,
        "question": [
            "how",
            "many",
            "teams",
            "have",
            "used",
            "the",
            "stadium",
            "which",
            "hosted",
            "the",
            "wcw",
            "mayhem",
            "[sep]",
            "http://dbpedia.org/resource/wcw_mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/stadium"
        ],
        "goldents": [
            "http://dbpedia.org/resource/WCW_Mayhem",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/venue",
            "http://dbpedia.org/ontology/tenant",
            "http://dbpedia.org/ontology/Stadium"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 3113,
        "question": [
            "list",
            "the",
            "people",
            "residing",
            "in",
            "wilton",
            "connecticut",
            "[sep]",
            "http://dbpedia.org/resource/wilton,_connecticut",
            "[sep]",
            "http://dbpedia.org/ontology/residence"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Wilton,_Connecticut"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/residence"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 1033,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "the",
            "services",
            "by",
            "the",
            "company",
            "which",
            "provides",
            "data",
            "center",
            "as",
            "the",
            "services",
            "[sep]",
            "http://dbpedia.org/resource/data_center_services",
            "[sep]",
            "http://dbpedia.org/property/services",
            "http://dbpedia.org/property/services"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Data_center_services"
        ],
        "goldrels": [
            "http://dbpedia.org/property/services",
            "http://dbpedia.org/property/services"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 525,
        "question": [
            "how",
            "many",
            "players",
            "participated",
            "in",
            "the",
            "200405",
            "fc",
            "barcelona",
            "season",
            "[sep]",
            "http://dbpedia.org/resource/2004\u201305_fc_barcelona_season",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/name",
            "http://dbpedia.org/ontology/soccerplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2004\u201305_FC_Barcelona_season",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/name",
            "http://dbpedia.org/ontology/SoccerPlayer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 2407,
        "question": [
            "what",
            "is",
            "the",
            "scientist",
            "whose",
            "doctoral",
            "students",
            "are",
            "erich",
            "bagge",
            "and",
            "erban",
            "ieica",
            "[sep]",
            "http://dbpedia.org/resource/erich_bagge",
            "http://dbpedia.org/resource/\u0219erban_\u021bi\u021beica",
            "[sep]",
            "http://dbpedia.org/ontology/doctoralstudent",
            "http://dbpedia.org/ontology/doctoralstudent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Erich_Bagge",
            "http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/doctoralStudent",
            "http://dbpedia.org/ontology/doctoralStudent"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 [UNK] <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2286,
        "question": [
            "through",
            "which",
            "states",
            "do",
            "the",
            "rivers",
            "flow",
            "which",
            "join",
            "in",
            "the",
            "republican",
            "river",
            "from",
            "the",
            "left",
            "[sep]",
            "http://dbpedia.org/resource/republican_river",
            "[sep]",
            "http://dbpedia.org/ontology/lefttributary",
            "http://dbpedia.org/ontology/state"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Republican_River"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/leftTributary",
            "http://dbpedia.org/ontology/state"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . ?vr1 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 476,
        "question": [
            "what",
            "are",
            "some",
            "apes",
            "[sep]",
            "http://dbpedia.org/resource/ape",
            "[sep]",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ape"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( }",
        "answer_3": "select distinct ?vr0 where { ?vr0 ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 1414,
        "question": [
            "in",
            "which",
            "state",
            "is",
            "the",
            "team",
            "which",
            "has",
            "john",
            "roeslein",
            "[sep]",
            "http://dbpedia.org/resource/john_roeslein",
            "[sep]",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/property/state"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_Roeslein"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/property/state"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 919,
        "question": [
            "how",
            "many",
            "universities",
            "participate",
            "in",
            "the",
            "ncaa",
            "division",
            "i",
            "football",
            "bowl",
            "subdivision",
            "[sep]",
            "http://dbpedia.org/resource/ncaa_division_i_football_bowl_subdivision",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/university"
        ],
        "goldents": [
            "http://dbpedia.org/resource/NCAA_Division_I_Football_Bowl_Subdivision",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/athletics",
            "http://dbpedia.org/ontology/University"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] <entpos@@1> . <entpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1555,
        "question": [
            "was",
            "henry",
            "knox",
            "a",
            "major",
            "general",
            "[sep]",
            "http://dbpedia.org/resource/henry_knox",
            "http://dbpedia.org/resource/major_general_(united_states)",
            "[sep]",
            "http://dbpedia.org/ontology/militaryrank"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Henry_Knox",
            "http://dbpedia.org/resource/Major_general_(United_States)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryRank"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> ( }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@1> }",
        "answer_3": "ask where { <entpos@@1> ( [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 961,
        "question": [
            "how",
            "many",
            "have",
            "been",
            "venerateds",
            "in",
            "islam",
            "and",
            "judaism",
            "[sep]",
            "http://dbpedia.org/resource/islam",
            "http://dbpedia.org/resource/judaism",
            "[sep]",
            "http://dbpedia.org/ontology/veneratedin",
            "http://dbpedia.org/ontology/veneratedin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Islam",
            "http://dbpedia.org/resource/Judaism"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/veneratedIn",
            "http://dbpedia.org/ontology/veneratedIn"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> } }",
        "answer_3": "select distinct where where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1229,
        "question": [
            "count",
            "number",
            "of",
            "people",
            "who",
            "follow",
            "a",
            "religion",
            "which",
            "has",
            "an",
            "important",
            "office",
            "in",
            "gold",
            "base",
            "[sep]",
            "http://dbpedia.org/resource/gold_base",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gold_Base",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/headquarters",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    }
]