[
    {
        "uid": 1364,
        "question": [
            "how",
            "many",
            "albums",
            "did",
            "the",
            "maker",
            "of",
            "the",
            "band",
            "produce",
            "[sep]",
            "http://dbpedia.org/resource/the_band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/artist",
            "http://dbpedia.org/ontology/subsequentwork",
            "http://dbpedia.org/ontology/album"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Band",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/artist",
            "http://dbpedia.org/ontology/subsequentWork",
            "http://dbpedia.org/ontology/Album"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 2159,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "fields",
            "of",
            "the",
            "scientists",
            "whose",
            "one",
            "of",
            "the",
            "fields",
            "is",
            "sanskrit",
            "[sep]",
            "http://dbpedia.org/resource/sanskrit",
            "[sep]",
            "http://dbpedia.org/property/fields",
            "http://dbpedia.org/property/fields"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sanskrit"
        ],
        "goldrels": [
            "http://dbpedia.org/property/fields",
            "http://dbpedia.org/property/fields"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 } ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1807,
        "question": [
            "who",
            "has",
            "military",
            "branches",
            "are",
            "colonial",
            "troops",
            "and",
            "continental",
            "army",
            "[sep]",
            "http://dbpedia.org/resource/colonial_troops",
            "http://dbpedia.org/resource/continental_army",
            "[sep]",
            "http://dbpedia.org/ontology/militarybranch",
            "http://dbpedia.org/ontology/militarybranch"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Colonial_troops",
            "http://dbpedia.org/resource/Continental_Army"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryBranch",
            "http://dbpedia.org/ontology/militaryBranch"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] <predpos@@2> <predpos@@2> } }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> . . }",
        "exact_match": "match"
    },
    {
        "uid": 1196,
        "question": [
            "count",
            "the",
            "movies",
            "directed",
            "by",
            "tim",
            "burton",
            "and",
            "music",
            "composer",
            "danny",
            "elfman",
            "[sep]",
            "http://dbpedia.org/resource/danny_elfman",
            "http://dbpedia.org/resource/tim_burton",
            "[sep]",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/property/director"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Danny_Elfman",
            "http://dbpedia.org/resource/Tim_Burton"
        ],
        "goldrels": [
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/property/director"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( ( ( [UNK] . ?vr0 . <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( ( ( [UNK] . ?vr0 . ?vr1 }",
        "exact_match": "match"
    },
    {
        "uid": 574,
        "question": [
            "how",
            "many",
            "have",
            "former",
            "teams",
            "as",
            "indianapolis",
            "colts",
            "and",
            "carolina",
            "panthers",
            "[sep]",
            "http://dbpedia.org/resource/indianapolis_colts",
            "http://dbpedia.org/resource/carolina_panthers",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/formerteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indianapolis_Colts",
            "http://dbpedia.org/resource/Carolina_Panthers"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/formerTeam"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 }",
        "exact_match": "no match"
    }
]