[
    {
        "uid": 1857,
        "question": [
            "how",
            "many",
            "characters",
            "are",
            "there",
            "in",
            "the",
            "office",
            "[sep]",
            "http://dbpedia.org/resource/the_office_(u.s._tv_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/series",
            "http://dbpedia.org/ontology/fictionalcharacter"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Office_(U.S._TV_series)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/series",
            "http://dbpedia.org/ontology/FictionalCharacter"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <predpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1377,
        "question": [
            "is",
            "anyway",
            "in",
            "the",
            "quack",
            "album",
            "[sep]",
            "http://dbpedia.org/resource/anyway",
            "http://dbpedia.org/resource/quack_(album)",
            "[sep]",
            "http://dbpedia.org/ontology/album"
        ],
        "goldents": [
            "http://dbpedia.org/resource/ANYway",
            "http://dbpedia.org/resource/Quack_(album)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/album"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] [UNK] [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 2858,
        "question": [
            "purnima",
            "banerjee",
            "and",
            "rishang",
            "keishing",
            "are",
            "politicians",
            "of",
            "what",
            "party",
            "[sep]",
            "http://dbpedia.org/resource/rishang_keishing",
            "http://dbpedia.org/resource/purnima_banerjee",
            "[sep]",
            "http://dbpedia.org/ontology/party",
            "http://dbpedia.org/ontology/party"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Rishang_Keishing",
            "http://dbpedia.org/resource/Purnima_Banerjee"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/party",
            "http://dbpedia.org/ontology/party"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 547,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "movies",
            "whose",
            "producer",
            "is",
            "larry",
            "j",
            "franco",
            "[sep]",
            "http://dbpedia.org/resource/larry_j._franco",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Larry_J._Franco",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1729,
        "question": [
            "for",
            "how",
            "many",
            "movies",
            "are",
            "there",
            "whose",
            "musicians",
            "home",
            "town",
            "is",
            "in",
            "volos",
            "[sep]",
            "http://dbpedia.org/resource/volos",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Volos",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/property/music",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1486,
        "question": [
            "how",
            "many",
            "have",
            "order",
            "taxonomy",
            "as",
            "bacillales",
            "and",
            "division",
            "as",
            "firmicutes",
            "are",
            "there",
            "[sep]",
            "http://dbpedia.org/resource/bacillales",
            "http://dbpedia.org/resource/firmicutes",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/division"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacillales",
            "http://dbpedia.org/resource/Firmicutes"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/division"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "exact_match": "match"
    },
    {
        "uid": 1983,
        "question": [
            "in",
            "how",
            "many",
            "regions",
            "is",
            "the",
            "baco",
            "noir",
            "made",
            "[sep]",
            "http://dbpedia.org/resource/baco_noir",
            "[sep]",
            "http://dbpedia.org/ontology/wineregion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Baco_noir"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/wineRegion"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 2248,
        "question": [
            "how",
            "many",
            "teams",
            "was",
            "garry",
            "unger",
            "in",
            "previously",
            "[sep]",
            "http://dbpedia.org/resource/garry_unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerteam",
            "http://dbpedia.org/ontology/sportsteam"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Garry_Unger",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerTeam",
            "http://dbpedia.org/ontology/SportsTeam"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 6,
        "question": [
            "what",
            "tv",
            "series",
            "can",
            "be",
            "said",
            "to",
            "be",
            "related",
            "to",
            "the",
            "sarah",
            "jane",
            "adventure",
            "and",
            "dr",
            "who",
            "confidential",
            "[sep]",
            "http://dbpedia.org/resource/the_sarah_jane_adventures",
            "http://dbpedia.org/resource/doctor_who_confidential",
            "[sep]",
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/related"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Sarah_Jane_Adventures",
            "http://dbpedia.org/resource/Doctor_Who_Confidential"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/related",
            "http://dbpedia.org/ontology/related"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] <predpos@@2> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] <predpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 339,
        "question": [
            "who",
            "wrote",
            "the",
            "frost",
            "king",
            "[sep]",
            "http://dbpedia.org/resource/the_frost_king",
            "[sep]",
            "http://dbpedia.org/ontology/author"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Frost_King"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/author"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> . }",
        "exact_match": "match"
    },
    {
        "uid": 343,
        "question": [
            "in",
            "how",
            "many",
            "regions",
            "is",
            "english",
            "american",
            "spoken",
            "[sep]",
            "http://dbpedia.org/resource/english_americans",
            "[sep]",
            "http://dbpedia.org/property/region"
        ],
        "goldents": [
            "http://dbpedia.org/resource/English_Americans"
        ],
        "goldrels": [
            "http://dbpedia.org/property/region"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( <entpos@@1> <predpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 2690,
        "question": [
            "name",
            "the",
            "television",
            "show",
            "whose",
            "company",
            "is",
            "hbo",
            "and",
            "playtone",
            "[sep]",
            "http://dbpedia.org/resource/hbo",
            "http://dbpedia.org/resource/playtone",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/HBO",
            "http://dbpedia.org/resource/Playtone",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1296,
        "question": [
            "name",
            "the",
            "country",
            "with",
            "currency",
            "as",
            "aureus",
            "[sep]",
            "http://dbpedia.org/resource/aureus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Aureus",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/Country"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <predpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 100,
        "question": [
            "who",
            "were",
            "in",
            "the",
            "youth",
            "clubs",
            "that",
            "were",
            "in",
            "season",
            "of",
            "2015",
            "argentine",
            "primera",
            "division",
            "[sep]",
            "http://dbpedia.org/resource/2015_argentine_primera_divisi\u00f3n",
            "[sep]",
            "http://dbpedia.org/ontology/season",
            "http://dbpedia.org/property/youthclubs"
        ],
        "goldents": [
            "http://dbpedia.org/resource/2015_Argentine_Primera_Divisi\u00f3n"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/season",
            "http://dbpedia.org/property/youthclubs"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 2783,
        "question": [
            "what",
            "company",
            "made",
            "the",
            "front",
            "row",
            "and",
            "distributed",
            "big",
            "top",
            "ballet",
            "[sep]",
            "http://dbpedia.org/resource/big_top_ballet",
            "http://dbpedia.org/resource/front_row_(software)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/company"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Big_Top_Ballet",
            "http://dbpedia.org/resource/Front_Row_(software)",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/distributor",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/Company"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] ( [UNK] . . <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . [UNK] ( [UNK] ( [UNK] . . <entpos@@3> <entpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1768,
        "question": [
            "what",
            "are",
            "some",
            "common",
            "ingredients",
            "used",
            "in",
            "swedish",
            "dishes",
            "[sep]",
            "http://dbpedia.org/resource/sweden",
            "[sep]",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/ingredient"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sweden"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/ontology/ingredient"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 1811,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "fictional",
            "characters",
            "whose",
            "created",
            "by",
            "greg",
            "daniels",
            "and",
            "series",
            "is",
            "the",
            "office",
            "us",
            "tv",
            "series",
            "[sep]",
            "http://dbpedia.org/resource/greg_daniels",
            "http://dbpedia.org/resource/the_office_(u.s._tv_series)",
            "[sep]",
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/series"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Greg_Daniels",
            "http://dbpedia.org/resource/The_Office_(U.S._TV_series)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/series"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 }",
        "exact_match": "no match"
    },
    {
        "uid": 3100,
        "question": [
            "who",
            "discovered",
            "europa",
            "and",
            "callisto",
            "[sep]",
            "http://dbpedia.org/resource/europa_(moon)",
            "http://dbpedia.org/resource/callisto_(moon)",
            "[sep]",
            "http://dbpedia.org/ontology/discoverer",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Europa_(moon)",
            "http://dbpedia.org/resource/Callisto_(moon)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/discoverer",
            "http://dbpedia.org/ontology/discoverer"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <predpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <predpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <predpos@@1> <predpos@@1> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <predpos@@1> <predpos@@1> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 1870,
        "question": [
            "how",
            "many",
            "information",
            "appliance",
            "are",
            "manufactured",
            "by",
            "companies",
            "located",
            "in",
            "taiwan",
            "[sep]",
            "http://dbpedia.org/resource/taiwan",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/locationcity",
            "http://dbpedia.org/ontology/manufacturer",
            "http://dbpedia.org/ontology/informationappliance"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Taiwan",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/locationCity",
            "http://dbpedia.org/ontology/manufacturer",
            "http://dbpedia.org/ontology/InformationAppliance"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2617,
        "question": [
            "what",
            "is",
            "the",
            "associated",
            "band",
            "of",
            "the",
            "musical",
            "artist",
            "who",
            "is",
            "the",
            "producer",
            "of",
            "the",
            "trumpet",
            "kings",
            "meet",
            "joe",
            "turner",
            "[sep]",
            "http://dbpedia.org/resource/the_trumpet_kings_meet_joe_turner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/associatedband",
            "http://dbpedia.org/ontology/musicalartist"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Trumpet_Kings_Meet_Joe_Turner",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/producer",
            "http://dbpedia.org/ontology/associatedBand",
            "http://dbpedia.org/ontology/MusicalArtist"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr1 . <predpos@@3>",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr1 . ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 256,
        "question": [
            "what",
            "is",
            "the",
            "television",
            "show",
            "whose",
            "subsequent",
            "work",
            "is",
            "crusade",
            "tv",
            "series",
            "and",
            "developed",
            "by",
            "j",
            "michael",
            "straczynski",
            "[sep]",
            "http://dbpedia.org/resource/crusade_(tv_series)",
            "http://dbpedia.org/resource/j._michael_straczynski",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/subsequentwork",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Crusade_(TV_series)",
            "http://dbpedia.org/resource/J._Michael_Straczynski",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsequentWork",
            "http://dbpedia.org/ontology/developer",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> <predpos@@3> <predpos@@3>",
        "exact_match": "no match"
    }
]