[
    {
        "uid": 2929,
        "question": [
            "which",
            "astronauts",
            "mission",
            "was",
            "apollo",
            "11",
            "[sep]",
            "http://dbpedia.org/resource/apollo_11",
            "[sep]",
            "http://dbpedia.org/ontology/mission"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Apollo_11"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/mission"
        ],
        "target": " select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  }  ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> } }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] <entpos@@1> }",
        "exact_match": "match"
    },
    {
        "uid": 861,
        "question": [
            "how",
            "many",
            "different",
            "pole",
            "drivers",
            "are",
            "there",
            "of",
            "the",
            "gps",
            "when",
            "renault",
            "was",
            "the",
            "first",
            "team",
            "[sep]",
            "http://dbpedia.org/resource/renault_in_formula_one",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/firstteam",
            "http://dbpedia.org/ontology/poledriver",
            "http://dbpedia.org/ontology/formulaoneracer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Renault_in_Formula_One",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/firstTeam",
            "http://dbpedia.org/ontology/poleDriver",
            "http://dbpedia.org/ontology/FormulaOneRacer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> } }",
        "exact_match": "match"
    },
    {
        "uid": 2404,
        "question": [
            "how",
            "many",
            "buildings",
            "are",
            "located",
            "in",
            "toronto",
            "[sep]",
            "http://dbpedia.org/resource/toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/building"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/Building"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1657,
        "question": [
            "total",
            "number",
            "of",
            "places",
            "where",
            "people",
            "drafted",
            "in",
            "the",
            "detroit",
            "pistons",
            "have",
            "died",
            "[sep]",
            "http://dbpedia.org/resource/detroit_pistons",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/draftteam",
            "http://dbpedia.org/property/placeofdeath",
            "http://dbpedia.org/ontology/location"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Detroit_Pistons",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/draftTeam",
            "http://dbpedia.org/property/placeOfDeath",
            "http://dbpedia.org/ontology/Location"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 536,
        "question": [
            "give",
            "the",
            "total",
            "number",
            "of",
            "places",
            "to",
            "which",
            "airlines",
            "go",
            "who",
            "also",
            "go",
            "to",
            "glasgow",
            "[sep]",
            "http://dbpedia.org/resource/glasgow_airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/targetairport",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/place"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Glasgow_Airport",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/targetAirport",
            "http://dbpedia.org/property/destinations",
            "http://dbpedia.org/ontology/Place"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 ?vr0 <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 <predpos@@2> ?vr1 . ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 455,
        "question": [
            "how",
            "many",
            "people",
            "are",
            "there",
            "whose",
            "children",
            "died",
            "in",
            "indiana",
            "[sep]",
            "http://dbpedia.org/resource/indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> } }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1237,
        "question": [
            "how",
            "many",
            "molluscas",
            "are",
            "there",
            "whose",
            "families",
            "are",
            "buccinidae",
            "and",
            "buccinoidea",
            "[sep]",
            "http://dbpedia.org/resource/buccinidae",
            "http://dbpedia.org/resource/buccinoidea",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Buccinidae",
            "http://dbpedia.org/resource/Buccinoidea"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 [UNK] <entpos@@2> . }",
        "exact_match": "no match"
    },
    {
        "uid": 864,
        "question": [
            "how",
            "many",
            "people",
            "have",
            "worked",
            "in",
            "the",
            "band",
            "one",
            "of",
            "whose",
            "current",
            "member",
            "is",
            "hynief",
            "[sep]",
            "http://dbpedia.org/resource/hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/currentmembers",
            "http://dbpedia.org/ontology/bandmember",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/currentMembers",
            "http://dbpedia.org/ontology/bandMember",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 2464,
        "question": [
            "which",
            "predecessor",
            "of",
            "alexander",
            "downer",
            "was",
            "deputy",
            "to",
            "neil",
            "brown",
            "[sep]",
            "http://dbpedia.org/resource/alexander_downer",
            "http://dbpedia.org/resource/neil_brown_(australian_politician)",
            "[sep]",
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/deputy"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Alexander_Downer",
            "http://dbpedia.org/resource/Neil_Brown_(Australian_politician)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/deputy"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "no match"
    },
    {
        "uid": 291,
        "question": [
            "does",
            "the",
            "vadodara",
            "railway",
            "station",
            "lie",
            "at",
            "the",
            "end",
            "of",
            "the",
            "mathura",
            "vadodara",
            "route",
            "[sep]",
            "http://dbpedia.org/resource/mathura\u2013vadodara_section",
            "http://dbpedia.org/resource/vadodara_junction_railway_station",
            "[sep]",
            "http://dbpedia.org/ontology/routeend"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mathura\u2013Vadodara_Section",
            "http://dbpedia.org/resource/Vadodara_Junction_railway_station"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/routeEnd"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { [UNK] ( [UNK] <predpos@@1> <entpos@@2> }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> . }",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "exact_match": "match"
    },
    {
        "uid": 7,
        "question": [
            "how",
            "many",
            "shows",
            "does",
            "hbo",
            "have",
            "[sep]",
            "http://dbpedia.org/resource/hbo",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/HBO",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1798,
        "question": [
            "which",
            "shows",
            "opening",
            "themes",
            "was",
            "used",
            "to",
            "make",
            "if",
            "we",
            "were",
            "a",
            "movie",
            "[sep]",
            "http://dbpedia.org/resource/if_we_were_a_movie",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/subsequentwork",
            "http://dbpedia.org/ontology/openingtheme",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/If_We_Were_a_Movie",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsequentWork",
            "http://dbpedia.org/ontology/openingTheme",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] [UNK] [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2758,
        "question": [
            "isaac",
            "hayes",
            "has",
            "acted",
            "in",
            "which",
            "movies",
            "[sep]",
            "http://dbpedia.org/resource/isaac_hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/film",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Isaac_Hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Film",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@3> <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 768,
        "question": [
            "who",
            "is",
            "the",
            "film",
            "star",
            "of",
            "on",
            "air",
            "with",
            "ryan",
            "seacrest",
            "[sep]",
            "http://dbpedia.org/resource/on_air_with_ryan_seacrest",
            "[sep]",
            "http://dbpedia.org/ontology/starring"
        ],
        "goldents": [
            "http://dbpedia.org/resource/On_Air_with_Ryan_Seacrest"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select where ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 2821,
        "question": [
            "list",
            "bacteria",
            "whose",
            "order",
            "taxonomy",
            "is",
            "bacillales",
            "and",
            "domain",
            "is",
            "bacteria",
            "[sep]",
            "http://dbpedia.org/resource/bacillales",
            "http://dbpedia.org/resource/bacteria",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/domain",
            "http://dbpedia.org/ontology/bacteria"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacillales",
            "http://dbpedia.org/resource/Bacteria",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/ontology/domain",
            "http://dbpedia.org/ontology/Bacteria"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 454,
        "question": [
            "how",
            "many",
            "states",
            "does",
            "the",
            "pioneer",
            "corporation",
            "operate",
            "in",
            "[sep]",
            "http://dbpedia.org/resource/pioneer_corporation",
            "[sep]",
            "http://dbpedia.org/property/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Pioneer_Corporation"
        ],
        "goldrels": [
            "http://dbpedia.org/property/country"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> [UNK] <entpos@@1> . }",
        "exact_match": "no match"
    },
    {
        "uid": 983,
        "question": [
            "how",
            "many",
            "tv",
            "shows",
            "are",
            "of",
            "the",
            "company",
            "which",
            "are",
            "of",
            "company",
            "which",
            "is",
            "a",
            "subsidiary",
            "of",
            "big",
            "ticket",
            "entertainment",
            "[sep]",
            "http://dbpedia.org/resource/big_ticket_entertainment",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Big_Ticket_Entertainment",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 1199,
        "question": [
            "where",
            "are",
            "solidus",
            "and",
            "aureus",
            "used",
            "[sep]",
            "http://dbpedia.org/resource/solidus_(coin)",
            "http://dbpedia.org/resource/aureus",
            "[sep]",
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Solidus_(coin)",
            "http://dbpedia.org/resource/Aureus"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/currency",
            "http://dbpedia.org/ontology/currency"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> [UNK] ( [UNK] . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> [UNK] ( . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] . ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 2250,
        "question": [
            "how",
            "many",
            "different",
            "currencies",
            "are",
            "used",
            "in",
            "the",
            "places",
            "governed",
            "by",
            "the",
            "president",
            "of",
            "france",
            "[sep]",
            "http://dbpedia.org/resource/president_of_france",
            "[sep]",
            "http://dbpedia.org/property/leadertitle",
            "http://dbpedia.org/ontology/currency"
        ],
        "goldents": [
            "http://dbpedia.org/resource/President_of_France"
        ],
        "goldrels": [
            "http://dbpedia.org/property/leaderTitle",
            "http://dbpedia.org/ontology/currency"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 <predpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 1129,
        "question": [
            "is",
            "lieutenant",
            "general",
            "united",
            "states",
            "the",
            "superintendent",
            "of",
            "united",
            "states",
            "air",
            "force",
            "academy",
            "[sep]",
            "http://dbpedia.org/resource/united_states_air_force_academy",
            "http://dbpedia.org/resource/lieutenant_general_(united_states)",
            "[sep]",
            "http://dbpedia.org/property/superintendent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States_Air_Force_Academy",
            "http://dbpedia.org/resource/Lieutenant_general_(United_States)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/superintendent"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> [UNK] ( [UNK] }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] ( }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] ( <entpos@@2>",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> <entpos@@1> }",
        "exact_match": "no match"
    },
    {
        "uid": 1067,
        "question": [
            "count",
            "the",
            "drinks",
            "originated",
            "in",
            "england",
            "[sep]",
            "http://dbpedia.org/resource/england",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/beverage"
        ],
        "goldents": [
            "http://dbpedia.org/resource/England",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/origin",
            "http://dbpedia.org/ontology/Beverage"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> } }",
        "exact_match": "no match"
    }
]