[
    {
        "uid": 2138,
        "question": [
            "how",
            "many",
            "members",
            "are",
            "there",
            "of",
            "the",
            "order",
            "of",
            "bacillales",
            "[sep]",
            "http://dbpedia.org/resource/bacillales",
            "[sep]",
            "http://dbpedia.org/ontology/order"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacillales"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 2129,
        "question": [
            "how",
            "many",
            "bacterias",
            "have",
            "taxonomy",
            "as",
            "bacillales",
            "and",
            "domain",
            "as",
            "bacteria",
            "[sep]",
            "http://dbpedia.org/resource/bacillales",
            "http://dbpedia.org/resource/bacteria",
            "[sep]",
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/property/domain"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bacillales",
            "http://dbpedia.org/resource/Bacteria"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/order",
            "http://dbpedia.org/property/domain"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . }",
        "exact_match": "no match"
    },
    {
        "uid": 706,
        "question": [
            "count",
            "the",
            "different",
            "causes",
            "of",
            "death",
            "of",
            "christians",
            "[sep]",
            "http://dbpedia.org/resource/christianity",
            "[sep]",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/deathcause"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Christianity"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/deathCause"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( . . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 295,
        "question": [
            "how",
            "many",
            "religions",
            "are",
            "practiced",
            "by",
            "diplomats",
            "[sep]",
            "http://dbpedia.org/resource/diplomacy",
            "[sep]",
            "http://dbpedia.org/ontology/profession",
            "http://dbpedia.org/property/religion"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Diplomacy"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/profession",
            "http://dbpedia.org/property/religion"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> ?vr1 . <predpos@@2> <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 2532,
        "question": [
            "list",
            "the",
            "broadcast",
            "area",
            "of",
            "the",
            "tv",
            "stations",
            "which",
            "also",
            "serves",
            "in",
            "agalga",
            "[sep]",
            "http://dbpedia.org/resource/agal\u00e9ga",
            "[sep]",
            "http://dbpedia.org/ontology/broadcastarea",
            "http://dbpedia.org/ontology/broadcastarea"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Agal\u00e9ga"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/broadcastArea",
            "http://dbpedia.org/ontology/broadcastArea"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "answer_3": "select distinct count ( ?vr0 ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 1423,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "first",
            "drivers",
            "in",
            "all",
            "the",
            "gps",
            "where",
            "mika",
            "hakkinen",
            "was",
            "a",
            "first",
            "driver",
            "[sep]",
            "http://dbpedia.org/resource/mika_h\u00e4kkinen",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/poledriver",
            "http://dbpedia.org/ontology/firstdriver",
            "http://dbpedia.org/ontology/racingdriver"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mika_H\u00e4kkinen",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/poleDriver",
            "http://dbpedia.org/ontology/firstDriver",
            "http://dbpedia.org/ontology/RacingDriver"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3>",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "exact_match": "match"
    },
    {
        "uid": 1273,
        "question": [
            "count",
            "the",
            "awards",
            "received",
            "by",
            "immunologists",
            "[sep]",
            "http://dbpedia.org/resource/immunology",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/fields",
            "http://dbpedia.org/ontology/award",
            "http://dbpedia.org/ontology/award"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Immunology",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/fields",
            "http://dbpedia.org/ontology/award",
            "http://dbpedia.org/ontology/Award"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 ?vr1 <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 ?vr1 <entpos@@1> . <predpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1796,
        "question": [
            "how",
            "many",
            "religions",
            "are",
            "followed",
            "by",
            "the",
            "group",
            "whose",
            "architectural",
            "style",
            "can",
            "be",
            "seen",
            "on",
            "sanggar",
            "agung",
            "[sep]",
            "http://dbpedia.org/resource/sanggar_agung",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/architecturalstyle",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/ethnicgroup"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Sanggar_Agung",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/architecturalStyle",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/EthnicGroup"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 2937,
        "question": [
            "name",
            "the",
            "tv",
            "shows",
            "with",
            "network",
            "as",
            "nbc",
            "and",
            "company",
            "as",
            "paramount",
            "television",
            "[sep]",
            "http://dbpedia.org/resource/nbc",
            "http://dbpedia.org/resource/paramount_television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/NBC",
            "http://dbpedia.org/resource/Paramount_Television",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 447,
        "question": [
            "count",
            "all",
            "the",
            "games",
            "whose",
            "distributors",
            "are",
            "located",
            "in",
            "america",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "[sep]",
            "http://dbpedia.org/property/country",
            "http://dbpedia.org/property/distributor"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States"
        ],
        "goldrels": [
            "http://dbpedia.org/property/country",
            "http://dbpedia.org/property/distributor"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "no match"
    },
    {
        "uid": 21,
        "question": [
            "how",
            "many",
            "people",
            "have",
            "headed",
            "organizations",
            "headquartered",
            "at",
            "niederkirchnerstrae",
            "[sep]",
            "http://dbpedia.org/resource/niederkirchnerstra\u00dfe",
            "[sep]",
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Niederkirchnerstra\u00dfe"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/headquarter",
            "http://dbpedia.org/ontology/leader"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 1515,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "movies",
            "whose",
            "distributor",
            "is",
            "rko",
            "pictures",
            "and",
            "director",
            "of",
            "photography",
            "is",
            "gregg",
            "toland",
            "[sep]",
            "http://dbpedia.org/resource/rko_pictures",
            "http://dbpedia.org/resource/gregg_toland",
            "[sep]",
            "http://dbpedia.org/property/distributor",
            "http://dbpedia.org/ontology/cinematography"
        ],
        "goldents": [
            "http://dbpedia.org/resource/RKO_Pictures",
            "http://dbpedia.org/resource/Gregg_Toland"
        ],
        "goldrels": [
            "http://dbpedia.org/property/distributor",
            "http://dbpedia.org/ontology/cinematography"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <predpos@@2> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 1463,
        "question": [
            "the",
            "other",
            "side",
            "has",
            "hosted",
            "how",
            "many",
            "guests",
            "[sep]",
            "http://dbpedia.org/resource/the_other_side_(the_outer_limits)",
            "[sep]",
            "http://dbpedia.org/property/guests"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Other_Side_(The_Outer_Limits)"
        ],
        "goldrels": [
            "http://dbpedia.org/property/guests"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <entpos@@1> ?vr0 . <entpos@@2> . . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <entpos@@1> ?vr0 <predpos@@1> <entpos@@2> . . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <entpos@@1> . . <entpos@@2> . . }",
        "exact_match": "match"
    },
    {
        "uid": 1072,
        "question": [
            "in",
            "which",
            "country",
            "can",
            "i",
            "find",
            "the",
            "state",
            "academic",
            "opera",
            "and",
            "ballet",
            "theater",
            "and",
            "baku",
            "puppet",
            "theatre",
            "[sep]",
            "http://dbpedia.org/resource/azerbaijan_state_academic_opera_and_ballet_theater",
            "http://dbpedia.org/resource/baku_puppet_theatre",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/locationcountry",
            "http://dbpedia.org/ontology/locationcountry",
            "http://dbpedia.org/ontology/country"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Azerbaijan_State_Academic_Opera_and_Ballet_Theater",
            "http://dbpedia.org/resource/Baku_Puppet_Theatre",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/locationCountry",
            "http://dbpedia.org/ontology/locationCountry",
            "http://dbpedia.org/ontology/Country"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3>",
        "exact_match": "no match"
    },
    {
        "uid": 2101,
        "question": [
            "how",
            "many",
            "races",
            "has",
            "best",
            "mate",
            "won",
            "[sep]",
            "http://dbpedia.org/resource/best_mate",
            "[sep]",
            "http://dbpedia.org/property/race"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Best_Mate"
        ],
        "goldrels": [
            "http://dbpedia.org/property/race"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> } ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1>",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 3204,
        "question": [
            "which",
            "shows",
            "are",
            "from",
            "a",
            "company",
            "whose",
            "subsidiary",
            "is",
            "viacom",
            "productions",
            "[sep]",
            "http://dbpedia.org/resource/viacom_productions",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Viacom_Productions",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/ontology/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 3059,
        "question": [
            "what",
            "is",
            "the",
            "radio",
            "show",
            "created",
            "by",
            "timoteo",
            "jeffries",
            "about",
            "[sep]",
            "http://dbpedia.org/resource/timoteo_jeffries",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/format",
            "http://dbpedia.org/ontology/radioprogram"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Timoteo_Jeffries",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/creator",
            "http://dbpedia.org/ontology/format",
            "http://dbpedia.org/ontology/RadioProgram"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1041,
        "question": [
            "count",
            "everything",
            "garrisoned",
            "at",
            "the",
            "pentagon",
            "[sep]",
            "http://dbpedia.org/resource/the_pentagon",
            "[sep]",
            "http://dbpedia.org/property/garrison"
        ],
        "goldents": [
            "http://dbpedia.org/resource/The_Pentagon"
        ],
        "goldrels": [
            "http://dbpedia.org/property/garrison"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( ( <predpos@@1> ?vr0 }",
        "exact_match": "no match"
    },
    {
        "uid": 2053,
        "question": [
            "count",
            "the",
            "number",
            "of",
            "cities",
            "around",
            "the",
            "american",
            "mediterranean",
            "sea",
            "[sep]",
            "http://dbpedia.org/resource/american_mediterranean_sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/city"
        ],
        "goldents": [
            "http://dbpedia.org/resource/American_Mediterranean_Sea",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/cities",
            "http://dbpedia.org/ontology/City"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  <entpos@@1> <predpos@@1> ?vr0  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . .",
        "exact_match": "no match"
    },
    {
        "uid": 2076,
        "question": [
            "which",
            "educational",
            "institutes",
            "have",
            "campuses",
            "at",
            "iowa",
            "and",
            "indiana",
            "[sep]",
            "http://dbpedia.org/resource/iowa",
            "http://dbpedia.org/resource/indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/educationalinstitution"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Iowa",
            "http://dbpedia.org/resource/Indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/campus",
            "http://dbpedia.org/ontology/EducationalInstitution"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> } }",
        "exact_match": "match"
    },
    {
        "uid": 3228,
        "question": [
            "what",
            "is",
            "the",
            "state",
            "of",
            "origin",
            "of",
            "the",
            "president",
            "whose",
            "alma",
            "mater",
            "is",
            "hellenic",
            "naval",
            "academy",
            "[sep]",
            "http://dbpedia.org/resource/hellenic_naval_academy",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/almamater",
            "http://dbpedia.org/ontology/stateoforigin",
            "http://dbpedia.org/ontology/president"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Hellenic_Naval_Academy",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/almaMater",
            "http://dbpedia.org/ontology/stateOfOrigin",
            "http://dbpedia.org/ontology/President"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    }
]