[
    {
        "uid": 1492,
        "question": [
            "england",
            "is",
            "the",
            "origin",
            "of",
            "how",
            "many",
            "things",
            "[sep]",
            "http://dbpedia.org/resource/england",
            "[sep]",
            "http://dbpedia.org/property/origin"
        ],
        "goldents": [
            "http://dbpedia.org/resource/England"
        ],
        "goldrels": [
            "http://dbpedia.org/property/origin"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1>",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <entpos@@1> ?vr0 .",
        "exact_match": "no match"
    },
    {
        "uid": 1168,
        "question": [
            "how",
            "many",
            "movies",
            "have",
            "been",
            "cinematographed",
            "by",
            "jordan",
            "cronenweth",
            "[sep]",
            "http://dbpedia.org/resource/jordan_cronenweth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/cinematography",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Jordan_Cronenweth",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/cinematography",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2914,
        "question": [
            "list",
            "the",
            "people",
            "casted",
            "in",
            "betsys",
            "wedding",
            "and",
            "16",
            "candles",
            "[sep]",
            "http://dbpedia.org/resource/betsy's_wedding",
            "http://dbpedia.org/resource/sixteen_candles",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Betsy's_Wedding",
            "http://dbpedia.org/resource/Sixteen_Candles",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> [UNK] . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } }",
        "exact_match": "match"
    },
    {
        "uid": 1231,
        "question": [
            "murray",
            "gold",
            "has",
            "composed",
            "music",
            "for",
            "how",
            "many",
            "things",
            "[sep]",
            "http://dbpedia.org/resource/murray_gold",
            "[sep]",
            "http://dbpedia.org/ontology/composer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Murray_Gold"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/composer"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] <predpos@@1> <entpos@@1> . }",
        "exact_match": "no match"
    },
    {
        "uid": 1835,
        "question": [
            "matthew",
            "kane",
            "and",
            "park",
            "rankin",
            "are",
            "citizens",
            "of",
            "which",
            "country",
            "[sep]",
            "http://dbpedia.org/resource/matthew_kane_(actor)",
            "http://dbpedia.org/resource/park_rankin",
            "[sep]",
            "http://dbpedia.org/ontology/citizenship",
            "http://dbpedia.org/ontology/citizenship"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Matthew_Kane_(actor)",
            "http://dbpedia.org/resource/Park_Rankin"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/citizenship",
            "http://dbpedia.org/ontology/citizenship"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 .",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1>",
        "exact_match": "no match"
    },
    {
        "uid": 2022,
        "question": [
            "name",
            "some",
            "local",
            "authorities",
            "of",
            "schools",
            "which",
            "have",
            "a",
            "mixed",
            "gender",
            "education",
            "system",
            "[sep]",
            "http://dbpedia.org/resource/mixed-sex_education",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/gender",
            "http://dbpedia.org/ontology/localauthority",
            "http://dbpedia.org/ontology/school"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Mixed-sex_education",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/gender",
            "http://dbpedia.org/ontology/localAuthority",
            "http://dbpedia.org/ontology/School"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . . <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . . <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2154,
        "question": [
            "what",
            "is",
            "the",
            "total",
            "number",
            "of",
            "software",
            "whose",
            "programming",
            "language",
            "is",
            "c",
            "and",
            "operating",
            "system",
            "is",
            "microsoft",
            "windows",
            "[sep]",
            "http://dbpedia.org/resource/c++",
            "http://dbpedia.org/resource/microsoft_windows",
            "[sep]",
            "http://dbpedia.org/ontology/programminglanguage",
            "http://dbpedia.org/ontology/operatingsystem"
        ],
        "goldents": [
            "http://dbpedia.org/resource/C++",
            "http://dbpedia.org/resource/Microsoft_Windows"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/programmingLanguage",
            "http://dbpedia.org/ontology/operatingSystem"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_2": "select distinct ?vr0 where ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where <entpos@@1> ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "exact_match": "match"
    },
    {
        "uid": 1201,
        "question": [
            "whose",
            "military",
            "units",
            "are",
            "vmf218",
            "and",
            "vmf155",
            "[sep]",
            "http://dbpedia.org/resource/vmf-218",
            "http://dbpedia.org/resource/vmf-155",
            "[sep]",
            "http://dbpedia.org/ontology/militaryunit",
            "http://dbpedia.org/ontology/militaryunit"
        ],
        "goldents": [
            "http://dbpedia.org/resource/VMF-218",
            "http://dbpedia.org/resource/VMF-155"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/militaryUnit",
            "http://dbpedia.org/ontology/militaryUnit"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . <entpos@@2> <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 1936,
        "question": [
            "which",
            "settelment",
            "area",
            "is",
            "the",
            "home",
            "town",
            "of",
            "the",
            "danny",
            "felice",
            "and",
            "cline",
            "buckens",
            "[sep]",
            "http://dbpedia.org/resource/danny_felice",
            "http://dbpedia.org/resource/c\u00e9line_buckens",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/settlement"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Danny_Felice",
            "http://dbpedia.org/resource/C\u00e9line_Buckens",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/hometown",
            "http://dbpedia.org/ontology/Settlement"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . <entpos@@3> <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . <entpos@@3> <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 3013,
        "question": [
            "list",
            "the",
            "film",
            "starring",
            "of",
            "the",
            "movies",
            "whose",
            "editor",
            "is",
            "harvey",
            "rosenstock",
            "[sep]",
            "http://dbpedia.org/resource/harvey_rosenstock",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/editing",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Harvey_Rosenstock",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/editing",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> } <entpos@@2>",
        "exact_match": "no match"
    },
    {
        "uid": 1648,
        "question": [
            "is",
            "facebook",
            "a",
            "public",
            "company",
            "[sep]",
            "http://dbpedia.org/resource/facebook",
            "http://dbpedia.org/resource/public_company",
            "[sep]",
            "http://dbpedia.org/property/companytype"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Facebook",
            "http://dbpedia.org/resource/Public_company"
        ],
        "goldrels": [
            "http://dbpedia.org/property/companyType"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> <entpos@@2>",
        "answer_3": "ask where { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1890,
        "question": [
            "how",
            "many",
            "companies",
            "have",
            "developed",
            "cross",
            "platformed",
            "softwares",
            "[sep]",
            "http://dbpedia.org/resource/cross-platform",
            "[sep]",
            "http://dbpedia.org/property/operatingsystem",
            "http://dbpedia.org/ontology/developer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Cross-platform"
        ],
        "goldrels": [
            "http://dbpedia.org/property/operatingSystem",
            "http://dbpedia.org/ontology/developer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 2598,
        "question": [
            "name",
            "the",
            "saint",
            "whose",
            "major",
            "shrine",
            "is",
            "in",
            "canada",
            "and",
            "was",
            "canonized",
            "by",
            "pope",
            "benedict",
            "xvi",
            "[sep]",
            "http://dbpedia.org/resource/canada",
            "http://dbpedia.org/resource/pope_benedict_xvi",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/majorshrine",
            "http://dbpedia.org/ontology/canonizedby",
            "http://dbpedia.org/ontology/saint"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Canada",
            "http://dbpedia.org/resource/Pope_Benedict_XVI",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/majorShrine",
            "http://dbpedia.org/ontology/canonizedBy",
            "http://dbpedia.org/ontology/Saint"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 615,
        "question": [
            "on",
            "which",
            "subjects",
            "does",
            "the",
            "author",
            "of",
            "the",
            "novel",
            "thud",
            "delve",
            "[sep]",
            "http://dbpedia.org/resource/thud!",
            "[sep]",
            "http://dbpedia.org/ontology/nonfictionsubject"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Thud!"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/nonFictionSubject"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <predpos@@1>",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 <predpos@@1>",
        "exact_match": "match"
    },
    {
        "uid": 756,
        "question": [
            "which",
            "religions",
            "people",
            "are",
            "member",
            "of",
            "bjp",
            "[sep]",
            "http://dbpedia.org/resource/bharatiya_janata_party",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/party",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Bharatiya_Janata_Party",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/party",
            "http://dbpedia.org/ontology/religion",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 ?vr1 ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2404,
        "question": [
            "how",
            "many",
            "buildings",
            "are",
            "located",
            "in",
            "toronto",
            "[sep]",
            "http://dbpedia.org/resource/toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/building"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Toronto",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/location",
            "http://dbpedia.org/ontology/Building"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 811,
        "question": [
            "what",
            "are",
            "the",
            "baseball",
            "players",
            "who",
            "played",
            "for",
            "san",
            "francisco",
            "giants",
            "[sep]",
            "http://dbpedia.org/resource/san_francisco_giants",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/baseballplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/San_Francisco_Giants",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/BaseballPlayer"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0",
        "exact_match": "match"
    },
    {
        "uid": 1739,
        "question": [
            "list",
            "the",
            "software",
            "which",
            "uses",
            "microsoft",
            "windows",
            "as",
            "their",
            "operating",
            "system",
            "[sep]",
            "http://dbpedia.org/resource/microsoft_windows",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/operatingsystem",
            "http://dbpedia.org/ontology/software"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Microsoft_Windows",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/operatingSystem",
            "http://dbpedia.org/ontology/Software"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <predpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 455,
        "question": [
            "how",
            "many",
            "people",
            "are",
            "there",
            "whose",
            "children",
            "died",
            "in",
            "indiana",
            "[sep]",
            "http://dbpedia.org/resource/indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/deathplace",
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Indiana",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/deathPlace",
            "http://dbpedia.org/ontology/child",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1237,
        "question": [
            "how",
            "many",
            "molluscas",
            "are",
            "there",
            "whose",
            "families",
            "are",
            "buccinidae",
            "and",
            "buccinoidea",
            "[sep]",
            "http://dbpedia.org/resource/buccinidae",
            "http://dbpedia.org/resource/buccinoidea",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Buccinidae",
            "http://dbpedia.org/resource/Buccinoidea"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "target": " select distinct count ( ?vr0 )  where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> }  ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> } }",
        "answer_1": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] ( ?vr1 . ?vr1 }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> ?vr1 . <predpos@@2> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 864,
        "question": [
            "how",
            "many",
            "people",
            "have",
            "worked",
            "in",
            "the",
            "band",
            "one",
            "of",
            "whose",
            "current",
            "member",
            "is",
            "hynief",
            "[sep]",
            "http://dbpedia.org/resource/hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/currentmembers",
            "http://dbpedia.org/ontology/bandmember",
            "http://dbpedia.org/ontology/person"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Hynief",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/currentMembers",
            "http://dbpedia.org/ontology/bandMember",
            "http://dbpedia.org/ontology/Person"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3>",
        "exact_match": "match"
    }
]