[
    {
        "uid": 2464,
        "question": [
            "which",
            "predecessor",
            "of",
            "alexander",
            "downer",
            "was",
            "deputy",
            "to",
            "neil",
            "brown",
            "[sep]",
            "http://dbpedia.org/resource/alexander_downer",
            "http://dbpedia.org/resource/neil_brown_(australian_politician)",
            "[sep]",
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/deputy"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Alexander_Downer",
            "http://dbpedia.org/resource/Neil_Brown_(Australian_politician)"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/predecessor",
            "http://dbpedia.org/ontology/deputy"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . .",
        "exact_match": "no match"
    },
    {
        "uid": 2202,
        "question": [
            "how",
            "many",
            "publisher",
            "have",
            "been",
            "founded",
            "by",
            "american",
            "citizens",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/stateoforigin",
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/publisher"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/stateOfOrigin",
            "http://dbpedia.org/ontology/founder",
            "http://dbpedia.org/ontology/Publisher"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> <predpos@@2> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "exact_match": "no match"
    },
    {
        "uid": 1681,
        "question": [
            "whose",
            "families",
            "are",
            "buccinoidea",
            "and",
            "buccinidae",
            "[sep]",
            "http://dbpedia.org/resource/buccinoidea",
            "http://dbpedia.org/resource/buccinidae",
            "[sep]",
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Buccinoidea",
            "http://dbpedia.org/resource/Buccinidae"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/family",
            "http://dbpedia.org/ontology/family"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> ?vr0 . }",
        "exact_match": "match"
    },
    {
        "uid": 3121,
        "question": [
            "who",
            "all",
            "are",
            "starring",
            "in",
            "the",
            "movies",
            "where",
            "director",
            "of",
            "photography",
            "is",
            "john",
            "derek",
            "[sep]",
            "http://dbpedia.org/resource/john_derek",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_Derek",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/cinematography",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 550,
        "question": [
            "count",
            "the",
            "total",
            "number",
            "of",
            "mammals",
            "whose",
            "phylum",
            "is",
            "chordate",
            "and",
            "order",
            "taxonomy",
            "is",
            "diprotodontia",
            "[sep]",
            "http://dbpedia.org/resource/chordate",
            "http://dbpedia.org/resource/diprotodontia",
            "[sep]",
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/order"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Chordate",
            "http://dbpedia.org/resource/Diprotodontia"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/phylum",
            "http://dbpedia.org/ontology/order"
        ],
        "target": " select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  }  ",
        "answer_0": "select distinct count ( ?vr0 ) where <entpos@@1> . <predpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where <entpos@@1> . <predpos@@1> <predpos@@2> . . }",
        "answer_2": "select distinct count ( ?vr0 ) where <entpos@@1> . <predpos@@1> <predpos@@1> ?vr0 . } <entpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where <entpos@@1> . <predpos@@1> . ?vr0 . }",
        "exact_match": "no match"
    },
    {
        "uid": 712,
        "question": [
            "give",
            "me",
            "a",
            "count",
            "of",
            "all",
            "ice",
            "hockey",
            "players",
            "whose",
            "teams",
            "are",
            "headcoached",
            "by",
            "john",
            "tortorella",
            "[sep]",
            "http://dbpedia.org/resource/john_tortorella",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/property/headcoach",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/icehockeyplayer"
        ],
        "goldents": [
            "http://dbpedia.org/resource/John_Tortorella",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/property/headCoach",
            "http://dbpedia.org/ontology/team",
            "http://dbpedia.org/ontology/IceHockeyPlayer"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . <predpos@@3>",
        "answer_3": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1",
        "exact_match": "no match"
    },
    {
        "uid": 988,
        "question": [
            "is",
            "stephanie",
            "a",
            "female",
            "[sep]",
            "http://dbpedia.org/resource/stephanie",
            "http://dbpedia.org/resource/female",
            "[sep]",
            "http://dbpedia.org/property/gender"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Stephanie",
            "http://dbpedia.org/resource/Female"
        ],
        "goldrels": [
            "http://dbpedia.org/property/gender"
        ],
        "target": "ask where  {  <entpos@@1> <predpos@@1> <entpos@@2>  } ",
        "answer_0": "ask where { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "answer_1": "ask where { <entpos@@1> <predpos@@1> <entpos@@2>",
        "answer_2": "ask where { <entpos@@1> <predpos@@1> [UNK] }",
        "answer_3": "ask ask { <entpos@@1> <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2878,
        "question": [
            "what",
            "continent",
            "of",
            "the",
            "world",
            "has",
            "baja",
            "california",
            "peninsula",
            "and",
            "also",
            "has",
            "wepg",
            "in",
            "one",
            "of",
            "its",
            "cities",
            "[sep]",
            "http://dbpedia.org/resource/baja_california_peninsula",
            "http://dbpedia.org/resource/wepg",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/continent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Baja_California_Peninsula",
            "http://dbpedia.org/resource/WEPG",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/location",
            "http://dbpedia.org/ontology/city",
            "http://dbpedia.org/ontology/Continent"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 . <entpos@@3> <entpos@@3> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 1757,
        "question": [
            "who",
            "was",
            "engaged",
            "in",
            "wars",
            "of",
            "fort",
            "gadsden",
            "and",
            "fort",
            "barrancas",
            "[sep]",
            "http://dbpedia.org/resource/fort_gadsden",
            "http://dbpedia.org/resource/fort_barrancas",
            "[sep]",
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/battle"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Fort_Gadsden",
            "http://dbpedia.org/resource/Fort_Barrancas"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/battle",
            "http://dbpedia.org/ontology/battle"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_1": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@1> <entpos@@2> }",
        "exact_match": "match"
    },
    {
        "uid": 2758,
        "question": [
            "isaac",
            "hayes",
            "has",
            "acted",
            "in",
            "which",
            "movies",
            "[sep]",
            "http://dbpedia.org/resource/isaac_hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/film",
            "http://dbpedia.org/ontology/film"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Isaac_Hayes",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/starring",
            "http://dbpedia.org/ontology/Film",
            "http://dbpedia.org/ontology/Film"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@3>",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . ?vr0 <entpos@@2> <predpos@@2>",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> . <entpos@@2> <entpos@@2> <predpos@@3>",
        "exact_match": "match"
    },
    {
        "uid": 110,
        "question": [
            "how",
            "many",
            "people",
            "live",
            "in",
            "wilton",
            "connecticut",
            "[sep]",
            "http://dbpedia.org/resource/wilton,_connecticut",
            "[sep]",
            "http://dbpedia.org/property/residence"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Wilton,_Connecticut"
        ],
        "goldrels": [
            "http://dbpedia.org/property/residence"
        ],
        "target": "select distinct count ( ?vr0 )  where  { ?vr0 <predpos@@1> <entpos@@1>  .  } ",
        "answer_0": "select distinct count ( ?vr0 ) where { <entpos@@1> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr0 <predpos@@1> <entpos@@1> . }",
        "answer_2": "select distinct count ( ?vr0 ) where { [UNK] ( [UNK] <predpos@@1> ?vr0 .",
        "answer_3": "select distinct count ( ?vr0 ) where { [UNK] ( <entpos@@1> <predpos@@1> }",
        "exact_match": "no match"
    },
    {
        "uid": 847,
        "question": [
            "what",
            "are",
            "all",
            "the",
            "prizes",
            "won",
            "by",
            "the",
            "writer",
            "of",
            "a",
            "grand",
            "day",
            "out",
            "[sep]",
            "http://dbpedia.org/resource/a_grand_day_out",
            "[sep]",
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/award"
        ],
        "goldents": [
            "http://dbpedia.org/resource/A_Grand_Day_Out"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/writer",
            "http://dbpedia.org/ontology/award"
        ],
        "target": "select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0  .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr1 <predpos@@1> ?vr0 . }",
        "answer_3": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr1 . ?vr0 <predpos@@2> ?vr1 . }",
        "exact_match": "match"
    },
    {
        "uid": 1815,
        "question": [
            "where",
            "did",
            "allama",
            "matthews",
            "study",
            "[sep]",
            "http://dbpedia.org/resource/allama_matthews",
            "[sep]",
            "http://dbpedia.org/ontology/college"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Allama_Matthews"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/college"
        ],
        "target": " select distinct ?vr0 where  {  <entpos@@1> <predpos@@1> ?vr0  }  ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 }",
        "answer_1": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 }",
        "answer_2": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> [UNK] }",
        "answer_3": "select distinct ?vr0 ( { <entpos@@1> <predpos@@1> ?vr0 }",
        "exact_match": "match"
    },
    {
        "uid": 1483,
        "question": [
            "list",
            "all",
            "the",
            "former",
            "partners",
            "of",
            "the",
            "figure",
            "skater",
            "whose",
            "one",
            "of",
            "the",
            "former",
            "partner",
            "was",
            "andrea",
            "poapst",
            "[sep]",
            "http://dbpedia.org/resource/andrea_poapst",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/formerpartner",
            "http://dbpedia.org/ontology/figureskater"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Andrea_Poapst",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/formerPartner",
            "http://dbpedia.org/ontology/FigureSkater"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> } }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 ?vr0 <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 636,
        "question": [
            "whose",
            "opponents",
            "are",
            "ike",
            "clanton",
            "and",
            "billy",
            "clanton",
            "[sep]",
            "http://dbpedia.org/resource/ike_clanton",
            "http://dbpedia.org/resource/billy_clanton",
            "[sep]",
            "http://dbpedia.org/ontology/opponent",
            "http://dbpedia.org/ontology/opponent"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Ike_Clanton",
            "http://dbpedia.org/resource/Billy_Clanton"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/opponent",
            "http://dbpedia.org/ontology/opponent"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> .  } ",
        "answer_0": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@1> ?vr0 . }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . }",
        "answer_2": "select distinct ?vr0 where { <entpos@@1> <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> ?vr0 }",
        "answer_3": "select distinct ?vr0 where { [UNK] ( [UNK] <predpos@@1> ?vr0 . <entpos@@2> <predpos@@2> <entpos@@2> }",
        "exact_match": "no match"
    },
    {
        "uid": 2665,
        "question": [
            "which",
            "tv",
            "shows",
            "executive",
            "producer",
            "is",
            "douglas",
            "netter",
            "and",
            "composed",
            "by",
            "stewart",
            "copeland",
            "[sep]",
            "http://dbpedia.org/resource/douglas_netter",
            "http://dbpedia.org/resource/stewart_copeland",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/executiveproducer",
            "http://dbpedia.org/ontology/composer",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Douglas_Netter",
            "http://dbpedia.org/resource/Stewart_Copeland",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/executiveProducer",
            "http://dbpedia.org/ontology/composer",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2>  . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <predpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 2062,
        "question": [
            "what",
            "is",
            "the",
            "show",
            "which",
            "opens",
            "with",
            "gary",
            "portnoy",
            "and",
            "where",
            "everybody",
            "knows",
            "your",
            "name",
            "[sep]",
            "http://dbpedia.org/resource/gary_portnoy",
            "http://dbpedia.org/resource/where_everybody_knows_your_name",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/openingtheme",
            "http://dbpedia.org/ontology/openingtheme",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Gary_Portnoy",
            "http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/openingTheme",
            "http://dbpedia.org/ontology/openingTheme",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  {  ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@1> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> <entpos@@2> . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> [UNK] ( [UNK] . ?vr0 <entpos@@3> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> [UNK] ( [UNK] . <entpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 2496,
        "question": [
            "which",
            "fields",
            "are",
            "covered",
            "by",
            "academic",
            "journals",
            "in",
            "the",
            "us",
            "[sep]",
            "http://dbpedia.org/resource/united_states",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/property/discipline",
            "http://dbpedia.org/ontology/academicjournal"
        ],
        "goldents": [
            "http://dbpedia.org/resource/United_States",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/country",
            "http://dbpedia.org/property/discipline",
            "http://dbpedia.org/ontology/AcademicJournal"
        ],
        "target": "select distinct ?vr0 where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0  . ?vr1 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct ?vr0 where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@1> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct ?vr0 where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "answer_3": "select distinct ?vr0 where { ?vr1 <predpos@@1> ?vr1 . ?vr1 <predpos@@2> ?vr0 . ?vr1 <entpos@@2> <predpos@@3> }",
        "exact_match": "match"
    },
    {
        "uid": 983,
        "question": [
            "how",
            "many",
            "tv",
            "shows",
            "are",
            "of",
            "the",
            "company",
            "which",
            "are",
            "of",
            "company",
            "which",
            "is",
            "a",
            "subsidiary",
            "of",
            "big",
            "ticket",
            "entertainment",
            "[sep]",
            "http://dbpedia.org/resource/big_ticket_entertainment",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/Big_Ticket_Entertainment",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/subsidiary",
            "http://dbpedia.org/property/company",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct count ( ?vr0 )  where  {  ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1  . ?vr0 <entpos@@2> <predpos@@3> } ",
        "answer_0": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr0 <predpos@@2> ?vr1 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_1": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> <entpos@@1> . ?vr1 <predpos@@2> ?vr0 . ?vr0 <entpos@@2> <predpos@@3> }",
        "answer_2": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 } <entpos@@2> <entpos@@2> <entpos@@2>",
        "answer_3": "select distinct count ( ?vr0 ) where { ?vr1 <predpos@@1> [UNK] ( [UNK] . ?vr0 <predpos@@2> ?vr1 } <entpos@@2> <entpos@@2>",
        "exact_match": "match"
    },
    {
        "uid": 1261,
        "question": [
            "what",
            "are",
            "the",
            "television",
            "shows",
            "whose",
            "network",
            "is",
            "bbc",
            "hd",
            "[sep]",
            "http://dbpedia.org/resource/bbc_hd",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type",
            "[sep]",
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/televisionshow"
        ],
        "goldents": [
            "http://dbpedia.org/resource/BBC_HD",
            "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        ],
        "goldrels": [
            "http://dbpedia.org/ontology/network",
            "http://dbpedia.org/ontology/TelevisionShow"
        ],
        "target": "select distinct ?vr0 where  { ?vr0 <predpos@@1> <entpos@@1>  . ?vr0 <entpos@@2> <predpos@@2> } ",
        "answer_0": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_1": "select distinct ?vr0 where { ?vr0 <predpos@@1> <predpos@@1> . ?vr0 <entpos@@2> <predpos@@2> }",
        "answer_2": "select distinct ?vr0 where { ?vr0 <predpos@@1> <entpos@@1> . ?vr0 <entpos@@2> <predpos@@2> .",
        "answer_3": "select distinct ?vr0 where { ?vr0 <predpos@@1> [UNK] . [UNK] . <entpos@@2>",
        "exact_match": "match"
    }
]